{"code": "02-318", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2020}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": true, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Lecture 1 (via video conference): An introduction to the field of Medicine, and its primary objectives (the diagnosis, treatment, and prevention of disease). Also, overview of course.\nLecture 2 (via video conference): An introduction to three tasks from the field of Computational Medicine (phenotyping; biomarker discovery; predictive modeling)\nLectures 3-5 (In Qatar): An introduction to three machine learning (data science) techniques for performing those tasks (clustering; feature selection; model building). A case-study illustrating the use of those methods. Hands-on demonstration/tutorial on the use of a free software tool for performing clustering, feature selection, and model building. Overview and exploration of the data set the students will use for their final project.\nLectures 6-7 (via video conference). A survey of some advanced topics in Computational Medicine (ex, design and selection of interventions; handling noisy data sets). Guidance on the final deliverable (a report on their results on the provided data set).", "prerequisite_knowledge": null, "assessment_structure": null, "goals": "By the end of the micocourse, students should be able to Explain three core computational challenges in medicine Explain three computational methods for addressing these challenges Demonstrate these methods through the use of software applied to a clinical data set", "relevance": "The course is especially relevant to students enrolled in the Biological Sciences, Computational Biology, and Computer Science programs. Students will be exposed to core techniques from Machine Learning (data science), as well as to key computational challenges encountered in modern medicine. It is also possible that the course might be of interest to students enrolled in the Weill-Cornell-Qatar Integrated medical program.", "learning_resources": null, "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "This course is an introduction to computational methods relevant to the diagnosis and treatment of human diseases. It is the microcourse version of 02518, Computational Medicine. The course begins with an introduction to the field of Medicine, and an overview of the primary clinical tasks associated with Computational Medicine phenotyping biomarker discovery predictive modeling. Next, we provide an introduction to several Machine Learning techniques, and how those techniques can be used to perform the clinical tasks. For the remainder of the course, students will be guided through the analysis of a clinical data set to gain experience with these techniques. No prior experience with Medicine, Machine Learning, or computer programming is required. Students will be graded based on quizzes and one homework.", "short_name": "INTRO COMP MEDICINE", "co_reqs": [], "instructors": [{"username": "cjl", "first_name": "Christopher", "last_name": "Langmead", "tags": [], "hours_per_week": 0, "id": 1739, "semesters_taught": [{"semester": 2, "year": 2020}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": true, "topic": null, "name": "Introduction to Computational Medicine", "base_name": "Introduction to Computational Medicine", "skills": [], "success": true, "attributes": []}