{"code": "03-135", "offered_in_campuses": [1], "offerings": [{"semesters": [], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Central dogma, membrane diffusion and transport, cell signaling. Introductory genetics and epigenetics of gene expression regulation. Nervous system; Skeletal and Muscular systems; Cardiovascular system; Blood, lymphatics and Immune systems; Digestive system; Respiratory system; Urinary system; Endocrine and reproductive system; Diseases such as cancer, diabetes, obesity, kidney disease, liver disease, heart disease.", "prerequisite_knowledge": "No prerequisite knowledge is required.", "assessment_structure": "Exams, online quizzes, in-class demonstrations, participation, oral/written presentations on disease topics", "goals": "Upon successful completion of this course, students will be able to describe the relationship between structure and function for many of the organ systems of the human body, establish an intellectual framework for how different organ systems work together, apply key cellular functions to understand the cellular basis of normal organ function homeostasis and how this is altered during disease states, develop skills in critical thinking and problem solving in relation to our understanding of human structure and function, appreciate how an understanding of structure and function has led to advances in medical diagnostics, communicate their understanding of human health and disease to a peer audience.", "relevance": "Structure and Function of the Human Body is designed to provide non-science majors a broad introduction to foundational concepts in human biology, including the Central Dogma, gene expression regulation, and epigenetics against the backdrop of key aspects of human anatomy and physiology that every informed citizen should be familiar.", "learning_resources": "Piazza, in-class attendance, current event assignments, guest lectures", "extra_time_commitment": "None identified beyond the course schedule"}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "Structure and Function of the Human Body is a nonmajors course designed to explore fundamental relationships between form and function of the human body. The anatomy and physiology of major organ systems will be studied in the context of normal and disease states. Students will learn about critical biological processes such as the central dogma, membrane diffusion and transport, cell signaling, gas exchange, blood flow, nutrient absorption, blood pH balance, and action potential generation and propagation. Students will then apply this knowledge to understand how organs respond to various inputs in maintaining homeostasis. Handson demonstrations will be incorporated to provide a practical framework for the information presented in lectures. At the culmination of the semester, students will gain a broad understanding of how the body systems function at the cellular, tissue and organ levels and be able to relate simple physiological processes to better understand highly prevalent diseases in society.", "short_name": "STR & FCT HUMAN BODY", "co_reqs": [], "instructors": [], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Structure and Function of the Human Body", "base_name": "Structure and Function of the Human Body", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "diversity", "id": 3}, {"type": "attribute", "name": "ethics", "id": 5}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "global", "id": 7}, {"type": "attribute", "name": "interdisciplinary", "id": 10}]}