{"code": "03-151", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 2, "year": 2021}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 10.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Honors Modern Biology examines topics routinely studied by biologists, such as cellular and protein structure and function, glycolysis and respiration, genetics, cell signaling, molecular biology, and biochemistry. An emphasis will be placed on understanding how the experiments that lead to our current knowledge were done.", "prerequisite_knowledge": "High school biology course, preferably AP, or the equivalent, credit.", "assessment_structure": "The assessment structure will include several exams during the semester and a cumulative final exam. Students should expect to complete frequent homework assignments and may also take quizzes (depending on the individual instructors).", "goals": "Apply knowledge of molecular and cellular processes to solve problembased questions about biological systems in normal function and disease states. Understand the experimental strategies that biologists use to study the natural world. Able to interpret data and predict outcomes from hypothetical experiments.", "relevance": "Students will learn about the relationship between structure and function, as it relates to processes at the cellular and molecular level, to appreciate normal versus disease and experimental approaches.", "learning_resources": "There will be weekly instructor and TA office hours. Supplemental instruction (SI) may also be available. A textbook will also be used, but may vary between sections as determined by individual instructors. Additional course materials may include the following: online study materials, lecture slides and notes, videos, and selected papers from the literature. In recitation, students will learn problem solving and experimental approaches, as well as read and discuss articles from the primary scientific literature.", "extra_time_commitment": "Students are expected to spend an average of 4-5 hours outside of class working on homework assignments or preparing for exams. Students are encouraged to study in small groups and attend instructor or TA office hours and study sessions, as well as supplemental instruction (SI) sessions if available."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 10.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}], "units": 10.0, "website": "http://www.cmu.edu/bio/undergrad/courses/index.html", "long_desc": "Honors Modern Biology 03151 is an honors introductory course. This course has been designed for freshman students with an interest in a major in the biological sciences who have had solid preparation in this field as indicated by the following examinations SAT II Molecular Biology, AP, or IB Biology. This course will present the concepts and principles necessary for a general understanding of the processes occurring in living cells and is the basis for further study in cell biology, biochemistry, genetics, molecular and developmental biology. While similar core topics will be covered in all sections of Modern Biology, this section will be offered at an accelerated pace, requiring more independent learning. The extra class time this pacing provides will allow the exploration of the molecular basis of life to help students integrate and apply the core principles of biology covered in the course.  THIS SECTION IS RESERVED FOR INCOMING FIRSTYEAR MCS STUDENTS.", "short_name": "HONORS MOD BIOLOGY", "co_reqs": [], "instructors": [{"username": "rule", "first_name": "Gordon", "last_name": "Rule", "tags": [], "hours_per_week": 0, "id": 1869, "semesters_taught": [{"semester": 1, "year": 2016}, {"semester": 1, "year": 2017}, {"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 2, "year": 2021}, {"semester": 1, "year": 2021}], "photo_url": null}, {"username": "naffara", "first_name": "Nesrine", "last_name": "Affara", "tags": [], "hours_per_week": 0, "id": 1360, "semesters_taught": [{"semester": 1, "year": 2017}, {"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "photo_url": null}, {"username": "khovis", "first_name": "Ken", "last_name": "Hovis", "tags": [], "hours_per_week": 0, "id": 967, "semesters_taught": [{"semester": 1, "year": 2015}, {"semester": 1, "year": 2016}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Honors Modern Biology", "base_name": "Honors Modern Biology", "skills": [{"id": 38, "name": "Biology", "slug": "biology"}, {"id": 153, "name": "Molecular Biology", "slug": "molecular-biology"}, {"id": 169, "name": "Genetics", "slug": "genetics"}], "success": true, "attributes": []}