{"code": "03-132", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2016}, {"semester": 1, "year": 2016}, {"semester": 1, "year": 2018}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The course will cover at least COVID-19, cancer, and genome editing, in addition to the essential aspects of molecular biology, cell biology, and genetics needed to understand those topics.", "prerequisite_knowledge": "High school level biology knowledge: DNA, genes, cells", "assessment_structure": "The final grade will be based on frequent ungraded assessments, 3 graded quizzes, 3 projects (both team and individual), and class attendance and participation.", "goals": "Students will gain an understanding of the biology behind specific health related topics that they are likely to encounter in their daily lives, and gain the skills to apply their understanding to new topics in human biology and health.", "relevance": "The biology topics covered in this course are relevant to present and future individual health decisions, and to health and science policy.", "learning_resources": "The course will use a wide variety of resources including but not limited to: recoded lectures and other video resources, articles in the mainstream media and in scientific journals, and radio broadcasts.", "extra_time_commitment": "There are no extra time commitments."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 3, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": "http://www.cmu.edu/bio/undergrad/courses/index.html", "long_desc": "The goal of this course is to give students an understanding of the biology that impacts their everyday lives. Disease can be a tragic part of human life, a fact that is even more apparent in during a global pandemic. To understand how specific diseases like COVID19 or cancer affect the human body, and how modern medicine can tackle them, this course includes a fundamental study of the basic molecular biology, genetics, and cell biology that underlies disease. This is a topicsbased course, with topics chosen to cover aspects of biology and health that students are likely to encounter in their daily lives. The topics for summer 2022 will include COVID19, genome editing, and cancer. We will explore these topics from both a basic science and a modern medicine perspective. Students will gain the expertise to critically evaluate media reports about biology and health, and to ask the questions that will help them to make educated decisions in their lives.       Key topics The course will cover at least COVID19, cancer, and genome editing, in addition to the essential aspects of molecular biology, cell biology, and genetics needed to understand those topics.", "short_name": "BAS SCI TO MOD MEDCN", "co_reqs": [], "instructors": [{"username": "mohamedb", "first_name": "Mohamed", "last_name": "Bouaouina", "tags": [], "hours_per_week": 0, "id": 638, "semesters_taught": [{"semester": 2, "year": 2016}, {"semester": 1, "year": 2016}, {"semester": 1, "year": 2018}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Basic Science to Modern Medicine", "base_name": "Basic Science to Modern Medicine", "skills": [{"id": 23, "name": "Medicine", "slug": "medicine"}, {"id": 38, "name": "Biology", "slug": "biology"}, {"id": 169, "name": "Genetics", "slug": "genetics"}], "success": true, "attributes": [{"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "ethics", "id": 5}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "team project", "id": 17}]}