{"code": "03-131", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2015}, {"semester": 1, "year": 2017}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The topics are related to the cause and treatment of common diseases. Topics vary somewhat from year-to-year, but will typically include how antibiotics (e.g. penicillin) and antivirals (e.g. tamiflu) work to kill bacteria and viruses, cancer and its treatment with drugs and the immune system, diabetes, high cholesterol, allergies, and a wide spectrum of genetic diseases.", "prerequisite_knowledge": null, "assessment_structure": "Low stakes weekly quizzes and problem sets are designed to reinforce the course concepts and ensure life-long learning. There are four exams during the semester, one of which is taken during the final exam period. A final project allows the student to explore a disease condition that was not covered in the course.", "goals": "To provide the student with lifelong knowledge such that they can make informed decisions regarding the medical treatment of a variety of diseases. In addition, students will understand the basis of the genetic inheritance of disease.", "relevance": "This course will help the student understand how many common diseases are caused and treated.", "learning_resources": "The students will be given background reading when necessary. Lecture handouts are detailed and cover all of the material that is required for the course. Students may also be given popular articles to read to prepare for class. Several laboratory exercises will help the student understand key concepts in the course.", "extra_time_commitment": "Students will be expected to spend 4-6 hours/week outside of class preparing for quizzes and exams, completing problem sets, writing very brief summaries of laboratory exercises, and reading one popular article approximately every week."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": "http://www.andrew.cmu.edu/user/rule/03_131/", "long_desc": "The central goals of this course are to explore the genetic basis of diseases and to explain the molecular basis of action for various drugs used to treat diseases. The first part of the course provides the student with sufficient background to understand the biological basis of drug action with emphasis on retroviral inhibitors. The usefulness of genetic engineering in the production of proteins for drug discovery is then explored. This is followed by an overview of DNA replication, transcription, and protein synthesis, with an emphasis on the inhibitory action of antibiotics on prokaryotic processes.  The fundamental properties of carbohydrates, lipids, and membranes are discussed at a level to develop an understanding of penicillin and the treatment of elevated cholesterol levels.  Signaling processes in eukaryotic cells is discussed with reference to cancer treatment and pain management.  The treatment of disease using antibody, and the treatment of inappropriate immune responses allergy is also discussed. The course ends with a discussion of inheritance and genetic deficiencies that give rise to disease.", "short_name": "GENES DRGS & DISEAS", "co_reqs": [], "instructors": [{"username": "rule", "first_name": "Gordon", "last_name": "Rule", "tags": [], "hours_per_week": 0, "id": 1869, "semesters_taught": [{"semester": 1, "year": 2015}, {"semester": 1, "year": 2017}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Genes Drugs & Diseases", "base_name": "Genes Drugs & Diseases", "skills": [{"id": 169, "name": "Genetics", "slug": "genetics"}], "success": true, "attributes": [{"type": "attribute", "name": "for non-majors", "id": 6}]}