{"code": "03-125", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The course will cover the history, methods, examples and terminology associated with the field of evolutionary biology.\n1) The history of evolutionary theory\n2) History of the scientific method\n3) General patterns of animal diversity\n4) A basic understanding of the fossil record and patterns of extinction\n5) How to reconstruct the history of life\n6) How to infer evolutionary processes\n7) How genetic variation arises\n8) How drift, selection and migration cause evolution\n9) The neutral theory\n10) The definition of a species and processes of speciation\n11) Some applications of game theory to evolution\n12) Application of evolution to conservation biology at CMU.", "prerequisite_knowledge": "no prior knowledge required", "assessment_structure": "three in class exams, homework, in-class quick quizzes, end of semester presentation", "goals": "1 To understand and interpret the evidence for evolution2 To learn how to design and test experiments for evolution3 To integrate your previous knowledge with evolutionary theory4 To understand the experiments and observations that have led to a conclusion", "relevance": "Evolution is the basis of biology and needed for any understanding of the natural world. Coverage of scientific method and history of science is prerequestive understanding for any science.", "learning_resources": "lecture notes will be made available as pdfs, textbook \"Evolution\" Bergstrom and Dugatkin, various web resources (e.g. HHMI interactive)", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "Evolutionary theory is the unifying principle of biology.  A good comprehension of the concepts that underlie this theory is therefore important to properly appreciate and understand any biological process. This course is designed for students intending to continue studies in biology so that they may gain an understanding of the evolutionary framework in their more advanced courses, and also nonbiology majors who want to extend their knowledge of biology at an introductory level.  The lectures will include i an examination of the history and development of evolutionary theory, ii consideration of some of the facts that have established the theory, iii an introduction to the concepts of phylogenetics, iv discussion of the patterns and mechanism that lead to the diversity and origins of the groups of life, v an introduction to genetics and population genetic theory, and vi discussion of and how this applies to natural selection and speciation.  The course will also include some more specialist topics, including evolution of development, sexual selection, evolutionary applications to medicine and conservation biology, and genome evolution.  Assessment will be based on several inclass exams and quizzes, homework assignments, a written term paper, and a final exam.", "short_name": "EVOLTN", "co_reqs": [], "instructors": [{"username": "mohamedb", "first_name": "Mohamed", "last_name": "Bouaouina", "tags": [], "hours_per_week": 0, "id": 638, "semesters_taught": [{"semester": 1, "year": 2017}, {"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Evolution", "base_name": "Evolution", "skills": [{"id": 169, "name": "Genetics", "slug": "genetics"}], "success": true, "attributes": [{"type": "attribute", "name": "for non-majors", "id": 6}]}