{"code": "03-129", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The main objective of the course is not only to teach the students how the body works but also to construct a global view of all 9 organ systems and how these organ systems coordinate with each other when homeostasis is challenged.\n\nAn additional emphasis of this course is the pathophysiological changes that can be associated with each organ malfunction.", "prerequisite_knowledge": "Success in this course does not require a prior background in Biology.", "assessment_structure": "Three in-class exams, two critiques of exciting discoveries related to the course, quizzes and homework, two group projects solving clinical scenarios, final exam. Class participation (attendance) is also graded.", "goals": "The aim of this course is to instill in students the ability to apply what they acquired about basic concepts in human physiology to understand basics of diseases, including cardiac, neurodegenerative, diabetic, pulmonary, renal, neoplastic, endocrine, and infectious diseases, and the rational therapeutic design associated with each physiological disorder.", "relevance": "University students should acquire a fundamental understanding of biology and how biological processes are related to health and disease", "learning_resources": "Course text is: Human Biology, 16th Edition, by Sylvia S. Mader and Michael Windelspecht. ISBN 978-1260233032, McGraw-Hill Education Publishers, 2020. Additional material provided as required", "extra_time_commitment": "Normal course demands, e.g. problem sets, exam preparation, etc., for a total of 6 hours/week outside the classroom."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "The main objective of the course is not only to teach the students how the body works but also to construct a global view of all 9 organ systems and how these organ systems coordinate with each other when homeostasis is challenged.  An additional emphasis of this course is the pathophysiological changes that can be associated with each organ malfunction.", "short_name": "HUMAN HEALTH DISEASE", "co_reqs": [], "instructors": [{"username": "naffara", "first_name": "Nesrine", "last_name": "Affara", "tags": [], "hours_per_week": 0, "id": 1360, "semesters_taught": [{"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Human Health and Disease", "base_name": "Human Health and Disease", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "team project", "id": 17}]}