{"code": "05-310", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2021}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "User Experience (UX) Research, Design Thinking, Human-Computer Interaction, Usability Testing, Contextual Interviewing, Customer Journey Mapping, Prototyping", "prerequisite_knowledge": null, "assessment_structure": "The primary deliverable is a team-based project that involves research and culminates in a paper prototype. Individually, students are also accessed with weekly discussion posts and quizzes.", "goals": "At the end of the course students should have a working knowledge of designthinking processes and humancomputer interaction principles. Participants will be able to conduct research projects intended to solve business problems typically with technology products.", "relevance": "These research and design-thinking techniques can be leveraged by any professional to solve problems and envision new solutions, but are particularly helpful in software and hardware development disciplines.", "learning_resources": "All readings and activities workspaces are provided in online formats through Canvas or CMU Libraries.", "extra_time_commitment": "This is a team-based project course. And while some team work time is allocated every class period, you will still need to find time outside of class to work synchronously with your teammates."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "This course provides students with an overview of core user experience UX and humancomputer interaction HCI research methods. Leveraging designthinking processes, you will learn to plan and implement a mixedmethods approach for collecting information from users including observational methodologies involving fieldwork, interview techniques designed to elicit needs and motivations, and quantitative data from systems and users. You will learn to analyze quantitative and qualitative data in order to derive insights about participants behaviors, motivations, and unmet needs and then synthesize insights and envision new systems that fulfill these needs. Additionally, you will design and develop artifacts including conceptual designs or prototypes, as well as conduct evaluative research methods such as ThinkAloud Protocol or Experience Prototyping in order to assess conceptual or existing systems. The course culminates in a final presentation through which students learn to communicate research findings and insights to multiple stakeholders from executives to development team members.", "short_name": "USER-CENT RESEARCH", "co_reqs": [], "instructors": [{"username": "rmusurac", "first_name": "Raelin", "last_name": "Musuraca", "tags": [], "hours_per_week": 0, "id": 3613, "semesters_taught": [{"semester": 1, "year": 2021}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "User-Centered Research and Evaluation", "base_name": "User-Centered Research and Evaluation", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "research", "id": 14}, {"type": "attribute", "name": "team project", "id": 17}]}