{"code": "05-897", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The Special Topics in HCI is an opportunity for students interested in HCI to gain a deeper understanding of a specific area in this field. Each class is designed to cover an emerging research area within HCI, from designing large-scale peer learning systems to creating video games around audience agency. Please contact the faculty member teaching this course for more information.", "prerequisite_knowledge": "Typically special topics courses do not require prerequisite knowledge. Please contact the faculty member for skills that may be beneficial for this course.", "assessment_structure": "Please contact the faculty member for more information.", "goals": "Please contact the faculty member for more information.", "relevance": "These courses give a glimpse into current research topics in the HCII.", "learning_resources": "Please contact the faculty member for more information.", "extra_time_commitment": "Please contact the faculty member for more information."}, "equiv": [], "student_sets": [{"id": 895, "name": "graduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "Special Topics in HCI is an opportunity for students interested in HCI to gain a deeper understanding of a specific area in this field. Each class is designed to cover an emerging research area within HCI, from designing largescale peer learning systems to designing games around audience agency. All sections will help students 1 build a more comprehensive understanding of an area of study within HCI, 2 work closely with faculty and peers to create miniprojects or team assignments that help students master the course material, 3 explore evidencebased research methods and techniques in HCI.    Sections will vary in topic and often change from semester to semester. Because of this, students can take multiple sections, as they are individual classes. Undergraduate sections are listed as 499 and graduate sections are listed as 899.   For descriptions of specific sections for this academic year, visit the Courses section on the HumanComputer Interaction Institute website httphcii.cmu.eduacademicscourses", "short_name": "SPEC TOPICS IN HCI", "co_reqs": [], "instructors": [{"username": "zizan", "first_name": "Susan", "last_name": "Hagan", "tags": [], "hours_per_week": 0, "id": 175, "semesters_taught": [{"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Special Topics in HCI", "base_name": "Special Topics in HCI", "skills": [], "success": true, "attributes": []}