{"code": "09-101", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2016}, {"semester": 2, "year": 2017}, {"semester": 2, "year": 2019}, {"semester": 2, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Conceptual: chromatography (molecular polarity and interparticle forces), chemical synthesis (empirical formulas, stoichiometry, and percent yield), spectrophotometric analysis (dilution and Beer-Lambert Law), kinetics (integrated rate laws and Arrhenius equation), equilibrium (Law of Mass Action, LeChâtelier's Principle), titrations (acid-base equilibria, redox reactions), thermochemistry (enthalpy, thermochemical equations), and coordination chemistry (Jahn-Teller Effect);\n\nLaboratory Skills/Techniques: safe lab practices, waste disposal, and chemical hygiene; ata/observation recording in lab notebook; graphing, analzying and interpreting experimental data; use of top-loading balance; chromatography (paper or silica plate); filtration (gravity and vacuum), recrystallization of solids, titrations (redox and acid-base; use of pH meter); making of and dilution of solutions (including quantitative transfer of solute); use of volumetric pipet; use of spectrophotometer; developing experimental procedures", "prerequisite_knowledge": "algebra, trigonometry, categories of energy, law of conservation of energy, comparing the different classifications of matter, basic particles in atoms, balancing and interpreting equations representing simple chemical reactions; use of software (e.g. Excel) to construct graphs", "assessment_structure": "1 Lab Safety Quiz, 6 Prelab Exercises, 6 Lab Notebook Sets, 6 Data and Results Sections, 3 Quizzes [Successful completion of all 6 experiments with instructor-accepted reasonable results is required additionally]", "goals": "At the end of the course, you should be able to 1. plan and set up experiments, most of which are directed in experiment handouts, 2. record data and observations properly in a lab notebook, 3. perform basic experimental techniques in chemistry, such as paper chromatography, filtrations, spectrophotometric measurements, pipetting, and titrations, 4. using appropriate, laboratory practices, work safely with and dispose properly of hazardous substances, 5. analyze and interpret experimental data, both with and without graphical techniques and computer software, 6. search the literature for required chemical information handbooks and the internet, 7. solve experimentallyrelated problems by identifying and using some major concepts we encounter in chromatography molecular polarity and interparticle forces, chemical synthesis empirical formulas, stoichiometry, and percent yield, spectrophotometric analysis dilution and BeerLambert Law, kinetics integrated rate laws and Arrhenius equation, equilibrium Law of Mass Action, LeChteliers Principle, titrations acidbase equilibria, redox reactions, thermochemistry enthalpy, thermochemical equations, and coordination chemistry JahnTeller Effect", "relevance": "This course provides basic laboratory skills and techniques representing the major ones that laboratory and research chemists use in their everyday work. It also applies these techniques to the major fields of chemistry and other fields--such as biology, civil and environmental engineering, and material science--that utilize such chemical techniques.", "learning_resources": "Course-provided laboratory handouts; faculty and teaching assistant office hours (including email and Canvas Chat); web resources linked on course Canvas site; Student Academic Success Center (tutoring)", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}, {"sem": 3, "type": "INFO", "name": "specific_sem"}], "units": 3.0, "website": null, "long_desc": "This is a seven week chemistry laboratory course that is designed to introduce students to some basic laboratory skills, techniques, and equipment commonly used in experimental chemical investigations. The experiments will apply concepts in organic synthesis, quantitative analysis using visible spectrophotometry, kinetics, acidbase chemistry, thermochemistry, transition metal chemistry, and chromatography.  1 hr. lec., 3 hrs. lab.", "short_name": "INTRO EXPERMNTL CHEM", "co_reqs": [], "instructors": [{"username": "rbachu", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 199, "semesters_taught": [{"semester": 2, "year": 2016}, {"semester": 2, "year": 2017}, {"semester": 2, "year": 2019}, {"semester": 2, "year": 2022}], "photo_url": null}, {"username": "tbmurphy", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 2825, "semesters_taught": [{"semester": 2, "year": 2016}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Introduction to Experimental Chemistry", "base_name": "Introduction to Experimental Chemistry", "skills": [{"id": 31, "name": "Biochemistry", "slug": "biochemistry"}, {"id": 158, "name": "Chemistry", "slug": "chemistry"}, {"id": 239, "name": "Organic Chemistry", "slug": "organic-chemistry"}, {"id": 1843, "name": "Experimental", "slug": "experimental"}], "success": true, "attributes": []}