{"code": "09-122", "name": "Molecular Tools for Biological and Chemical Studies", "base_name": "Molecular Tools for Biological and Chemical Studies", "units": 6.0, "min_units": 6.0, "max_units": 6.0, "short_name": "MLCR TLS BLG CMY STD", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 2, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "Fluorescent dyes are applied in numerous fields to aid in tasks such as mapping the course of water underground, examining the eye, and detecting biological events.   This course is aimed at offering a handson laboratory experience in the interface of chemistry and biology, also known as bioorganic chemistry. In this lab students will learn about fluorescence and fluorescent compounds. They will prepare a dye and will measure its fluorescent properties in presence of different media. This behavior will be compared and contrasted with that of another dye that will be provided.  A former student in the course says   Molecular Tools for Biological and Chemical Studies was one of the highlights of my time at CMU  Taking this course during my freshman year allowed me to gain skill and confidence in the lab, and the concepts I learned helped me to excel in many other courses I took at CMU including Organic Chemistry I  II, Laboratory I Introduction to Chemical Analysis, Laboratory II Organic Synthesis and Analysis, Biochemistry, and Modern Analytical Instrumentation.  Since graduating from CMU, I have been working on a Ph.D. in chemical biology.  I still use many of the skills that I learned in Molecular Tools on a daily basis. Maddie Balzarini", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 2}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "catalog_levels": [], "skills": [{"name": "Molecular Biology", "slug": "molecular-biology", "id": 153}], "attributes": [], "custom_fields": {"goals": "This course is designed to demonstrate noncovalent binding of small organic molecules dyes to biopolymers DNA and proteins by measuring changes in their visible light absorbance and their fluorescence. The course goals have the overarching purpose of linking Organic Chemistry and BiologicalBiochemical concepts and at the same time teaching the students about safety in the lab, keeping detailed notes and writing a scientific report. To aid this purpose, a fluorescent dye will be prepared, purified, and characterized. Then, the molecule will be tested for fluorescence in various experiments. We will discuss the influence of simple aspects of the dye such as molecular size, geometry, and rigidity in the design of fluorescent molecules. This experience will help students understand the application of fluorescent molecules in biology, chemistry, and medicine among other relevant scientific fields.", "key_topics": "1- Safety in the Lab.\n2- Fluorescence and Fluorescent Molecules: how do their structure relate with the phenomenon?\n3- Microscale Synthesis of a Cyanine Dye: how to set a reaction; the importance of solubility; how molecules are held together.\n4- Purification Techniques and Analysis: recrystallization and chromatography; spectroscopic analysis.\n5- Conditions that make the fluorescence vary.\n6- Why some molecules are non-fluorescent but fluoresce when interacting with other molecules?\n7- Detection of fluorescence of dye with DNA.", "prerequisite_knowledge": "This course does not have prerequisite although basic knowledge of chemistry from high school is desired. The concepts of mol, molarity and stoichiometry are helpful to calculate amounts of materials to be reacted, reaction yields and concentrations.", "assessment_structure": "Student performance will be assessed by a combination of:\n1) Quiz: administered every second week (5 pts. x 6) (30 points)\n2) Lab notes (30 points) observations\n3) Comments and conclusions about the experimet of the day (10 points)\n4) Attendance, work and participation (10 points)\n5) Presentation (10 points), final report (10 points)\n\nThe presentation will take place at the end of the semester on a topic of the student's choice related to those learned in class. Duration: 10 min. Student's participation and answers to the peer's questions will be evaluated.\nA letter grade will be assigned as follows: A: 89-100%; B: 79-88%; C: 69-78.%; D: 59-68%; R: 58% or less.\nAbsences: If for any reason you cannot attend a lecture or lab session, you should contact me immediately. Repeated lecture absences will lead to a letter grade drop in your final grade. Absence from the lab may delay or prevent you from finishing your work; some of the instrumentation may be available only in the scheduled days. This would result in points' deduction and the lack of completion of the project may result in failing the course.", "relevance": "The increased fluorescence of certain molecules in presence of a specific biological target provides an excellent and sensitive tool in many applications. Instruments that detect fluorescence are very sensitive and can detect very low levels of light. For example, fluorescent dyes can be used to detect survival of cells, and in diagnostics it is useful to locate tumors. This course is aimed at offering a hands-on laboratory experience in the interface of chemistry and biology. This course exposes students to analytical techniques that are widely used in chemistry and biology and teaches them on how to record experimental observations and write a report. Some students that took this course went on working in research groups using the fluorescence phenomenon as a tool and others applied this knowledge to different projects and courses.", "learning_resources": "No textbook is required. Material and notes will be provided ahead of time. Materials from the following books will be posted in Canvas as needed:\n\nAnne B. Padias. Making the Connections: A How-To Guide for Organic Chemistry Lab Techniques (2007), Hayden McNeil. VA. ISBN: 9978-1-4292-3865-6.\n\nKathy Barker. At the Bench, a Laboratory Navigator (2005) Cold Spring Harbor Laboratory Press, NY. ISBN 0-87969-703-3.\n\nStudents will be required to watch some short videos from the internet before lecture. The subject matter of the videos will be discussed or used to illustrate concepts dealing with the lab activity or application of materials or experiments like the ones performed in the lab.\nOffice hours are also available as well as an open-door policy guarantees the access of the student to the instructor to ask for help. Email questions are also answered.\nThe Office of Disability Resources also offers exam proctoring as well as additional help to students with different disabilities, including time management.", "extra_time_commitment": "Outside classroom commitments are limited to preparing a prelab summary intended to be used as guidance in the lab to perform the experiment of the day; watching one or two videos about 15 min long each in average or shorter; reviewing concepts for quizzes; organizing experiment results and completing lab notes. These activities may not take more than 3 hours per week. The lab session takes place only once a week."}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}