{"code": "09-107", "offered_in_campuses": [1], "offerings": [{"semesters": [], "sub_semesters": [], "campus_id": 2}], "max_units": 10.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Topics covered include topics covered in both the 09-105 and 09-106 courses\no\tStructure and Bonding\no\tQuantum Mechanics and Atomic Theory\no\tIntermolecular Forces\no\tThermodynamics\n¿\tEnergy, Enthalpy and Thermochemistry\n¿\tEntropy and Free Energy\n¿\tThermodynamics of solutions\no\tKinetics\no\tChemical Equilibrium\no\tAcid/Base Chemistry\no\tSolubility Equilibrium\no\tRedox Chemistry", "prerequisite_knowledge": "This course assumes that students have a keen interest in studying in the chemistry and have a strong background in chemistry. The course is designed to be more rigorous than the 09-105 and 09-106 course and as such moves at an accelerated pace. Those who are motivated to take the class but have weaker backgrounds can use OLI resources provided to work on their background knowledge.", "assessment_structure": "Students are assessed over four categories:\no\tOnline Sapling assignments. These are quick multiple choice or short answer questions that focuses on the core concepts learnt in lectures. Students will be able to review the concepts and are provided with guided assistance in answering the questions\no\tClass participation: these take three formats 1) Mentimeter polls taken during class that assess understanding of the material as they are being taught. Based on the response we are able to clarify misconceptions. 2) Recitation lab activities: Students are taken into the lab where they work in groups to either design an experiment to answer a question posed or they perform experiments to test the theoretical concepts learnt in lecture. 3) Recitation quizzes. Students are given short answer quizzes ~ once a week to gauge their understanding of the material.,\no\tHomework. Students are proved with a homework assignment and the end of each key topic. These questions have a higher level of difficulty than those presented on Sapling and often have either real-life applications\no\tExams: Three one hour exams and a comprehensive final is given to assess overall knowledge.", "goals": "To provide students with a strong foundation in the principles of chemistry needed for upper level laboratory and lecture courses. To further develop problem solving critical thinking skills especially from a chemist perspective. As a result, students should be solve problems that they encounter in class and also those that are not explicitly taught. To apply knowledge of chemical concepts both on a qualitative and quantitative level to problems that are encounteredTo be aware of and understand the importance of current research topics in chemistry To recognize that the core concepts learnt provide the foundational knowledge necessary to solve problems found in current research.", "relevance": "This course is designed to provide foundational knowledge of both the Modern Chemistry I and II courses in the context of its relevant applications to current chemical research. Traditional chemistry topics are covered but are discussed through the purview of research work done in one of two fields: Biotechnology or Energy and Sustainability. Lectures integrate both the core concepts as well as its application to current research work. Guest lectures from CMU faculty in these research areas are provided so that students are able to directly see the current application. As such, the course really allows students to fully understand the potential impact of what they can do with the knowledge that they are gaining.", "learning_resources": "Students utilize Canvas for all course material. The syllabus, lecture notes, recitation activities and exam material are all provided on Canvas. Canvas is updated daily/weekly. Peer Tutors are also given access to Canvas so that they are better able to assist students with the material being covered.\n-\tThe textbook \"Chemical Principles\" 8th edition by Zumdahl is referenced throughout the course. Purchase of the textbook is optional. Copies of the newest edition and older editions are on reserve in the Sorrells library in Wean Hall.\n-\tStudents are provided with an outline of lecture notes at the start of each lecture. Once lecture is completed, post-filled lecture notes are uploaded to Canvas\n-\tAn Online Learning Initiative (OLI) has been developed specifically for the course to offer on line tutorials of the course material. The OLI also walks students through how to do necessary calculations and a quiz is provided at the end with detail solutions so that students can self-assess.\n-\tStudents are encouraged to use Piazza (online discussion forum) to ask questions. Teaching assistants, course instructors, graders and peer tutors are all given access to Piazza and questions are often\n-\tEach instructor, teaching assistant provides office hours for ~1 hour outside regularly scheduled classes.", "extra_time_commitment": "Students who do not have a strong chemistry background and are interested in taking the course are strongly encouraged to review the OLI activities posted to the course."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 10.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}], "units": 10.0, "website": null, "long_desc": "This is an honors introductory course designed to provide students with a rigorous coverage of general chemistry in the context of grand challenges in the field. Traditional topics, such as equilibrium, kinetics, acidbase chemistry, and quantum chemistry, will be discussed through current research on nucleic acidbased therapeutics, atmospheric chemistry of pollutants, and catalysts for the production of solar fuels. The approach will integrate traditional lectures and readings from the textbook with discussions of journal articles, online content on research methods, and guest lectures from CMU faculty in these areas. This course assumes strong preparation in chemistry AP Chemistry score of 3 or greater IB Chemistry score of 5 or greater SAT II Chemistry exam with a score of 700 or greater and will be offered at an accelerated pace. The goal is to teach core principles of chemistry while exposing students to the diversity of modern chemical research and how it is addressing grand challenges facing society. 3 hrs. lec., 2 hrs. rec.", "short_name": "HONORS CHEMISTRY", "co_reqs": [], "instructors": [], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Honors Chemistry: Fundamentals, Concepts and Applications", "base_name": "Honors Chemistry: Fundamentals, Concepts and Applications", "skills": [{"id": 158, "name": "Chemistry", "slug": "chemistry"}], "success": true, "attributes": []}