{"code": "09-111", "name": "Nanolegos: Chemical Building Blocks", "base_name": "Nanolegos: Chemical Building Blocks", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "CHEM BLDG BLOCKS", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 2, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "How does chemistry provide the foundation and building blocks in science, engineering, and technology   How does activity on the particle and molecular level that we cannot see cause things to happen and function on a level we CAN observe  What basic chemical concepts are needed as tools to understand current significant research and technology, as well as to understand phenomena and problems in the world around us  This course will emphasize answering these questions by presenting problem or contextfirst, then applicable chemical concepts on an asneeded basis.  It is structured around phenomena relevant to modern society, research, and technology rather than the conceptual tools i.e. systems or application, rather than contentdriven.  Many of the conceptual tools e.g. structure, interaction between energy and matter, interparticle forces, reaction stoichiometry, thermodynamics and kinetics  are used throughout the course, to help reinforce these ideas and promote an integrated understanding.   The major contexts and phenomena that we will explore in applying and connecting chemical concepts are 1 sustainable energy, 2 charge motion in materials, 3 natural versus engineered catalysts, 4 polymeric materials, and 5 reversible reactions in environmental and biological chemistry", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 1}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "catalog_levels": [], "skills": [], "attributes": [], "custom_fields": {"goals": "Besides for learning the above listed principles of chemistry, this course also has broader goals the achievement of which will hopefully benefit you beyond your study of chemistry. At the end of the course, you should be able to Derive new concepts and relationships from and connect them to previously encountered concepts Recognize the importance and significance of chemical concepts in explaining and understanding natural phenomena, material design, and sustainable practices Recognize the importance of, and identify applicable course chemical concepts to, at least one current research topic in chemistry happening either at Carnegie Mellon University or elsewhere Develop problemsolving and critical thinking skills, which include solving problems from a chemists perspective Develop a utility with the language of mathematics and computational thinking that applies to chemistryDefine, describe, and use models of chemical structure, bonding, and interaction to explain physical properties, relative energy, reactivity, stability, reaction rates, and other natural phenomena in various contexts e.g. biological, engineering, materials, environmentUse tabulation, graphical interpretation, visualization, and statistical analysis to identify and explain significant features and patterns in data of physical and chemical properties, and of chemical reactionsCorrectly utilize mathematical relationships of chemistry and to know under which conditions and situations they applyConstruct logically coherent explanations of phenomena that incorporate chemical concepts, or models representing them, and are consistent with the available evidenceDefend explanations of phenomena and formulate evidence based on a solid foundation of datainformationUse online resources andor software to illustrate and interpret concepts of chemical structure, bonding, interaction, reactivity, relative energy", "key_topics": "The major contexts and phenomena that we will explore in applying and connecting chemical concepts are: (1) sustainable energy, (2) charge motion in materials, (3) natural versus engineered catalysts, (4) polymeric materials, and (5) reversible reactions in environmental and biological chemistry\n\nThe chemical concepts used to promote an integrated understanding of the above applications and systems are:\n\natomic structure, interaction of energy and matter, chemical bonding, interparticle forces, molecular structures of organic and inorganic compounds, multiphase reaction stoichiometry, thermodynamics, kinetics, electrochemistry, equilibrium, and acid-base chemistry", "prerequisite_knowledge": "algebra, trigonometry, categories of energy, law of conservation of energy, comparing the different classifications of matter, basic particles in atoms, balancing and interpreting equations representing simple chemical reactions (high school chemistry)", "assessment_structure": "3 Exams (3 highest of 4)\t60 %\nProblem Sets (5 highest of 7)\t20 %\nOLI and Chem101® App Quizzes\n15 %\nChem101® Lecture Exercises\n5 %", "relevance": "The course is intended to give you a powerful set of conceptual tools you can use to reason about chemical systems, and to provide opportunities to practice application of these conceptual tools to phenomena of relevance to modern society, research, materials, and technology. It focuses on chemistry's role, importance, and contribution to the design and understanding of various phenomena.", "learning_resources": "OLI, Chem101® app (also web version), web resources linked on Course Canvas site, recitation activities, faculty and teaching/course assistant office hours, Student Academic Success Center (tutoring, group study initiatives)", "extra_time_commitment": null}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}