{"code": "09-114", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2020}, {"semester": 2, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": true, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Food and food quality; water; beverages; carbohydrates; lipids; chocolate; amino acids, peptides, and proteins; milk and milk products.", "prerequisite_knowledge": "High Schoool Chemistry", "assessment_structure": "The student's grade will be determined = by the following: a) Four 4-10 min quizzes (10 %) b) Five write up assignm= ents (25 %) c) Attendance (5 %) and participation (30%) In-class activities= and outside-of-the-classroom activities will be completed and submitted. = d) A final team project that will involve the development of a comprehensiv= e case study and its presentation (30 %). Presentation format will be discu= ssed.", "goals": "We expect that at the end of this course studen ts gain an understanding of the chemical and physical properties of macro and micronutrients in food and their importance. This knowledge will enable students to better understand the nutrition labels on food products, asses s the nutritional value of supermarket produce, and will make them aware of the ingredients added to food to increase its appeal, flavor, and shelf life. Some of the ingredients added to food are used in quantities that can b e detrimental to health if the consumer is not aware of this an example be ing salt. Students will develop criteria to identify these and other facts about food.", "relevance": "This course will allow students to refresh as w= ell as acquire new knowledge in the Science field. Many physical and chemical events are ordinarily observed when preparing food. Identifying them and= giving them a scientific meaning will enlighten the students and make them= more curious about their surroundings. Our goal is to educate students on = the processing, manipulation and value of food. This course will offer an opportunity to address the basic concepts of chemistry, physics, and biology= as they apply to foods. We expect to demystify misconceptions about certain= foods and ingredients and reveal food hidden health hazards (such as high = sugar and salt). We expect that students gain an understanding of food rela= ted facts at the molecular level (for example: what is High Fructose Corn Syrup, a widely spread sweetener; how is obtained; how is different from suc= rose, and how is perceived by the customer). Our aim is that students actively participate in the classes as well as they contribute questions and their own perception and knowledge.", "learning_resources": "The recommended textbook is: Essentials of Food= Science, 4th Edition, by Vickie Vaclavik and Elizabeth W. Christian, 2014,= Springer, ISBN: 978-1-4614-9137-8. Notes, additional material, and on-line= sources will be posted in Canvas. Material procured from the student= 's own research will also be used; they must be properly referenced= in the student's work.", "extra_time_commitment": "This course is a total 45 hs/semester with 15 c= ontact hours included. A total of about 30 hours/semester will be dedicated= to outside of the classroom activities (about 4 hs a week)."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}, {"sem": 3, "type": "INFO", "name": "specific_sem"}], "units": 3.0, "website": null, "long_desc": "Food is essential for life and the maintenance of health. As consumers we know little about its constitution and processing. This course will shed light upon the main nutrients found in food and their properties. We will discuss the importance of different processing techniques and about the ingredients added to food that extend its shelf life, or that improve its mouthfeel, and appearance. Overall, this course aims to make students aware of the intrinsic value of food, and how its manipulation and eventual reconstitution leads to an acceptable final product found in the supermarket.", "short_name": "BASICS OF FOOD SCI", "co_reqs": [], "instructors": [{"username": "gsilva", "first_name": "Gloria", "last_name": "Silva", "tags": [], "hours_per_week": 0, "id": 664, "semesters_taught": [{"semester": 2, "year": 2020}, {"semester": 2, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": true, "topic": null, "name": "Basics of Food Science", "base_name": "Basics of Food Science", "skills": [], "success": true, "attributes": []}