{"code": "09-106", "offered_in_campuses": [2, 1], "offerings": [{"semesters": [{"semester": 2, "year": 2019}, {"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}, {"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 10.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Topics covered this semester are; Thermodynamics, Kinetics, Chemical Equilibrium ,Acid/Base Chemistry, Solubility Equilibrium, Redox Chemistry", "prerequisite_knowledge": "Students taking this course are expected to have taken 09-105 Modern Chemistry I or 09-107, Honors Chemistry", "assessment_structure": "Students are assessed over four categories:\no\tOnline Sapling assignments. These are quick multiple choice or short answer questions that focuses on the core concepts learnt in lectures. Students will be able to review the concepts and are provided with guided assistance in answering the questions\no\tClass participation: these take three formats 1) Mentimeter polls taken during class that assess understanding of the material as they are being taught. Based on the response we are able to clarify misconceptions. 2) Recitation lab activities: Students are taken into the lab where they work in groups to either design an experiment to answer a question posed or they perform experiments to test the theoretical concepts learnt in lecture. 3) Recitation quizzes. Students are given short answer quizzes ~ once a week to gauge their understanding of the material.,\no\tHomework. Students are proved with a homework assignment and the end of each key topic. These questions have a higher level of difficulty than those presented on Sapling and often have either real-life applications\no\tExams: Three one hour exams and a comprehensive final is given to assess overall knowledge.", "goals": "To provide students with a strong foundation in the principles of chemistry needed for upper level laboratory and lecture courses. To further develop problem solving critical thinking skills especially from a chemist perspective. As a result, students should be solve problems that they encounter in class and also those that are not explicitly taught. To apply knowledge of chemical concepts both on a qualitative and quantitative level to problems that are encounteredTo begin to recognize and explain the importance of chemistry and its real life applications", "relevance": "If we needed to store energy to power CMU for a day we would need to understand the basic concepts of what is heat, work and energy. This is the study of Thermodynamics. If we were interested in depletion of ozone in the atmosphere we would need to understand the mechanism of how ozone is depleted. This is covered in the study of Kinetics. An understanding of how proteins binds to drugs or even how proteins function requires us to have knowledge of chemical and solubility equilibria and pH. This course provides the core and foundational knowledge required to further study these concepts.", "learning_resources": "-\tStudents utilize Canvas for all course material. The syllabus, lecture notes, recitation activities and exam material are all provided on Canvas. Canvas is updated daily/weekly. Peer Tutors are also given access to Canvas so that they are better able to assist students with the material being covered.\n-\tThe textbook \"Chemical Principles\" 8th edition by Zumdahl is referenced throughout the course. Purchase of the textbook is optional. Copies of the newest edition and older editions are on reserve in the Sorrells library in Wean Hall.\n-\tStudents are provided with an outline of lecture notes at the start of each lecture. Once lecture is completed, post-filled lecture notes are uploaded to Canvas\n-\tAn Online Learning Initiative (OLI) has been developed specifically for the course to offer on line tutorials of the course material. The OLI also walks students through how to do necessary calculations and a quiz is provided at the end with detail solutions so that students can self-assess.\n-\tStudents are encouraged to use Piazza (online discussion forum) to ask questions. Teaching assistants, course instructors, graders and peer tutors are all given access to Piazza and questions are often\n-\tEach instructor, teaching assistant provides office hours for ~1 hour outside regularly scheduled classes.", "extra_time_commitment": "There should be no extra time commitments for the course beyond lecture time and two required recitation sessions per week."}, "equiv": [{"units": 0.0, "code": "09-206", "id": 7353, "name": null}], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 10.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 10.0, "website": null, "long_desc": "This course provides an overview of  thermodynamics, kinetics and chemical equilibrium. Topics include the flow of energy in chemical systems the spontaneity of chemical processes, i.e. entropy and free energy the mechanisms and rates of chemical reactions and the use of chemical equilibrium to reason about acidbase chemistry, solubility and electrochemistry. Applications include the energy economy, biological systems and environmental chemistry. 3 hrs. lec., 2 hrs. rec.", "short_name": "MODERN CHEMISTRY II", "co_reqs": [], "instructors": [{"username": "rbachu", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 199, "semesters_taught": [{"semester": 2, "year": 2016}, {"semester": 2, "year": 2017}, {"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}, {"semester": 2, "year": 2022}], "photo_url": null}, {"username": "khhunter", "first_name": "Kevin", "last_name": "Hunter", "tags": [], "hours_per_week": 0, "id": 3455, "semesters_taught": [{"semester": 2, "year": 2018}, {"semester": 2, "year": 2019}], "photo_url": null}, {"username": "mmaksoud", "first_name": "Mahmoud", "last_name": "Maksoud", "tags": [], "hours_per_week": 0, "id": 5450, "semesters_taught": [{"semester": 2, "year": 2023}], "photo_url": null}, {"username": "tbmurphy", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 2825, "semesters_taught": [{"semester": 2, "year": 2016}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "(09-107 at least D) or (09-105 at least D)", "raw_pre_req": "", "req_obj": {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 10.0, "code": "09-107", "id": 6596, "name": "Honors Chemistry: Fundamentals, Concepts and Applications"}}, "type_string": "", "type": "course", "id": 6596}], "id": 6597, "screen_name": "09-107"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 16353}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 16354}], "id": 12799, "screen_name": "nll91kdbwwq52v2"}, {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 10.0, "code": "09-105", "id": 6595, "name": "Introduction to Modern Chemistry I"}}, "type_string": "", "type": "course", "id": 6595}], "id": 6596, "screen_name": "09-105"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 16355}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 16356}], "id": 12800, "screen_name": "2kpbd5ipp9xs0np"}], "constraints": [{"data": {"x": 1, "is_and": false}, "type": "anyxof", "id": 16352}], "id": 12798, "screen_name": "9fx3c1o33l15cpk"}}, "is_req_repeatable": false, "topic": null, "name": "Modern Chemistry II", "base_name": "Modern Chemistry II", "skills": [{"id": 158, "name": "Chemistry", "slug": "chemistry"}, {"id": 1841, "name": "Economy", "slug": "economy"}], "success": true, "attributes": []}