{"code": "09-105", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2019}, {"semester": 3, "year": 2020}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 10.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "atomic structure, quantum mechanical model of the atom (interaction of matter and energy), electron configurations and the periodic table, relative atomic orbital energies, periodic trends in properties of elements, bonding theories and their explanation of substance properties, Lewis structures and resonance, determining molecular shapes, determining molecular polarity, interparticle (intermolecular) forces and their influence on physical properties, quantum mechanical descriptions of bonding in molecules - valence bond and molecular orbital theories, writing and balancing chemical equations (including combustion, precipitation, acid-base, and redox reactions), reaction stoichiometry (hetero- and homogeneous phase reactions - including gas phase, precipitation, acid-base, and redox reactions), solution properties (concentration, dilution, colligative), writing and balancing acid-base reactions, writing and balancing redox reactions, titrations (acid-base and redox), coordination complexes and their properties (reactivity, magnetic, and optical)", "prerequisite_knowledge": "algebra, trigonometry, categories of energy, law of conservation of energy, comparing the different classifications of matter, basic particles in atoms, balancing and interpreting equations representing simple chemical reactions", "assessment_structure": "Lecture Exercises, Recitation Worksheets, OLI and Chem101® Assignments, Problem Sets (5 highest of 7), Recitation Quizzes (5 highest of 6 or 7), 3 Exams, 1 optional cumulative Final Exam", "goals": "At the end of the course, you should be able to1. further develop problemsolving and critical thinking skills, which include solving problems from a\nchemists perspective2. define, describe, and use models of chemical structure, bonding, and interaction to explain physical\nproperties, reactivity, and other natural phenomena in various contexts e.g. biological and\nengineering3. use tabulation, graphical interpretation, visualization, and statistical analysis to identify and explain\nsignificant features and patterns in data of physical and chemical properties, and of chemical reactions4. further develop a utility with the language of mathematics and computational thinking that applies to\nchemistry5. correctly utilize mathematical relationships of chemistry and to know under which conditions and\nsituations they apply6. construct logically coherent explanations of phenomena that incorporate chemical concepts, or models\nrepresenting them, and are consistent with the available evidence7. defend explanations of phenomena and formulate evidence based on a solid foundation of\ndatainformation8. derive new concepts and relationships from previously encountered concepts 9. use online resources andor software to illustrate and interpret concepts of chemical structure, bonding,\ninteraction, reactivity, reaction types, and reaction stoichiometry10. recognize the importance of, and identify applicable course chemical concepts to, at least one current\nresearch topic in chemistry happening either at Carnegie Mellon University or elsewhere", "relevance": "The relevance and importance of the above topics are presented via lectures, in class exercises, and assignments in the context of biological systems, environmental problems and solutions, alternative energy sources, materials and consumer product design. The course also illustrates how some of the topic are used to solve current research problems in the sciences.", "learning_resources": "textbook Zumdahl and DeCoste, Chemical Principles, 8ed. (various formats available), Chem101® app (also web version), OLI, web resources linked on Course Canvas site, recitation activities, faculty and teaching assistant office hours, Student Academic Success Center (optional - Supplemental Instruction or EXCEL, tutoring)", "extra_time_commitment": "Recitations are required elements of the class- two hours per week"}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 10.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 10.0, "website": null, "long_desc": "This course first investigates the establishment of some fundamental principles of chemistry and then progresses through the presentation of chemically interesting applications and sophisticated problems.  It explores an understanding of matter and the energy changes associated with it, beginning with the atom.  It then overviews how atoms interact and react to form the more complicated structures of molecules and ionic compounds.  How the structure of elements and compounds affects their properties, function, and reactivity will then be explored.  Finally, the quantification of the changes during the reactivity of substances through bond breaking and forming will be investigated in single and multiple phase reactions, such as acidbase and redox reactions.  Topics will be presented to promote mastery of depth over breadth of topics and conceptual understanding before using applicable equations.  The course covers the major principles of atomic structure, chemical bonding, , molecular structures of organic and inorganic compounds including some transition metal complexes, interaction of substances, multiphase reaction stoichiometry, acidbase reactions, and redox reactions.  Relevant examples will be drawn from such areas as environmental, materials, and biological chemistry.", "short_name": "INTRO MOD CHEMSTRY I", "co_reqs": [], "instructors": [{"username": "rbachu", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 199, "semesters_taught": [{"semester": 1, "year": 2016}, {"semester": 1, "year": 2017}, {"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 3, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}], "photo_url": null}, {"username": "sfaulkne", "first_name": "Simon", "last_name": "Faulkner", "tags": [], "hours_per_week": 0, "id": 4266, "semesters_taught": [{"semester": 3, "year": 2020}], "photo_url": null}, {"username": "mmaksoud", "first_name": "Mahmoud", "last_name": "Maksoud", "tags": [], "hours_per_week": 0, "id": 5450, "semesters_taught": [{"semester": 1, "year": 2022}], "photo_url": null}, {"username": "tbmurphy", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 2825, "semesters_taught": [{"semester": 1, "year": 2015}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Introduction to Modern Chemistry I", "base_name": "Introduction to Modern Chemistry I", "skills": [{"id": 239, "name": "Organic Chemistry", "slug": "organic-chemistry"}, {"id": 241, "name": "Inorganic Chemistry", "slug": "inorganic-chemistry"}], "success": true, "attributes": []}