{"code": "09-212", "name": "Special Topics: Nanotechnology in Context", "base_name": "Special Topics: Nanotechnology in Context", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "SPECIAL TOPICS", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1, 2], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [{"semester": 1, "year": 2024}], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 2, "year": 2021}, {"semester": 1, "year": 2022}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "In the everevolving landscape of scientific advancement, nanotechnology stands at the forefront of groundbreaking discoveries that impact various sectors, from electronics and biomedicine to environmental sustainability and the economy. Nanotechnology in Context is an interdisciplinary course designed to explore the multifaceted world of nanotechnology and its dynamic role in our lives. By examining the synthesis and application of nanomaterials, students will gain a comprehensive understanding of science, its implications, and the broader contexts in which it operates. Through a combination of lectures, discussions, and case studies, students will gain a comprehensive perspective on nanotechnology and its applications.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 1}, {"name": "specific_sem", "type": "INFO", "sem": 2}, {"name": "specific_sem", "type": "INFO", "sem": 3}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "catalog_levels": [], "skills": [], "attributes": [{"name": "collaboration & teamwork", "id": 21, "type": "attribute"}], "custom_fields": {"goals": "Understand the fundamental principles of nanoparticles, their synthesis, and characterization techniques. Analyze the integration of nanotechnology in the field of electronics and its impact on the semiconductor industry. Explore the innovative applications of nanotechnology in biomedicines, diagnostics, and drug delivery. Examine the contributions of nanotechnology to environmental sustainability and the challenges it presents. Assess the economic implications of nanotechnology and its role in shaping the global economy.", "key_topics": "The major contexts, phenomena, and applications that we will explore in applying and connecting Nanotechnology and chemical concepts are: (1) Nanoparticles: Nature, Synthesis, and Characterization, (2) Nanotechnology in Electronics, (3) Nanotechnology in Biomedicines, (4) Nanotechnology in the Environment, and (5) Nanotechnology in the Economy.", "prerequisite_knowledge": "The general high school science topics such as: Understanding the nature and different classifications of mater; Knowledge of basic particles in atoms; familiarity with forms of energy, light, and optics; awareness of electromagnetic spectra; proficiency in algebra; ability to compare, balance, and interpret equations representing simple chemical reactions; and knowledge of graph drawing and analysis.", "assessment_structure": "¿ Exams (2 highest of 3): 50%\n¿ Homework (Problem Set/Case Study) (3 highest of 4): 15%\n¿ In-class computer-based Quizzes: 10 %\n¿ Group-based learning (Minireview-style report and presentation): 20%\n¿ In-class activity and attendance: 5%", "relevance": "Nanotechnology is at the lead of scientific innovation, impactng electronics, medicine, the environment, and the global economy. In an era where nanoscale discoveries drive technological advancements, 'Nanotechnology in Context' provides essential knowledge and a powerful set of conceptual tools for students as future innovators and decision-makers. This interdisciplinary course equips students with a comprehensive understanding of nano-size concepts and related phenomena as well as the nanotechnology's applications, addressing critical current needs and economic opportunities. It prepares students to navigate a world increasingly shaped by nanotechnology, fostering innovation and informed engagement in a rapidly evolving landscape.", "learning_resources": "Textbook; Research articles; Lecture notes; Online simulation platforms; OLI; Faculty and teaching assistant office hours; web resources linked on Course Canvas site; Student Academic Success Center", "extra_time_commitment": "NA"}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}