{"code": "09-217", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 3, "year": 2019}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "1-Bonding and Molecular Structure; 2-Functional Groups, Intermolecular Forces and Infrared Spectroscopy; 3-Nuclear Magnetic Resonance Spectroscopy and Structural Elucidation; 4-Acid Base Organic Reactions and Their Mechanism; 5-Nomenclature and Conformation of Alkanes and Cycloalkanes; 6-Stereochemistry; 7-Nucleophilic Substitutions on Alkyl Halides and other Substrates; Functional Groups Interconversion; 8-Elimination Reactions of Alkyl Halides; Synthesis of Alkenes and Alkynes; 9-Electrophilic Addition Reactions on Alkenes and Alkynes; Regioselective Reactions; 10-Alcohols and Ethers Synthesis and Reactivity; Protecting Groups; 11-Alcohols from Carbonyl Containing Compounds; Organometallic Reagents; 12-Radical Reactions; Functionalization of Alkanes.", "prerequisite_knowledge": "Introduction to Modern Chemistry I (09105) or Honors Chemistry: Fundamentals, Concepts and Applications (09107).", "assessment_structure": "One-hour exams (3) + Final Exam\n\t80%\n\nHomework (5 highest score)\n\t \t20%\n\nThe one-hour exams and the final exam are graded on 100-point scales. To calculate the grade we add all three one-hour exams (300 points) and three times the Final score (300 points); the two lowest scores are dropped (400 points left). The highest five scores out of the seven homework assignments (100 points, 20 points each) are added. Total points: 500 (=100%). The final grade (A, B, etc.) is straightforward: 90+% =A; 80.0-89.9 = B; 70.0-79.9 = C; 60.0-69.9 = D; below the D score the student receives R and needs to retake the course.\nGiven that students are able to drop the equivalent to two exams, there are no make-up exams or no curving. There are no exceptions to this policy.", "goals": "This course offers fundamental knowledge about organic molecules, bonding and structure. The properties of organic molecules are discussed from the structural perspective considering geometry, polarity and intermolecular forces. The course gives an overview of the chemical reactions used to create reactive substrates to produce new chemical entities and teaches strategies to synthesize compounds from multifunctional substrates. Overall, the course prepares students to think globally about a problem and be able to device different approaches to solve it. Often, students comment that they like the solving puzzle nature of this course.", "relevance": "This course is part of the Organic Chemistry sequence (09217 and 09218). It is also a subject matter of the MCAT tests. It is relevant to understand fundamental concepts in Biochemistry, Molecular Biology, Laboratory II: Synthesis and Analysis, Supramolecular Chemistry, Environmental Chemistry, among other courses that involve organic materials with medical and material applications. Organic Chemistry is the foundation for many other subjects dealing with living organisms and products derived from them such as food, medicine, cosmetics, and textiles, among others.", "learning_resources": "The following material is made available to students through Canvas and in lecture: PowerPoint presentations and corresponding lecture notes; recitation material including a summary of concepts; practice problems and solutions; warm up problems every lecture; homework material and answer key; practice exams and answer key; textbook and solutions manual, both are optional but six copies of each are available at the Wean Hall library. IClicker is used to stimulate active participation in lecture; some extra credit is awarded for student participation. Office hours and open door policy allows for flexibility to access help; students can also ask questions through Piazza with an average response time of about 30 min; emailed questions are also answered. Supplementary Instruction and Walk-In consultation is made available to the 09217 students through other CMU resources. The Office of Disability Resources also offers exam proctoring as well as additional help to students with different disabilities, including time management.", "extra_time_commitment": "Students have to commit about 5 hours a week to review lecture material and answer homework and recitation exercises. In this course is fundamental that students keep consistency with the time dedicated to the course materials. Falling back may entail an important time investment to catch up. Practice is the key to succeed and taking advantage of the practice offered in the course is one advice that students should pay close attention to."}, "equiv": [{"units": 0.0, "code": "09-117", "id": 7349, "name": null}], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "This course presents an overview of structure and bonding as it pertains to organic molecules. Selected topics include introduction to functional group chemistry, stereochemistry, conformational analysis, reaction mechanisms and use of retrosynthetic analysis in the development of multistep syntheses. Methods for structure determination of organic compounds by modern spectroscopic techniques are introduced. 3 hrs. lec., 1 hr. rec.", "short_name": "ORGANIC CHEMISTRY I", "co_reqs": [], "instructors": [{"username": "khhunter", "first_name": "Kevin", "last_name": "Hunter", "tags": [], "hours_per_week": 0, "id": 3455, "semesters_taught": [{"semester": 1, "year": 2018}, {"semester": 3, "year": 2018}, {"semester": 3, "year": 2019}], "photo_url": null}, {"username": "sfaulkne", "first_name": "Simon", "last_name": "Faulkner", "tags": [], "hours_per_week": 0, "id": 4266, "semesters_taught": [{"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "photo_url": null}], "anti_reqs": [{"units": 10.0, "code": "09-219", "id": 5318, "name": "Modern Organic Chemistry"}], "prereqs": {"text": "(09-107 at least D) or (09-105 at least D)", "raw_pre_req": "", "req_obj": {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 10.0, "code": "09-107", "id": 6596, "name": "Honors Chemistry: Fundamentals, Concepts and Applications"}}, "type_string": "", "type": "course", "id": 6596}], "id": 6597, "screen_name": "09-107"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 14630}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 14631}], "id": 11750, "screen_name": "oop7fepb82lwu7t"}, {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 10.0, "code": "09-105", "id": 6595, "name": "Introduction to Modern Chemistry I"}}, "type_string": "", "type": "course", "id": 6595}], "id": 6596, "screen_name": "09-105"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 14632}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 14633}], "id": 11751, "screen_name": "qsafb342h4qy2hr"}], "constraints": [{"data": {"x": 1, "is_and": false}, "type": "anyxof", "id": 14629}], "id": 11749, "screen_name": "v8p7trmszy7zfm0"}}, "is_req_repeatable": false, "topic": null, "name": "Organic Chemistry I", "base_name": "Organic Chemistry I", "skills": [{"id": 239, "name": "Organic Chemistry", "slug": "organic-chemistry"}, {"id": 815, "name": "Structural Mechanics", "slug": "structural-mechanics"}, {"id": 1848, "name": "Organization", "slug": "organization"}], "success": true, "attributes": []}