{"code": "09-218", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 3, "year": 2019}, {"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}, {"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Note: The sequence of topics may not be as shown. 1- Conjugated Unsaturated Systems, carbocation stability, electrophilic additions, Diels-Alder reactions; 2- Aromaticity, aromatic compounds, spectroscopic properties of aromatic compounds; 3- Reactions of aromatic compounds, electrophilic and nucleophilic aromatic substitutions, reduction of aromatic compounds; 4- Aldehydes and Ketones, nucleophilic addition, their synthesis, addition of alcohols, amines, ylides, and cianides; oxidation of aldehydes; 5- Carboxylic acids, synthesis of derivatives: ester, amides, anhydrides, acyl chlorides; carboxylic acids as nucleophiles. 5- Enols and Enolates, tautomerism; synthesis and reactions. 6- Conjugate addition of carbonyl compounds and condensation; Claisen condensation; aldol reactions; cyclizations. 7- Amines, basicity; synthesis, reactivity; derivatives. 8- Introduction to Carbohydrates, Lipids and Proteins.", "prerequisite_knowledge": "Organic Chemistry I (09217) or Modern Organic Chemistry I (09219)", "assessment_structure": "Students will be assessed through three one-hour exams and a Final Exam; these will make 80% of the grade; the reminder 20% of the grade will be given by the average grade of five homework (out of 6).\nThe one-hour exams and the final exam will be graded on 100-point scales. To calculate your grade we will add all three one-hour exams (300 points) and three times the Final score (300 points); the two lowest scores will be dropped (400 points left). Your highest five scores for the homework (100 points, 20 points each) will be added. Total points: 500 (=100%). The final grade (A, B, etc.) will be straightforward: 90+ % = A; 80.0-89.9 % = B; 70.0-79.9 % = C; 60.0-69.9 % = D; all below this score will receive an R. Grades will not be curved. No make ups will be provided.", "goals": "This course offers fundamental knowledge about organic molecules that complement the fundamental aspects of molecular reactivity learned in Organic Chemistry I. In this part of the series, the focus is on the reactivity of molecules that show different stability and properties than the ones presented in the first course of this series. Such molecules are aromatic compounds and dienes. The synthesis of a variety of compounds derived from carbonyl containing molecules will be discussed. Overall, the course prepares students to think globally about a problem and teach them to device different approaches to solve it. Often, students comment that Organic Chemistry I is like solving a puzzle, Organic Chemistry II offers additional pieces to widen the variety of products that can be created through synthesis and teaches additional concepts about reactivity and complementary knowledge on spectroscopy.", "relevance": "This course (09218) is the second part of the Organic Chemistry sequence (09217 or 09219). It is also a subject matter of the MCAT tests. Organic Chemistry is fundamental to understand foundational concepts in biochemistry, molecular biology, supramolecular chemistry, environmental chemistry, food science, and elements of cosmeticology, among other subjects that involve organic molecules with medical and/or material applications.", "learning_resources": "This course will use Canvas as the platform to post exercises, study materials and lecture notes. We will use Organic Chemistry by Solomons and Fryhle as a reference textbook but any other organic chemistry textbook would work well. The following on-line resource: https://www2.chemistry.msu.edu/faculty/reusch/VirtTxtJml/intro1.htm\nwill be very useful. Office hours with a TA, the Piazza discussion forum, and an open door policy by the instructor will provide the student with additional help.", "extra_time_commitment": "Students may need at least one hour per day of practice and reading fundamental concepts. Solving problems is the best way to succeed in this course; having a weekly routine for practicing is the most efficient way to assimilate the material."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "This course further develops many of the concepts introduced in Organic Chemistry I, 09217. Emphasis is placed on the utilization of reaction mechanisms for understanding the outcome of chemical transformations, and the employment of a wide variety of functional groups and reaction types in the synthesis of organic molecules. Also included in the course will be special topics selected from the following polymers and advanced materials, biomolecules such as carbohydrates, proteins and nucleic acids, and drug design. 3 hrs. lec., 1 hr. rec.", "short_name": "ORGANIC CHEMISTRY II", "co_reqs": [], "instructors": [{"username": "rbachu", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 199, "semesters_taught": [{"semester": 2, "year": 2019}], "photo_url": null}, {"username": "khhunter", "first_name": "Kevin", "last_name": "Hunter", "tags": [], "hours_per_week": 0, "id": 3455, "semesters_taught": [{"semester": 1, "year": 2018}, {"semester": 3, "year": 2019}], "photo_url": null}, {"username": "sfaulkne", "first_name": "Simon", "last_name": "Faulkner", "tags": [], "hours_per_week": 0, "id": 4266, "semesters_taught": [{"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}, {"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}], "photo_url": null}], "anti_reqs": [{"units": 10.0, "code": "09-220", "id": 1862, "name": "Modern Organic Chemistry II"}], "prereqs": {"text": "(09-219 at least D) or (09-217 at least D)", "raw_pre_req": "", "req_obj": {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 10.0, "code": "09-219", "id": 5318, "name": "Modern Organic Chemistry"}}, "type_string": "", "type": "course", "id": 5318}], "id": 5319, "screen_name": "09-219"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 55628}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 55629}], "id": 44000, "screen_name": "fu21o2tdf16jaka"}, {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 9.0, "code": "09-217", "id": 5315, "name": "Organic Chemistry I"}}, "type_string": "", "type": "course", "id": 53361}], "id": 42111, "screen_name": "09-217"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 55630}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 55631}], "id": 44001, "screen_name": "8y4swzxkbt8siaf"}], "constraints": [{"data": {"x": 1, "is_and": false}, "type": "anyxof", "id": 55627}], "id": 43999, "screen_name": "rxbhdy4jyb8nyzr"}}, "is_req_repeatable": false, "topic": null, "name": "Organic Chemistry II", "base_name": "Organic Chemistry II", "skills": [{"id": 239, "name": "Organic Chemistry", "slug": "organic-chemistry"}, {"id": 1848, "name": "Organization", "slug": "organization"}], "success": true, "attributes": []}