{"code": "11-346", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2020}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": true, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Hands-on exploration of text mining process: data exploration and setup, feature space design, model evaluation, troubleshooting and iteration. Students will learn to use the LightSIDE tool bench and do hands-on work with provided data sets and then do a project with a data set of their own choosing. Some conceptual overview of concepts related to machine learning algorithms will be provided.", "prerequisite_knowledge": null, "assessment_structure": "Students will take conceptually focused quizzes, do hands on practical homework assignments that exercise basic skills, and will do a project that will be hand graded. Assessments will emphasize concepts and methods, not model performance.", "goals": "Students will gain an appreciation for what machine learning is and is notStudents will gain competence in applying machine learning technology in a purposeful manner, which includes Basic data manipulation skills Data structure design skills Meansends analysis Solid corpus based experimentation methodology Evaluating and reporting resultsStudents will gain competence in moving forward in the face of difficulties, which requires Data interpretation and model interpretation Error analysis skills Hypothesis formationsense making skills", "relevance": "The course this content is extracted from is part of a course I offer every semester on campus at CMU Pittsburgh, and I regularly get over 100 students from all over campus enrolling because people in virtually every field find this content important and relevant.", "learning_resources": "Opensource LightSIDE tool bench (http://ankara.lti.cs.cmu.edu/side/download.html) and\nWitten, I. H., Frank, E., Hall, M., Pal, C. (2016). Data Mining: Practical Machine Learning Tools and Techniques, fourth edition, Elsevier: San Francisco", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}, {"sem": 3, "type": "INFO", "name": "specific_sem"}], "units": 3.0, "website": null, "long_desc": "Hands on exploration of text mining process data exploration and setup, feature space design, model evaluation, trouble shooting and iteration. Students will learn to use the LightSIDE tool bench and do hands on work with provided date sets and then do a project with a data set of their own choosing. Some conceptual overview of concepts related to machine learning algorithms will be provided. Students will gain an appreciation for what machine learning is an dis not. Students will gain competence in applying machine learning technology in a purposeful manner, which includes basic data manipulations skills data structure design skills meansends analysis solid corpus based experimentation methodology evaluating and reporting results data interpretation and model interpretation error analysis hypothesis formation and sensemaking skills", "short_name": "TEXT MINING IN PRACT", "co_reqs": [], "instructors": [{"username": "cp3a", "first_name": "Carolyn", "last_name": "Rose", "tags": [], "hours_per_week": 0, "id": 776, "semesters_taught": [{"semester": 2, "year": 2020}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": true, "topic": null, "name": "Text Mining in Practice", "base_name": "Text Mining in Practice", "skills": [], "success": true, "attributes": []}