{"code": "11-685", "offered_in_campuses": [9, 1, 18, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 12.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": null, "prerequisite_knowledge": null, "assessment_structure": null, "goals": null, "relevance": null, "learning_resources": null, "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 895, "name": "graduate"}], "min_units": 12.0, "offering_tags": [{"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 12.0, "website": null, "long_desc": "Deep learning is a subfield of AI that has lately taken the world by storm. Deep learning systems have been shown to able to recognize speech almost as well as humans, recognize images better than humans, read the web and answer questions, learn on their own to play games, beat humans at the toughest games like go and even speak more clearly than a human can. Deep learning currently dominates research in a variety of scientific areas, including text and language processing, data mining, speech processing, computer vision, robotics, and AI. Deep learning based products and services dominate the market in many areas. Whether youre using Google or social media, buying a plane ticket, browsing an online retailer, investing in stocks, or hailing an Uber, you are interacting with a deep learning system. Knowledge of deep learning is considered a valuable asset, and sometimes even essential, in the employment market. So what exactly is this mysterious beast In this course we will study the basics of deep learning systems, starting from their humble beginnings as attempts to understand human cognition, their adolescence as artificial neural networks, leading on to the current complex systems that can perform astounding tasks. Students will learn both the underlying principles through a series of 13 lectures, and to actually implement and manipulate these systems for various tasks through a series of lab exercises.", "short_name": "INTRO DEEP LRNG", "co_reqs": [], "instructors": [{"username": "bhikshar", "first_name": "Bhiksha", "last_name": "Ramakrishnan", "tags": [], "hours_per_week": 0, "id": 451, "semesters_taught": [{"semester": 2, "year": 2022}], "photo_url": null}], "anti_reqs": [{"units": 12.0, "code": "18-786", "id": 10524, "name": "Introduction to Deep Learning"}], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Introduction to Deep Learning", "base_name": "Introduction to Deep Learning", "skills": [], "success": true, "attributes": []}