{"code": "15-330", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2021}, {"semester": 2, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 12.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This course introduces students to the fundamentals of computer security, and is structured into four broad sections: Software Security, Cryptography, System/Network Security, and Human Factors.", "prerequisite_knowledge": null, "assessment_structure": "We translate your final class percentage into a letter grade as follows:\n\n89.5 - 100: A\n79.5 - 89.4: B\n69.5 - 79.4: C\n59.5 - 69.4: D\n< 59.5: F\nThe total points possible are allocated as follows:\n\n30% Homework\n30% Exam 1\n30% Exam 2\n5% Class Participation\n5% Recitation Participation\nNote that there are three exams: we will drop your lowest exam score.", "goals": "After completing the course, students will be able toDevelop formal and informal threat models for modern systems.Justify fundamental security principles and apply them to the analysis of novel situations.Identify common security vulnerabilities, develop exploits against them, and assess the tradeoffs of possible defenses.Explain common techniques used to construct secure systems and evaluate their effectiveness against a range of attacks.Select the appropriate cryptographic primitive to achieve a desired security property, perform basic cryptographic proofs, and evaluate the security of cryptographic protocols.Argue for and against laws and public policy that intersect with computer security.Incorporate human factors into the evaluation of the security of a system.", "relevance": "This course is the first step in both the SCS Security & Privacy concentration and the ECE Security & Privacy concentration. These concentrations are designed to expose students to the key facets of and concerns about computer security and privacy that drive practice, research, and legislation. On completing the curriculum, students will be prepared to continue developing their interests in security or privacy through graduate study; to be informed participants in public and other processes that shape how organizations and society develop to meet new challenges related to computer security or privacy; and to take jobs in security or privacy that will provide further training in applicable areas.", "learning_resources": "Piazza; Most lectures will be accompanied by required and optional readings. The former provide additional detail on the lecture topic, and so they should be helpful for the associated homeworks and exams. Optional readings provide further depth and/or explanation, but material in optional readings will not be required for homeworks or exams.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 12.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 12.0, "website": "https://www.andrew.cmu.edu/course/18-330/", "long_desc": "Security is becoming one of the core requirements in the design of critical systems. This course will introduce students to the introlevel fundamental knowledge of computer security and applied cryptography. Students will learn the basic concepts in computer security including software vulnerability analysis and defense, networking and wireless security, and applied cryptography. Students will also learn the fundamental methodology for how to design and analyze security critical systems.", "short_name": "INTROD COMPTR SECRTY", "co_reqs": [], "instructors": [{"username": "rdriley", "first_name": "Ryan", "last_name": "Riley", "tags": [], "hours_per_week": 0, "id": 723, "semesters_taught": [{"semester": 2, "year": 2021}, {"semester": 2, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "(15-213 at least C)", "raw_pre_req": "", "req_obj": {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 12.0, "code": "15-213", "id": 3113, "name": "Introduction to Computer Systems"}}, "type_string": "", "type": "course", "id": 3113}], "id": 3114, "screen_name": "15-213"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 1180071}, {"data": {"grade": "C", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of C", "type": "mingrade", "id": 1180072}], "id": 1030616, "screen_name": "s4j1aauseh01f34"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 1180070}], "id": 1030615, "screen_name": "346ix1abh4zufaq"}}, "is_req_repeatable": false, "topic": null, "name": "Introduction to Computer Security", "base_name": "Introduction to Computer Security", "skills": [], "success": true, "attributes": []}