{"code": "17-313", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 12.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Process consideration for software development; Requirements elicitation, documentation, and evaluation; Design for quality attributes; Strategies for quality assurance, including measurement, inspection, and static and dynamic analysis; Empirical methods in software engineering; Time and team management; and Economics of software development. See web site for details.", "prerequisite_knowledge": "No formal prerequisites, but you will get more out of the course if you have experience with some larger development projects, for example, through larger class projects (e.g., 17-214, 15-410), internships, or open-source contributions.", "assessment_structure": "This course has a strong technical focus, and includes assignments with and without programming and written components. The course has a strong focus on in-class discussions and teamwork and provides support for effective team functioning. There are regular readings, a midterm, and a final.", "goals": "Understand software engineering as a human activity and business concern understand involved risks and tradeoffs understand the purpose and need of software engineering.Understand the need for and difficulty of measurement throughout all SE activities understand basic relevant statistics.Elicit, describe, and evaluate a systems requirements.Design a software system and evaluate a design with regard to various quality attributes.Develop and justify a qualityassurance strategy for a software project.Plan the process for and manage a software project.Reason about business models and open source.", "relevance": "Successful software projects require more than just technical expertise. Figuring out what the client wants, collaborating in a team, managing complexity, mitigating risks, staying on time and budget, and determining under various constraints when a product is good enough to be shipped are at least equally important topics that often have a significant human component. 17-313 explores these issues broadly covering the fundamentals of modern software engineering. The course also puts students on a fast track toward project management positions.", "learning_resources": "Slides, readings, and supplementary materials will be posted. Students are free to decide on programming languages and tools for assignments.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 12.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 12.0, "website": "https://www.cs.cmu.edu/~ckaestne/17313/", "long_desc": "Students gain exposure to the fundamental principles of software engineering. This includes both core CS technical knowledge and the means by which this knowledge can be applied in the practical engineering of complex software in realworld settings. Topics related to software artifacts include coding, software architecture, measurement, and quality assurance of various qualities e.g., robustness, security, performance, maintainability with static and dynamic analysis, testing, code review, and inspection. Topics related to software process include requirements engineering, process models and evaluation, personal and team development, and supply chain issues including outsourcing and open source. This course has a strong technical focus, a strong focus on developing team skills, and will include both written and programming assignments. Students will get experience with the latest software engineering tools and practices.", "short_name": "FNDTNS SFTWR ENGNRNG", "co_reqs": [], "instructors": [{"username": "srazak", "first_name": "Saquib", "last_name": "Razak", "tags": [], "hours_per_week": 0, "id": 370, "semesters_taught": [{"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Foundations of Software Engineering", "base_name": "Foundations of Software Engineering", "skills": [{"id": 813, "name": "Statics", "slug": "statics"}], "success": true, "attributes": []}