{"code": "17-334", "offered_in_campuses": [1], "offerings": [{"semesters": [], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Usability and user-interface problems related to security and privacy; designing and conducting user studies related to security and privacy.", "prerequisite_knowledge": "Prior computer science courses are helpful", "assessment_structure": "Homework assignments, two exams, final project", "goals": null, "relevance": null, "learning_resources": "Online articles and textbook", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "There is growing recognition that technology alone will not provide all of the solutions to security and privacy problems. Human factors play an important role in these areas, and it is important for security and privacy experts to have an understanding of how people will interact with the systems they develop. This course is designed to introduce students to a variety of usability and user interface problems related to privacy and security and to give them experience in designing studies aimed at helping to evaluate usability issues in security and privacy systems. The course is suitable both for students interested in privacy and security who would like to learn more about usability, as well as for students interested in usability who would like to learn more about security and privacy. Much of the course will be taught in a graduate seminar style in which all students will be expected to do a weekly reading assignment and each week different students will prepare a presentation for the class. Students will also work on a group project throughout the semester. The course is open to all graduate students who have technical backgrounds. The 12unit course numbers 08734 and 5836 are for PhD students and masters students. Students enrolled in these course numbers will be expected to play a leadership role in a group project that produces a paper suitable for publication.  The 9unit 500level course numbers 08534 and 05436 are for juniors, seniors, and masters students. Students enrolled in these course numbers will have less demanding project and presentation requirements.", "short_name": "USABLE PRIVACY SECTY", "co_reqs": [], "instructors": [], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Usable Privacy and Security", "base_name": "Usable Privacy and Security", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "interdisciplinary", "id": 10}, {"type": "attribute", "name": "research", "id": 14}, {"type": "attribute", "name": "team project", "id": 17}]}