{"code": "17-413", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2018}], "sub_semesters": [], "campus_id": 2}], "max_units": 12.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Students will do a semester long project as a part of a capstone class", "prerequisite_knowledge": "software development skills, understanding of the software development process", "assessment_structure": "Students will present deliverables throughout the semester, and will present their work at the end of the semester", "goals": "Course will allow students to apply their knowledge of software development and software engineering and develop mastery through practice", "relevance": "Students will leave the course with a firsthand understanding of the software engineering realities that drive SE practices, will have concrete experience with these practices, and will have engaged in active reflection on this experience.", "learning_resources": "Students will be provided with some materials, but mostly it will be a class for practical application of existing knowledge.", "extra_time_commitment": "Yes, students will need to meet with their project clients outside of class time"}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 12.0, "offering_tags": [{"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 12.0, "website": null, "long_desc": "This course is a projectbased course in which students conduct a semesterlong project for a real client in small teams. This is not a lecturebased course after the first few weeks the course consists primarily of weekly team meetings with the course instructors, with teams making regular presentations on their software development process. Students will leave the course with a firsthand understanding of the software engineering realities that drive SE practices, will have concrete experience with these practices, and will have engaged in active reflection on this experience. After the course, students will have the teamwork, process, and product skills to be immediately competent in a software engineering organization, and will be able to evaluate the new processes and techniques they will encounter in the workplace.", "short_name": "SFTWR ENGRG PRACTCUM", "co_reqs": [], "instructors": [{"username": "srazak", "first_name": "Saquib", "last_name": "Razak", "tags": [], "hours_per_week": 0, "id": 370, "semesters_taught": [{"semester": 1, "year": 2018}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Software Engineering Practicum", "base_name": "Software Engineering Practicum", "skills": [], "success": true, "attributes": []}