{"code": "19-477", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2021}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Cyber-physical attacks to energy infrastructure, the climate change turmoil, the quest for utility-scale battery technology innovation, the critical matters of retiring nuclear and fossil-fueled units that are hard to be properly replaced, and the ever-going discussion about the structure and organization of the recently restructured electricity markets require leadership vision and robust management mind-set. All these current matters fall on top of the challenging nature of electricity itself (highly variable demand and renewables, hard to store efficiently and in bulk, catastrophic socioeconomic effects when black-outs occur, dependence on highly diverse primary sources of energy, etc). Multiple entities ranging from regulators implementing political decisions, operators handling day-to-day operation and all the way to customers' associations require for multi-objective decision- making at many levels and facades of the industry, while considering the changing environment and planning for the adoption of innovation, standardization and upcoming policy. In this course all the aforementioned parameters and concerns as seen, developed and implemented by all stakeholders in the field, through both their actions and their interactions will be presented and discussed.", "prerequisite_knowledge": "Basic understanding of markets operation is required.", "assessment_structure": "¿ Project (~35%): Oral presentation (5' pitch of less than 10 slides) and an essay (500-800 words) describing a strategy and the procedures to implement an electricity market challenge. The challenges are posed by industry experts and academics who usually attend the pitches. ¿ Turn-in Assignments (~35%): Three equally weighed assignments (quantitative or short text). ¿ Low-risk short Quizzes (~15%): At various times during class hours (in the middle or/and at the end to summarize main points and review previous material) and only available at that time, a (mostly) multiple-choice quiz will be handed out or published on Canvas. Answering correct at least half of the quiz is considered \"acing\" it. Quizzes not taken are graded zero. ¿ Low-risk Commentary on Readings (~15%): After each class and relevant to its content 1-3 articles will be distributed to the students. They students can comment on any of the articles, assess business cases and identify challenges or other kind issues in the frameworks of restructured electricity markets.", "goals": "After completing this course, the students will be able to Understand the roles of all major entities in the electricity markets, namely operators, regulators, loadgeneration aggregatorscustomers, and equipmentsoftware manufacturerssuppliers. Prepare for and participate in electricity markets energy and ancillary services both online and forward ones. Review and recommend market restructures and regulations. Identify challenges for every stakeholder in the field and propose proper action, e.g. overcome capacity concerns for the case of a transmission system operator. Appraise investmenttrading opportunities in the shorter market and longer planning terms. Qualify as an authority with allround knowledge and wide knowhow of the field and the intertwined relations among the multitude of actors involved. Complement their expertise in Operational, Risk, Pricing, Financing, and Resource Management as the electricity market frameworks and processes are pragmatical and well understood ex", "relevance": "The course proposed is relevant to the Business Administration program and falls within the concentration of Operations. It may be attended either as a major or minor elective as it is self-contained. A mini-version of it has been offered for the past 3 years at Tepper to the MBA and flex-MBA programs, and has also been cross-listed with the College of Engineering. It has had increasing number of attendance and covered also by CMU News in 2019 https://www.cmu.edu/news/stories/archives/2019/may/energy-course.html", "learning_resources": "¿ Instructor's notes and power-point presentations ¿ Reading material from (indicatively) the following e-books available through institutional access (CMU library): \"Restructured Electric Power Systems: Analysis of Electricity Markets with Equilibrium Models\" by Xiao¿Ping \"Power Markets and Economics: Energy Costs, Trading, Emissions\" by Barrie Murray \"New Power Markets: Corporate Strategies for Risk and Reward\" by Robert Jameson \"Power Generation Investment in Electricity Markets\" by the International Energy Agency, \"The Economics of Electricity Markets\" by D. R. Biggar and M. R. Hesamzadeh, \"Electricity markets : pricing, structures and economics\" by C. Harris, and \"Competitive electricity markets : design, implementation, performance\" by F. P. Sioshansi", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "Cyberphysical attacks to energy infrastructure, the climate change turmoil, the quest for utilityscale battery technology innovation, the critical matters of retiring nuclear and fossilfueled units that are hard to be properly replaced, and the evergoing discussion about the structure and organization of the recently restructured electricity markets require leadership vision and robust management mindset. All these current matters fall on top of the challenging nature of electricity itself highly variable demand and renewables, hard to store efficiently and in bulk, catastrophic socioeconomic effects when blackouts occur, dependence on highly diverse primary sources of energy, etc. Multiple entities ranging from regulators implementing political decisions, operators handling daytoday operation and all the way to customers associations require for multiobjective decision making at many levels and facades of the industry, while considering the changing environment and planning for the adoption of innovation, standardization and upcoming policy. In this course all the aforementioned parameters and concerns as seen, developed and implemented by all stakeholders in the field, through both their actions and their interactions will be presented and discussed.", "short_name": "ELECTRICITY MKTS", "co_reqs": [], "instructors": [{"username": "pmoutis", "first_name": "Panagiotis", "last_name": "Moutis", "tags": [], "hours_per_week": 0, "id": 3593, "semesters_taught": [{"semester": 1, "year": 2021}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Electricity Markets - Management & Operation", "base_name": "Electricity Markets - Management & Operation", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "entrepreneurship", "id": 4}, {"type": "attribute", "name": "global", "id": 7}, {"type": "attribute", "name": "interdisciplinary", "id": 10}, {"type": "attribute", "name": "sustainability/environment", "id": 16}, {"type": "attribute", "name": "team project", "id": 17}]}