{"code": "38-101", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 6.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "During the seminar, students will be presented with opportunities and experiences designed to help them frame how the MCS curriculum aspires to shape their evolving identities in the areas of scholar, person, professional and citizen, while also engendering a sense of excitement about science and scientific inquiry. The seminar will offer information and strategies that are employed both by successful students and by successful scientists in optimizing their approach to work and life, with a key focus on areas such as cognitive learning skills, research, teamwork, goal setting, time management, innovation, community engagement, ethics, resources and assessment. Additionally, the seminar will introduce first-year students to the learning outcomes and requirements associated with the MCS core curriculum, with a particular emphasis on the self-directed ENGAGE courses and the role of the MyCORE system in documenting and framing student growth and development.", "prerequisite_knowledge": null, "assessment_structure": "Attendance: 20%\nParticipation: 30%\nHomework: 30%\nTeam Project: 20% \"", "goals": "Identify campus resources that promote academic and personal success. Identify the important traits and characteristics of successful scientists and mathematicians embolden their burgeoning excitement in the sciences. Understand the expectations associated with the selfdirected aspects of the CORE Curriculum. Initiate a process for recursive selfassessment to promote personal wellbeing, academic success, and ethical decision making. Develop strategies for leveraging personal strengths toward effective and successful team participation. Understand fundamentals of effective oral and written communication. Seek out and utilize best practices employed by upperclass MCS students. Develop proficiency with MyCORE.", "relevance": "The MCS First-Year Seminar EUREKA! will equip new students with foundational knowledge, skills and perspectives that will support their development as emerging scientists.", "learning_resources": "Canvas course site as well as StrengthsQuest assessment will be used to identify personal strengths for ea", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 6.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}], "units": 6.0, "website": null, "long_desc": "The MCS firstyear seminar EUREKA Discovery and Its Impact will equip new students with foundational knowledge, skills and perspectives that will support their development as emerging scientists.  During the seminar, students will be presented with opportunities and experiences designed to help them frame how the MCS curriculum aspires to shape their evolving identities in the areas of scholar, person, professional and citizen, while also engendering a sense of excitement about science and scientific inquiry.  The seminar will offer information and strategies that are employed both by successful students and by successful scientists in optimizing their approach to work and life, with a key focus on areas such as cognitive learning skills, research, teamwork, goal setting, time management, innovation, community engagement, ethics, resources and assessment.  Additionally, the seminar will introduce firstyear students to the learning outcomes and requirements associated with the MCS core curriculum, with a particular emphasis on the selfdirected ENGAGE courses and the role of the eportfolio system in documenting and framing student growth and development.", "short_name": "EUREKA DISC & IMPACT", "co_reqs": [], "instructors": [{"username": "rule", "first_name": "Gordon", "last_name": "Rule", "tags": [], "hours_per_week": 0, "id": 1869, "semesters_taught": [{"semester": 1, "year": 2016}, {"semester": 1, "year": 2017}, {"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}], "photo_url": null}, {"username": "sfaulkne", "first_name": "Simon", "last_name": "Faulkner", "tags": [], "hours_per_week": 0, "id": 4266, "semesters_taught": [{"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "photo_url": null}, {"username": "naffara", "first_name": "Nesrine", "last_name": "Affara", "tags": [], "hours_per_week": 0, "id": 1360, "semesters_taught": [{"semester": 1, "year": 2017}, {"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "photo_url": null}, {"username": "khovis", "first_name": "Ken", "last_name": "Hovis", "tags": [], "hours_per_week": 0, "id": 967, "semesters_taught": [{"semester": 1, "year": 2016}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "EUREKA!: Discovery and Its Impact", "base_name": "EUREKA!: Discovery and Its Impact", "skills": [{"id": 1856, "name": "Portfolio Management", "slug": "portfolio-management"}], "success": true, "attributes": [{"type": "attribute", "name": "team project", "id": 17}]}