{"code": "38-330", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2019}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 1.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Three areas (spiritual, environmental, community) wellness were chosen as the focus of the second ENGAGE in Wellness course", "prerequisite_knowledge": null, "assessment_structure": "This course does not meet but is completed entirely online and is a pass/fail course. An expectation for the completed assignment is a 3-4 page single-spaced document reflecting on one of the three areas of wellness and setting goals for improvement in that area. This is a Pass/No Pass Course", "goals": "We created this course for MCS students to regularly assess their own wellness and to develop action plans for maintaining or improving multiple dimensions of their own wellness. In order to be successful as a student and professional, you must function from a state of wellness.", "relevance": "Given that by the junior year you have discovered ways to be a successful student, it is a time to be more attentive to the multiple ways that you engage with the world around you. Lack of attention to this area can create isolation and a narrowly focused experience. There is a danger of being so focused on depth in your discipline that you risk becoming out of sync with the world around you resulting in negative impacts to yourself and others.", "learning_resources": "MCS MyCORE Canvas Site\nInstructor will be available weekly during office hours or by appointment", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 1.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}], "grade_option": {"is_audit": false, "name": "Pass/Fail", "short_name": "P", "never_graded": false, "is_pass_fail": true, "id": 4}, "units": 1.0, "website": null, "long_desc": "ENGAGE in Wellness Looking Outward is a 1unit minicourse that MCS students will enroll in the fall of the junior year, designed to give students a holistic understanding of their own personal wellness. The course is structured around the concept of a Wellness Wheel, a model for personal wellness that is used to describe the various areas that students should reflect upon when describing, and ultimately improving, their overall wellness. The MCS Wellness Wheel has nine components intellectual, physical, emotional, spiritual, environmental, institutional or community, financial, social, and occupational health. During this second course, taken in the first mini of the junior year, students will select one of three areas on which to focus spiritual, environmental and institutional or community health. They will be asked to engage in a recursive, reflective process to assess their own level of wellness, participate in wellness activities on campus or develop shortterm goals and longerterm goal in this area, and identify possible resources that promote this aspect of wellness. Students should expect to devote 914 hours to the development and articulation of their plan in order to earn a passing grade. These hours are tied to completion of the requested assessments and not to the activities students elect to pursue in fulfillment of their wellness plan. THIS COURSE IS FOR JUNIORS ONLY.", "short_name": "ENG WELLN LKG OUTWD", "co_reqs": [], "instructors": [{"username": "rule", "first_name": "Gordon", "last_name": "Rule", "tags": [], "hours_per_week": 0, "id": 1869, "semesters_taught": [{"semester": 1, "year": 2020}], "photo_url": null}, {"username": "annettev", "first_name": "Annette", "last_name": "Vincent", "tags": [], "hours_per_week": 0, "id": 645, "semesters_taught": [{"semester": 2, "year": 2019}, {"semester": 1, "year": 2019}], "photo_url": null}, {"username": "iyounis", "first_name": "Ihab", "last_name": "Younis", "tags": [], "hours_per_week": 0, "id": 1865, "semesters_taught": [{"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "ENGAGE in Wellness: Looking Outward", "base_name": "ENGAGE in Wellness: Looking Outward", "skills": [{"id": 245, "name": "Resource Model", "slug": "resource-model"}, {"id": 1539, "name": "Promotional Design", "slug": "promotional-design"}], "success": true, "attributes": []}