{"code": "38-301", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2019}, {"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}, {"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 6.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The course will use traditional career development activities, such as interviewing, resume writing and networking, as a starting point for students to begin the process of reflecting on, and preparing for, their impending transitions into professional life. From there, the course will seek to expand students' conceptualization of the scientific workplace by exploring the interplay of science, innovation, public policy, entrepreneurism and business in professional settings today. The seminar will also equip students with significant insight into the ways in which global policy, societal and political forces, environmental issues and ethical considerations shape and influence the activity and research of working scientists. The course will offer additional experiences for students to refine their multidisciplinary teamwork and communication skills via team projects focusing on the aforementioned course themes. Finally, \"PROPEL\" will include a formal academic advising component to ensure that all students are well positioned to complete the MCS core requirements and departmental requirements in the following year.", "prerequisite_knowledge": null, "assessment_structure": "Professional Ethics Module: 15%. Attendance: 25%. Homework: 25%. E&I Group Project: 10%. S&S Group Project: 25%.", "goals": "Analyze a scientific case study and articulate the interplay of science, society, public policy, business, and economics in connection with it. Understand a sciencerelated issue and identify the reciprocal relationships among science, technology, political forces, societal contexts, and environmental issues in connection with it. Develop their personal postgraduation plan and prepare for the related application processes, interviews, and life transition activities. Leverage their disciplinary experience in the service of a unified team objective. Explain a scientific topic to a nonexpert audience and a STEM outside of their major field audience. To explore and be familiar with ethical topic areas such as authorship, data management, and research misconduct that are relevant to all scientific disciplines.", "relevance": "The MCS seminar \"PROPEL\", will leverage upper class students' deepening disciplinary perspective in service of the development of competencies, skills and perspectives that are necessary to achieve professional excellence in today's society.", "learning_resources": "MCS MyCORE Canvas Site", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 6.0, "offering_tags": [{"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 6.0, "website": null, "long_desc": "PROPEL Preparation, Readiness, and Optimization for Professional Excellence in Life  is a 6unit seminar course that MCS students will enroll in the spring of their junior year. The course will leverage students deepening disciplinary perspective in service of the development of competencies, skills and perspectives that are necessary to achieve professional excellence in todays society. The course will use traditional career development activities, such as interviewing, resume writing and networking, as a starting point for students to begin the process of reflecting on, and preparing for, their impending transitions into professional life. From there, the course will seek to expand students conceptualization of the scientific workplace by exploring the interplay of science, innovation, public policy, entrepreneurism and business in professional settings today. The seminar will also equip students with significant insight into the ways in which global policy, societal and political forces, environmental issues and ethical considerations shape and influence the activity and research of working scientists. The course will offer additional experiences for students to refine their multidisciplinary teamwork and communication skills via small group projects focusing on the aforementioned course themes. Finally, PROPEL will include a formal academic advising component to ensure that all students are well positioned to complete the MCS core requirements and departmental requirements in the following year.  THIS COURSE IS FOR MCS JUNIORS ONLY.", "short_name": "PROPEL", "co_reqs": [], "instructors": [{"username": "rule", "first_name": "Gordon", "last_name": "Rule", "tags": [], "hours_per_week": 0, "id": 1869, "semesters_taught": [{"semester": 2, "year": 2019}], "photo_url": null}, {"username": "mohamedb", "first_name": "Mohamed", "last_name": "Bouaouina", "tags": [], "hours_per_week": 0, "id": 638, "semesters_taught": [{"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}], "photo_url": null}, {"username": "iyounis", "first_name": "Ihab", "last_name": "Younis", "tags": [], "hours_per_week": 0, "id": 1865, "semesters_taught": [{"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}], "photo_url": null}, {"username": "caoun", "first_name": "Chadi", "last_name": "Aoun", "tags": [], "hours_per_week": 0, "id": 736, "semesters_taught": [{"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}, {"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "PROPEL", "base_name": "PROPEL", "skills": [{"id": 160, "name": "Environmental Science", "slug": "environmental-science"}, {"id": 320, "name": "Scientific Writing", "slug": "scientific-writing"}], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "entrepreneurship", "id": 4}, {"type": "attribute", "name": "ethics", "id": 5}, {"type": "attribute", "name": "team project", "id": 17}]}