{"code": "48-369", "name": "Sustainable Architecture and Urbanism for the Gulf Region", "base_name": "Sustainable Architecture and Urbanism for the Gulf Region", "units": 3.0, "min_units": 3.0, "max_units": 3.0, "short_name": "SUST ARCH AND URBAN", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1, 2], "offerings": [{"campus_id": 2, "semesters": [{"semester": 2, "year": 2023}], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "Ensuring a sustainable built environment in Qatar is critical to sustainable Gulf Region and indeed a sustainable world. The quality of our architecture and urban design can significantly address the challenges of heat, water, energy, mobility, material resources, waste, and health. This course is intended for nonarchitects to explore the potential of sustainable design for desert climates.  Six weeks of explorations and presentations will introduce each student to Climate analysis for Gulf Region countries and their twins around the world Green standards for desert climates with their embedded metrics eg UNSDG, LEED, GreenStar, WELL and Precedent as a precursor to innovation  a search for great sustainable examples across building types and land use.  Inclass and homework assignments will create a series of collaborative student slide shows each week. As possible, invited speakers and site visits will be pursued. The final week will be dedicated to a class perspective on the importance of the built environment for carbon and climate change, and student recommendations for building and infrastructure goals for a more sustainable Gulf region.  CMUQ graduates should be dedicated to a more sustainable built environment and understand the design changes needed for sustainability, the benefits to quality of life and to ecological sustainability. Every discipline is a catalyst and a stakeholder in our future  as client, as designengineer, as consumer, as financier, as scientist.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [{"first_name": "Vivian", "last_name": "Loftness", "username": "loftness", "photo_url": null, "hours_per_week": 0, "tags": [], "semesters_taught": [{"semester": 2, "year": 2023}], "id": 1462}], "is_repeatable": false, "is_req_repeatable": false, "catalog_levels": [], "skills": [], "attributes": [{"name": "sustainability/environment", "id": 16, "type": "attribute"}, {"name": "team project", "id": 17, "type": "attribute"}], "custom_fields": {"goals": "To raise awareness, knowledge, and commitment to a more sustainable future", "key_topics": "Desert sustainable architecture and urban planning, low energy precedent and climate analysis, green design standards, data analytics, goals and visions for a sustainable future in the desert", "prerequisite_knowledge": null, "assessment_structure": "Student individual and group presentations", "relevance": "Climate change, UNSDG, energy and resource shortages, carbon.", "learning_resources": "Lectures, readings, webinars, visiting speakers, site visits (if possible)", "extra_time_commitment": "Individual and group take home assignments"}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}