{"code": "51-150", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Design, personal futures, ontological design, plan your life, mattering maps", "prerequisite_knowledge": null, "assessment_structure": "(1) Each student explores what matters in their life. There are step-by-step instructions to scaffold the learning experience. The project steps are graded with a rubric. The final project presentation is graded is with a rubric. (2) Readings and viewings have written comprehension questions. (3) weekly reflection posts on course material and commenting on two classmates' reflection posts is graded with a rubric. (4) In-class participation and engagement is graded.", "goals": "1 Map what matters to you and why. 2 Describe your origin story and where you hope to go 3 Clearly describe what matters to you to a specific audience", "relevance": "Think about where you are in your life and where you hope go in the future. What are your dreams? What career do you hope to pursue? What provides meaning to your life and satisfaction? What kind of person do you hope to become? Emily Dickinson said \"the future is dark\" because it is difficult to see. The \"Design your life\" micro course helps students to shed light on the futures they hope to live into. Greek philosopher Socrates said \"the unexamined life is not worth living\". I this course we explore what it means to live a good life. A life well lived requires reflection, meaningful values, living intentionally, and adapting to change. Michelle Obama's autobiography is titled \"Becoming\" because she imagines herself as a work in process. Hopefully, you too are on a trajectory of \"becoming\" the best possible version of yourself as your life unfolds. One of the most important design projects anyone can undertake is the design of their life. To design one's life, goals and values need to be clear. This is a lifelong project that unfolds day by day and it is sometimes difficult to know where and how to begin. ¿ Sometimes students are unclear about what their values are or how to speak about them confidently. ¿ Clarity on one's goals and values allows one to be more confident when interviewing for jobs. ¿ Rarely are students given the time and guidance to imagine their personal futures and the time to explore what matters most to them. The Design Your Life micro course helps students to articulate what matters most to them for their current life stage. The reflective process that they learn can be repeated throughout their lives to navigate decision points and chart their trajectories.", "learning_resources": "(1) Readings and viewings are assigned. Students answer questions on the readings before class. The readings and viewings are discussed in class. (2) Step-by-step activities are done together in small groups during class; finishing the in-class assignments can be done outside of class before the next session.", "extra_time_commitment": "Students are expected to attend class for 15 hours. 9 hours of ZOOM classes and a 6 hour workshop over a weekend. Furthermore, they are expected to do 30 hours of homework to prepare for classes and complete their final project."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "It is difficult to go on a life long journey without a plan or map. In the Design your life microcourse, students take on the most important design project their own life. Students explore who they are, where they come from, and where they hope to go throughout their life. They describe their core values, what makes their life meaningful, and whom they hope to become in the future. While ones life is very personal, we use timetested design methods to explore each persons future. We explore readings from 1 George Lowensteins Mattering Maps, 2 Elle Lunas The Crossroads of Should and Must Find and Follow Your Passion 3 Bill Burnett and Dave Evans approach to Designing Your Life How to Build a WellLived, Joyful Life 4 Verne Verne Wheelwrights person futures approach Its YOUR Future... Make it a Good One, and Tony Frys Ontological Design. By the end of the microcourse each student will have made a plan for their future. The will be able to explain what matters to them and have charted a way forward. Most importantly, they will know how to rechart their life plans as unexpected events require them to adapt their plans.", "short_name": "DESIGN YOUR LIFE", "co_reqs": [], "instructors": [{"username": "pgs", "first_name": "Peter", "last_name": "Scupelli", "tags": [], "hours_per_week": 0, "id": 1571, "semesters_taught": [{"semester": 1, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Design Your Life", "base_name": "Design Your Life", "skills": [], "success": true, "attributes": []}