{"code": "51-219", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2021}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Photography, photo-essay, picture stories, personal voice, narrative, storytelling, sequence, influencers, aesthetics and aesthetic choices, deconstructing and reconstructing image meaning and aesthetic choices, understanding color and how it delivers meaning, lighting, visual hierarchy, making well crafted photographs, Adobe Photoshop, and proper digital photographic workflow.", "prerequisite_knowledge": null, "assessment_structure": "Completion of photo essay project.", "goals": "This micro will be a creative photography class its goal is to help guide students in expressing their views of the world, tell a story about place, and make cohesive story. In the end students will be better at making effective photographs. Along the way, they will learn how to deconstruct image narrative, meaning, and aesthetic choices.", "relevance": "This class will be relevant for people who want to: understand photography better; learn to make more effective images; learn how images work in sequence (building in meaning without redundancy); understand story and narrative construction; create and curate content; learn Adobe Photoshop; developing personal voice; and have a super fun time.", "learning_resources": "Will be provided", "extra_time_commitment": "Class time as well as a few hours of photographing and photoshoping images on your own. (I am guessing 6to8 hours outside of class)"}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "Whether traveling for fun or servicelearning, be it a short distance to downtown or a flight to a new land, students will learn how to tell a story about place. They will work to make a cohesive narrative and photo essay around location. The photoessay, in all its varied levels of polish, is often a mainstay of daily life. Photoessays appear in printed magazines, newspapers, blogs, Instagram feeds, books, catalogs, and even in the context of explaining research in academia. Though the basic structure and components of photoessay date back as early as 1936 issues of Life Magazine, the style and look of photography has changed over time. Students will learn the historic methodology around creating rich, complex story around place how images work together to inform one another and how contemporary images build beauty, poetics and metaphor.", "short_name": "THE PHOTO ESSAY", "co_reqs": [], "instructors": [{"username": "dylanv", "first_name": "Dylan", "last_name": "Vitone", "tags": [], "hours_per_week": 0, "id": 1337, "semesters_taught": [{"semester": 1, "year": 2021}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "The Photo Essay", "base_name": "The Photo Essay", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "maker", "id": 12}]}