{"code": "51-273", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2020}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Design, Climate Change, carbon footprints, behavior change, socio-ecological perspective.", "prerequisite_knowledge": "Curiosity* Excitement about learning new things * Willingness to be challenged * Hope that we can make a difference * Willingness to navigate and explore ambiguous questions", "assessment_structure": "Student projects have step by step deliverables. Each step is graded with a rubric. Student reflections on the course materials are graded with a rubric. Students receive and provide peer reviews for their projects. Such student participation is graded with a rubric.", "goals": "Humans are causing the current climate emergency we need a new paradigm of how to exist on planet earth. Humanity is in the middle of an unfolding existential crisis. Many people are unaware or in denial of the climate emergency, or what they can do to help avert the catastrophic effects of climate change. These are transitional times we live in. The main question this course addresses is what can students and CMU graduates do to help change the trajectory that humanity is on, barreling towards the sixth mass extinction Students will learn how create solutions that lead to rapid decarbonization in their own life, family, and community to help avoid the worst aspects of the climate catastrophe.", "relevance": "Nobel Laureate Herbert Simon said \"Designers devise courses of action aimed at changing existing situations into preferred ones.\" We are in the middle of a climate emergency. The United Nations Intergovernmental Panel on Climate Change (IPCC) issued a dire warning in October 2018 with the 1.5 o C report conservatively estimated that to avoid the catastrophic effects of climate change rapid decarbonization by at least 40-50% by year 2030 and 100% by year 2050 are needed. Global mass movements are pressuring governments towards towards meaningful change: global student led strikes fashioned on Greta Thunberg, Extinction Rebellion in the United Kingdom, and so forth. Employee solidarity walkouts from major corporations coincided with the student led strikes (e.g., Amazon, Microsoft, Google, Ben and Jerry's). What role might designers take on during our defining existential challenge for the future of humanity and life on this planet? In the Introduction to Design for Climate Change course, Students explore how to become the agents of change around the challenges of the climate emergency focused on rapid decarbonization.", "learning_resources": "This course is based on a semester long course called 51.396 and 51.796 \"Design Ethos and Action\" (DEA) which has been taught from 2011-2019. The course was renamed \"Design for Climate Change\" starting spring 2020. Course materials are currently on a course blog see here. Course blog containing all materials such as: book chapters, videos, papers, case studies, in-class discussions, at home reflections, and so forth.", "extra_time_commitment": "work outside of class to complete class assignments."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "The United Nations Intergovernmental Panel on Climate Change IPCC issued a dire warning in October 2018 with the 1.5oC report. The report conservatively estimates that to avoid the catastrophic effects of climate change rapid decarbonization by at least 4050 by the year 2030 and 100 by the year 2050 is needed. Global mass movements are pressuring governments towards meaningful change global studentled strikes fashioned on Greta Thunberg, Extinction Rebellion in the United Kingdom, and so forth. Employee solidarity walkouts from major corporations coincided with the studentled strikes in September 2019 e.g., Amazon, Microsoft, Google, Ben and Jerrys.   In the Sciences of the Artificial book, Herbert Simon said Everyone designs who devises courses of action aimed at changing existing situations into preferred ones. What role might CMUQatar students take on during our defining existential challenge for the future of humanity and life on this planet In the Introduction to Design for Climate Change course, students explore how to become the agents of change around the challenges of the climate emergency focused on rapid decarbonization. Projects focus on different levels depending on student interest individual, campus, or community. This course is open to all students.", "short_name": "DES FOR CLIMATE CHNG", "co_reqs": [], "instructors": [{"username": "pgs", "first_name": "Peter", "last_name": "Scupelli", "tags": [], "hours_per_week": 0, "id": 1571, "semesters_taught": [{"semester": 1, "year": 2020}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Intro to Design for Climate Change", "base_name": "Intro to Design for Climate Change", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "ethics", "id": 5}, {"type": "attribute", "name": "maker", "id": 12}, {"type": "attribute", "name": "research", "id": 14}, {"type": "attribute", "name": "sustainability/environment", "id": 16}]}