{"code": "51-215", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2019}, {"semester": 2, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The objective of this course is to provide students with a practical, technical\nand theoretical foundation in video work. Students will work to build their visual vocabulary... looking to master vernacular of film:\nVISUAL STUFF: shape, size, space, weight, apparent distance, color, quality of light,\ncolor of light, transparency/solidity of objects, movement of subject, movement of\ncamera.\nAUDITORY STUFF: amplitude (loud/quiet), reverberation and echo, frequency (high and\nlow kHz), frequency (how often does it happen) discrete versus broadband noise, color\n(thinness/richness/quality), soothing.\nTEMPORAL STUFF: frequency (how often), duration (how long), interval (how much\ntime in between, cadence/ rhythm", "prerequisite_knowledge": "No prior knowledge is required.", "assessment_structure": "There will be critiques on student's photographs every 2 weeks.\nAttendance and engagement are a requirement.", "goals": "By the end of the course the student should have gained knowledge ofdeveloping a moving picture from start to finish, learned how to storyboardscamp,planscout, production, and postproduction. Equally importantly students will developtheir own visual esthetics in the creation of 4 short moving pictures", "relevance": "The course will provide an opportunity to make richer/more complex\nshort films. It will teach you how to embed meaning and narrative as well as developing\ncinematic vision and voice.", "learning_resources": "Students will be given copies of readings for occasional group\ndiscussion. No textbook is required.", "extra_time_commitment": "Shooting and or creating of images outside of course. A fair\namount of time will be need to create illustrations/images."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "The objective of this course is to provide students with a practical, technical and theoretical foundation in video work. Students leaving this class will have gained knowledge of developing a moving picture from start to finish. Students will learn storyboard, plan, production, and postproduction video. Equally importantly students will start to develop their own visual aesthetics in the creation of 1 short moving pictures. The primary software for this course is Adobe Photoshop, with which students will explore construction, combination, manipulation, input, and output of video as a means of narrative creation. This Micro course will run between 56 weeks. The instructor will fly into Doha for a short period of facetoface classes, centered around a Saturday. Enrolled students should expect two 90minute facetoface classes during the week before or after this Saturday date, as well as four 90minute evening 6730 pm video classes over the duration of the Micro course typically two before the campus visit, and two after, although instructors can change this. Specific dates will be confirmed in the syllabus closer to fall semester.", "short_name": "MAKING SHORT FILMS", "co_reqs": [], "instructors": [{"username": "dylanv", "first_name": "Dylan", "last_name": "Vitone", "tags": [], "hours_per_week": 0, "id": 1337, "semesters_taught": [{"semester": 1, "year": 2019}, {"semester": 2, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Making Short Films", "base_name": "Making Short Films", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "interdisciplinary", "id": 10}, {"type": "attribute", "name": "maker", "id": 12}]}