{"code": "51-281", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Design, Climate Change, carbon footprints, behavior change, socio-ecological perspective.", "prerequisite_knowledge": null, "assessment_structure": "(1) Student projects have step-by-step deliverables. Each step is graded with a rubric. (2) Student reflections on the course materials are graded with a rubric. (3) Students receive and provide peer reviews for their projects. Such student participation is graded with a rubric.", "goals": "Humans are causing the current climate emergency we need a new paradigm of how to exist on planet earth based on emitting zero carbon. Humanity is in the middle of an unfolding existential crisis due to the unfolding climate emergency. Many people are unaware or in denial of the climate emergency, or what they can do to help avert the catastrophic effects of climate change. These are transitional times we live in. The main question this course addresses is what can students and CMU graduates do to help change the trajectory that humanity is on, barreling towards the sixth mass extinction Students will learn how create solutions that lead to rapid decarbonization in their own life, family, and community to help avoid the worst aspects of the climate catastrophe.", "relevance": "To avoid a climate disaster drastic change is needed. Bill Gates describes in his latest book the challenge of reducing carbon emissions from 51 gigatons to zero by year 2050. The United Nations Intergovernmental Panel on Climate Change (IPCC) 1.5oC report conservatively estimates that to avoid the catastrophic effects of climate change rapid decarbonization by at least 40-50% by the year 2030 and 100% by the year 2050 is needed. Global mass movements are pressuring governments towards meaningful change: global student-led strikes fashioned on Greta Thunberg, Extinction Rebellion in the United Kingdom, and so forth. Employee solidarity walkouts from major corporations coincided with the student-led strikes in September 2019 (e.g., Amazon, Microsoft, Google, Ben and Jerry's). In the Sciences of the Artificial book, Herbert Simon said: \"Everyone designs who devises courses of action aimed at changing existing situations into preferred ones.\" What role might CMU-Qatar students take on during our defining existential challenge for the future of humanity and life on this planet? In the Introduction to Design for Zero-Carbon Lifestyles course, students explore how to become the agents of change around the challenges of creating new zero-carbon lifestyles. Projects focus on different levels depending on student interest: individual, campus, or community. This course is open to all students.", "learning_resources": "Course materials are currently on CANVAS. containing all materials such as: book chapters, videos, papers, case studies, in-class discussions, at home reflections", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "To avoid a climate disaster in the future drastic changes are needed. Bill Gates describes the challenge as reducing carbon emissions from 51 gigatons yearly to zerocarbon by the year 2050. Students explore how to imagine and design zerocarbon lifestyles for individuals. In this microcourse, students focus on aspects of Sustainable Development Goals 13 Climate Action, 12 Responsible Consumption and Production, 11 Sustainable Cities and Communities, 9 Industry, Innovation, and Infrastructure, and 7 Affordable and Clean Energy.", "short_name": "DES FOR ZERO CARBON", "co_reqs": [], "instructors": [{"username": "pgs", "first_name": "Peter", "last_name": "Scupelli", "tags": [], "hours_per_week": 0, "id": 1571, "semesters_taught": [{"semester": 1, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Intro to Design for Zero Carbon Lifestyles", "base_name": "Intro to Design for Zero Carbon Lifestyles", "skills": [], "success": true, "attributes": []}