{"code": "51-214", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2021}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Aligning short term design of products and services with long term sustainability goals. Three horizon framework to develop a portfolio of product and service opportunities", "prerequisite_knowledge": "*Prior exposure to design thinking would be helpful but not required *Curiosity to learn about how to design in time *Excitement about learning new things *Willingness to be challenged *Hope that we can make a difference *Willingness to navigate and explore ambiguous questions", "assessment_structure": "Student learning is assessed with: OLI coursework participation. In-class project assignments graded with a rubric. Reflection essays graded with a rubric.", "goals": "In this course, we focus on developing agility with design methods for long time horizons. Traditional design methods such as HumanCentered Design and Design Thinking do not prepare designers to think systematically about longtime horizons or to design for specific value sets such as sustainability. The goal of this course is to apply futures studies methods for long time horizons to identify productservice opportunities. Design for long time horizons is of particular interest for challenges like transition design towards sustainable futures or more generally, to design in turbulent times characterized by rapid change e.g., VUCA worlds volatile, uncertain, complex, ambiguous. The Introduction to Dexign Futures course focuses on seeing and noticing design opportunities in possible alternative futures. Students learn to imagine what products and services opportunities might be possible in different alternative futures. Students are introduced to the Three Horizons framework to understand how businesses strategically create a portfolio of product and service offerings on three time horizons. The Dexign Futures course relies on the World Business Council on Sustainable Development WBCSD plan for year 2050 to ground the course in a well informed and realistic business perspective. According to their website, WBCSD is a global, CEOled organization of over 200 leading businesses working together to accelerate the transition to a sustainable world. Students learn to move past traditional images of futures based on unrealistic hopes and fears i.e., Utopia, Dystopia to move towards desirable futures from a design and business perspective. Ideate and sketch multiple design concepts for products and services within images of sustainable futures. Critically assess products and services within images of futures.", "relevance": "As corporations, governmental organizations, and non-government organizations face rapid change and uncertain times they are looking for new ways of thinking and acting. For designers trained to shape futures defined by change and uncertainty there are unprecedented opportunities. In this course, students explore the forces that drive change in the future (i.e., social, economic, political, environmental, technological), and learn to align innovation strategically with the trajectories of those forces on long-time horizons. The defining challenges of our times require that designers and business leaders to think and act in new ways. According to the 2018 United Nations Intergovernmental Panel on Climate Change (IPCC) 1.5oC report, humanity is faced with unprecedented challenges due to climate change. Namely to reduce carbon emissions by at least 45%-50% by year 2030. In the Introduction to Dexign Futures course students learn how to combine Design Thinking with Futures Thinking to create a new toolkit called Dexign Futures. Dexign is an experimental form of of design that aligns short term design of products and services with long term sustainability goals. The iDF course fills a much needed gap with skills and methods that are critically needed in our times to find product and service opportunities in a rapidly changing business environments characterized by volatility, uncertainty, complexity, and ambiguity (VUCA).", "learning_resources": "This course is based on 51.453 - 51.753 Dexign Futures an elective course open to non-design majors being taught in Fall 2019 during Mini 2. A selection of OLI modules and in class assignments from the 51.453 Dexign Futures I mini course. Existing OLI and Canvas materials.", "extra_time_commitment": "This course has 15 hours in classtime and 30 hours of homework outside of class."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "As corporations, governmental organizations, and nongovernment organizations face rapid change and uncertain times they are looking for new ways of thinking and acting. For designers trained to shape futures defined by change and uncertainty there are unprecedented opportunities. In this course, students explore the forces that drive change in the future i.e., social, economic, political, environmental, technological, and learn to align innovation strategically with the trajectories of those forces on longtime horizons. In the Introduction to Dexign Futures course students learn how to combine Design Thinking with Futures Thinking to create a new toolkit called Dexign Futures. Dexign is an experimental form of of design that aligns short term design of products and services with long term sustainability goals. The iDF course fills a much needed gap with skills and methods that are critically needed in our times to find product and service opportunities in a rapidly changing business environments characterized by volatility, uncertainty, complexity, and ambiguity VUCA.", "short_name": "INTRO DEXIGN FUTURES", "co_reqs": [], "instructors": [{"username": "pgs", "first_name": "Peter", "last_name": "Scupelli", "tags": [], "hours_per_week": 0, "id": 1571, "semesters_taught": [{"semester": 2, "year": 2021}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Introduction to DeXign Futures", "base_name": "Introduction to DeXign Futures", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "sustainability/environment", "id": 16}]}