{"code": "51-275", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2020}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Design Thinking is a powerful process for expanding creative potential and driving innovation. Topics in this 3 unit micro-course include: understanding users more deeply; mapping wicked problems; unlocking creative potential; advanced ideation techniques; prototyping tricks and tools; pitching disruptive ideas; explaining and, thinking in systems.", "prerequisite_knowledge": null, "assessment_structure": "There are two assessed projects in this micro-course. Grades from both are aggregated, factoring-in their respective percentage weightings, to establish an overall grade for the micro-course.", "goals": "On completion of this microcourse, students will be able to DISCUSS the history and theory of Design Thinking as a multidisciplinary approach to problemsolving SYNTHESIZE differing viewpoints on Design Thinking, and critically evaluate their pros and cons POSITION yourself within the Design Thinking debate, and develop a personal viewpoint MODEL your own Design Thinking approach, and teach it to others so they may benefit from it ARTICULATE how your own discipline relates to Design Thinking, and how this connection adds value", "relevance": "Design is the process of turning existing situations into preferred ones. Design Thinking, therefore, accelerates this change-making process through a powerful repertoire of creative tools, innovative methods, and designerly tactics. This dynamic micro-course introduces the theory and practice of Design Thinking to a diverse audience of multidisciplinary students--from Business and Administration to Computer Science and Information Systems. Through inspiring lectures, theoretical readings, and practical design challenges, students learn to harness the power of Design Thinking, and use it as an essential tool for social, environmental and economic transformation.", "learning_resources": "Provided by instructor", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "Design is the process of turning existing situations into preferred ones. Design Thinking, therefore, accelerates this changemaking process through a powerful repertoire of creative tools, innovative methods, and designerly tactics. This dynamic microcourse introduces the theory and practice of Design Thinking to a diverse audience of multidisciplinary studentsfrom Business and Administration to Computer Science and Information Systems. Through inspiring lectures, theoretical readings, and practical design challenges, students learn to harness the power of Design Thinking, and use it as an essential tool for social, environmental and economic transformation.", "short_name": "DESIGN THINKING", "co_reqs": [], "instructors": [{"username": "jchapma1", "first_name": "Jonathan", "last_name": "Chapman", "tags": [], "hours_per_week": 0, "id": 948, "semesters_taught": [{"semester": 1, "year": 2020}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Design Thinking", "base_name": "Design Thinking", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "for non-majors", "id": 6}]}