{"code": "51-280", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2021}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This micro-course introduces students to the following design topics: the unsustainable nature of throwaway goods; why people discard products that still work; methods for designing products that last; design tools for service, upgrade, and repair; the business case for design that lasts; and, sustainability leadership by design.", "prerequisite_knowledge": null, "assessment_structure": "The coursework requirement is to produce a Design Pitch¿a ten-page illustrated proposal for a product that lasts, supported by a business case that supports it. Assessment is in two weighted sections: 1) interim assessment of work-in-progress worth 40% of the final mark; and, 2) final assessment of the Design Pitch document worth 60% of the final mark.", "goals": "The core learning goals for this course are to develop theoretical understanding of why we throwaway products that still work skill in designing products and services that last grasp the principles of designing for a circular economy capability in transitioning consumers from cultures of ownership to usership innovative business models to support longerlasting products and, drive to challenge the status quo and lead sustainable change. Throughout the course, students experience an array of theoretical insights, practical case studies, sustainable design tactics, and emerging business insights. Together, these new skills empower individuals to deepen the social, ecological, and economic purpose of their work.The core learning goals for this course are to develop theoretical understanding of why we throwaway products that still work skill in designing products and services that last grasp the principles of designing for a circular economy capability in transitioning consumers from cultures of ownership to usership innovative business models to support longerlasting products drive to challenge the status quo and lead sustainable change", "relevance": "Industry is undergoing a period of massive reinvention as it transitions toward more sustainable processes and products. With this comes a push to become less wasteful; producing more value for customers with less material consumption. This is where design provides a powerful tool to leverage sustainable change.\nIndustry is undergoing a period of massive reinvention as it transitions toward more sustainable processes and products. With this comes a push to become less wasteful; producing more value for customers with less material consumption. This is where design provides a powerful tool to leverage sustainable change.", "learning_resources": "Professor Chapman's new book will be used as the primary learning resource for this micro-course: \"Meaningful Stuff: Design that Lasts\" (forthcoming, MIT Press, 2020). In addition, students will have access to an inspirational collection of design-related videos, podcasts, websites, and articles.", "extra_time_commitment": "Students should commit an additional 2 hours per week outside of scheduled class time."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "We live in a throwaway society, and this has truly devastating ecological consequences. Never before have we owned so much, wanted so much, and wasted so much. Yet, simply having more stuff stopped making people happier decades agowe need an economy of better, not more. This microcourse invites students from different disciplines to experience the power of design in shaping a sustainable future. In particular, we will explore designs unique capacity to enhance material efficiency, create lasting value, and boost competitive advantage. Throughout the course, students experience an array of theoretical insights, practical case studies, sustainable design tactics, and emerging business insights. Together, these new skills empower individuals to deepen the social, ecological, and economic purpose of their work.", "short_name": "DESIGN THAT LASTS", "co_reqs": [], "instructors": [{"username": "jchapma1", "first_name": "Jonathan", "last_name": "Chapman", "tags": [], "hours_per_week": 0, "id": 948, "semesters_taught": [{"semester": 2, "year": 2021}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Design that Lasts", "base_name": "Design that Lasts", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "service learning", "id": 15}, {"type": "attribute", "name": "sustainability/environment", "id": 16}]}