{"code": "51-218", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2021}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Using sketching and visualization tools to explore, examine, and explain concepts that are often complex and abstract, and= propose design intervention ideas", "prerequisite_knowledge": null, "assessment_structure": "A rubric that evaluates students' design process, work, and participation throughout the course will be given to students. It will be used to guide and assess their learning and serve as basis for grading. Students will demonstrate their learning through their involvement in class activities, the writing of individual and team blog and web posts, presentations to the class, and self- and peer-assessments. The= assessment rubric will include a review of students': ¿ = design process: breadth and depth of ideas explored and generated, clarity = and consistency of progress over time shown through sketches and notes, evaluation of ideas and use of discoveries to inform steps taken ¿ work: quality of work generated in addressing the challenges at hand, craftsmanship of napkin sketches, clarity of communication shown in visual and verbal forms, illustration of grasp of key course concepts ¿ participation and attitude: clarity in the articulation of ideas, offering of constructive criticism to peers, appropriateness and value of contributions to= critiques and discussions, ability to work effectively with peers, attitude and commitment towards those involved in the course.", "goals": "In this course, students will analyze a source of information ex. news media for several days to become familiar with the information provided, how the source works, and what it aims t o achieve review provided readings to deepen personal understanding of the concepts presented and discussed record discoveries as notes, sketches, lists, photos, etc. to describe individual perceptio ns of the information sources structure, form, and content sketch a mental model of the information source studied to learn and convey important facets of discoveries made brainstorm a design intervention to be integrated into daily routines to help people become better informed when reading information convey your discoveries and ideas in written and visual forms to illustrate the importance and value of being critically and actively seeking accurate information Collaborate with peers throughout the design process to reap the benefit of input from multiple perspectives and work towards a shared under standing.", "relevance": "As collaboration among people with expertise in diverse disciplines continues to rise along with their engagement in complex and often abstract challenges, it is essential for them to become well-versed and confident in capturing and communicating ideas via a graphic language that is easy to understand. For example, a team comprised of business,= information systems, and public policy experts may work together to propose ideas for communicating information to neighborhoods of people that stresses the importance of vaccinations and offers opportunities for receiving c= ritical inoculations in a manner that is accessible, inclusive, cost-effect= ive, and empowering. Such challenges are ABSTRACT in that they warrant deve= loping approaches that may not currently exist, and COMPLEX in that they include multiple considerations and steps that can quickly become unruly. As = a result, learning strategies for visualizing concepts that do not yet have= defined forms and bringing order to complex challenges¿both in ways that build consensus and shared understanding¿becomes critical in= a multitude of contemporary practices.", "learning_resources": "Davis, Meredith. Graphic Design Theory, Gonzales Crisp, Denise. Typography: Graphic Design in Context , Moyer, Don. Napkin Sketch Workbook", "extra_time_commitment": "10-12 hours outside of class"}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}, {"sem": 3, "type": "INFO", "name": "specific_sem"}], "units": 3.0, "website": null, "long_desc": "This course explores concept sketching as a too l that aids the analysis and synthesis of information that is complex and abstract and informs the visualization of relationships that are inherent but often missed in content to support shared understanding. Students will study a topic that meets these criteria, such as decoding and comparing the approaches that various news media organizations take in highlighting and framing specific storiesWhat appears most important How is information organized How does the visual form describe the organization s values Etc. Next, students will learn how to visually depict their discoveries. They will create a visual language that is easy for people to gr asp and sketch relationships among pieces of information, such as comparisons, hierarchies, and timelines, to aid personal and shared understanding. Working in teams, students will look for similarities among their notes, build a cohesive narrative about their discoveries, and collaboratively presen t their findings to the class as realtime sketches to help them practice w hat they are learning.  Next, participants will use the key points of their presentations to inform the development of a speculative intervention that aims to address challenges they uncovered when investigating their topic. In the case of the news  media study, students will strive to help people become better informed citizens by encouraging them to think critically about their news consumption  habits not just the words but the forms of content and urging them to make comparisons among information sources. As a final step, students will use a combination of sketches and text to describe the facets and merit of their concepts in the context of a webbased post to solidify their grasp of visualization strategies and the broad application of them in their adjacent courses and professional practice.", "short_name": "CONCEPT SKETCHING", "co_reqs": [], "instructors": [{"username": "slr", "first_name": "Stacie", "last_name": "Rohrbach", "tags": [], "hours_per_week": 0, "id": 318, "semesters_taught": [{"semester": 2, "year": 2021}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Concept Sketching: Quickly Aiding Understanding and Communication", "base_name": "Concept Sketching: Quickly Aiding Understanding and Communication", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "for non-majors", "id": 6}]}