{"code": "51-256", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Investigating historical and contemporary branding strategies, studying typography and mark making, creating graphic symbols, learning to use Adobe Illustrator, practicing iterative sketching, applying graphic symbols across a range of mediums", "prerequisite_knowledge": null, "assessment_structure": "A rubric that evaluates students' design process, work, and participation throughout the course will be given to students. It will be used to guide and assess their learning and serve as basis for grading. Students will demonstrate their learning through their involvement in class activities (leveraging breakout rooms when working remotely), the crafting of visual identities, the writing of individual blog posts, presentations to the class, and self- and peer-assessments. The assessment rubric will include a review of students': (1) design process: breadth and depth of ideas explored and generated, clarity and consistency of progress over time shown through sketches and notes, evaluation of ideas and use of discoveries to inform steps taken; (2) work: quality of work generated in addressing the challenges at hand, craftsmanship of napkin sketches, clarity of communication shown in visual and verbal forms, illustration of grasp of key course concepts; and (3) participation and attitude: clarity in the articulation of ideas, offering of constructive criticism to peers, appropriateness and value of contributions to critiques and discussions, ability to work effectively with peers, attitude and commitment towards those involved in the course.", "goals": "In this course, students will decode social and cultural patterns to determine how we perceive information and to learn how trends are formed, analyze typography and existing brands to learn how form influences our interpretation of words and symbols, create and compare visual marks to identify commonalities in our collective reading of visual forms, develop a visual vocabulary colors, shapes, typefaces, etc. for a brand to define a set of visual attributes that align to a specific serviceproduct, investigate the affordances and limitations of mediums to learn how context and technology informs the flexibility of brands, design a versatile visual identity to study the cohesion of brands in various contexts, sizes, and mediums", "relevance": "This course is highly relevant to students who want to investigate how people read visual brands and typography, engage in an iterative design process, creating engaging visual identities, make identities that are flexible and sustain their effectiveness over time, learn fundamental sketching and Adobe Illustrator skills, collaborate with peers, and have fun creating and discussing visual identities", "learning_resources": "The course will leverage the course management tools available in canvas to share readings, class exercises, and lecture slides with students to explain plans for class sessions and reinforce course concepts. The course will also connect students to medium.com, which is a blogging tool that helps students record and reflect on their design steps through text and images. Students will need printer paper and sharpie markers. The course will also coordinate students' design activities through online tools (Miro, google sheets, google docs, and Figma). Students will need to have Adobe Illustrator on their computers.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "In this course, students and I will delve into investigating social and cultural patternsboth historical and contemporarywhich guide effective approaches to branding products and services. For example, what helps people feel happy, accomplished, confident What do they wear What do they eat Where do they gather What do they do for enjoyment What do they value Students will work to align their discoveries to the graphic forms, colors, typography, and taglines that they create as part of a comprehensive branding strategy, which they will base on a product or service of their own choosing. Students will achieve these goals by engaging in a creative process where they will sketch, iterate, test, and refine graphic symbols and typography using conventional paper and pencils as well as Adobe Illustrator. Throughout the course, well also discuss communication trends and the role technology plays in shaping how and where brands appear in our everyday lives. Based on what they learn, students will propose various forms that their graphic symbols may take and brainstorm contexts in which they may appear. For example, how might their concepts appear in motion in a video viewed on a phone, or on the side of a food truck Through this process students will explore the affordances and limitations of various mediums and contexts and test the flexibility of the branding systems the create.", "short_name": "DES: PROD&SERV IDENT", "co_reqs": [], "instructors": [{"username": "slr", "first_name": "Stacie", "last_name": "Rohrbach", "tags": [], "hours_per_week": 0, "id": 318, "semesters_taught": [{"semester": 2, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Design, Brands, and Futures: Designing Product and Service Identities", "base_name": "Design, Brands, and Futures: Designing Product and Service Identities", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "maker", "id": 12}]}