{"code": "51-258", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2021}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Application of various design thinking, research, and making methods for human-centered understanding, collaboration, and = innovation.", "prerequisite_knowledge": null, "assessment_structure": "Essay questions in relation to reading assignments are evaluated on the use of examples from the text and understanding of= the overall author's main concepts. Assignments are graded on completeness relative to the problem/s developed by the student. Evidence of first= -person research should be represented as context-specific output and as pa= rt of their respective solutions. Team projects will be given a common= grade in relation to meeting agreed-upon goals and the option to peer evaluate each other's performance.", "goals": "Understand and apply a metalevel design process and design thinking strategies. Understand and apply design activities such as behavioral research, analysis, concept modeling, visualization methods, 2D sketching, 3D prototyping, and the value of public presentation and critique. All of these skills and methods allow team members to mutually understand and generatively build ideas and solutions in relation to a given challenge.", "relevance": "All types of organizations and businesses are practicing various design processes and methods to work more creatively. If = employed correctly and consistently, multiple levels of innovation occur to enable incremental, adjacent, and paradigm-shifting products, systems= , and services. But this occurs when team members are able to work together= and can harness each individual's unique skills, knowledge, and insights. Enroll in this course if you wish to learn first-hand the types of design thinking, skills, and experiences by actively working through a studio-= based diverging and converging design process.", "learning_resources": "Online reading materials. Lecture slide decks. = Example diagrams, mappings, project examples, PDF instructions, images, videos, and other media. Selected case study/chapter readings (Kolko; Madsbjer= g, Ramussen). Purchase of stock materials and tools may be necessary (avail= able at Jarir Bookstore).", "extra_time_commitment": "Some team coordination for research and meeting times outside of class. Possibly 4-8 hours outside of class."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "This blended lecture and generative projectbased microcourse is an interactive learning experience that uses prior case  studies, stories, and examples for thinking, working, and creating more innovative solutions by having students practice the double diamond design process. To accomplish this, we hope to transport you to see, think, and make  as a designer would interact with the world. Use various tangible methods a nd processes in a collaborative manner that will help your own ability to perceive and convert challenging situations into opportunities.", "short_name": "DES FOR COLLAB INNOV", "co_reqs": [], "instructors": [{"username": "wcchung", "first_name": "Wayne", "last_name": "Chung", "tags": [], "hours_per_week": 0, "id": 982, "semesters_taught": [{"semester": 2, "year": 2021}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Applied Design Methods for Collaborative Innovation.", "base_name": "Applied Design Methods for Collaborative Innovation.", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "maker", "id": 12}, {"type": "attribute", "name": "research", "id": 14}]}