{"code": "51-238", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2021}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "communication design, inclusive design, health literacy, information design, design research", "prerequisite_knowledge": "Course will use Figma and Adobe Suites. Some working knowledge is helpful.", "assessment_structure": "The following descriptions are meant to help you interpret your grades. You will be evaluated on several criteria: 25% of the grade is based on professionalism, individual and group contribution, participation, and input during class critiques; 25% of your grade will be based on your process and research; 50% of your grade will be based on your final work. You will receive feedback at the end of the course in the form of written feedback. You will also be required to hand in a well-organized process book.", "goals": "Students will Use communication skills to visualize and make more accessible abstract health information Show evidence of understanding of the inclusive design process. Apply basic tenants of health literacy for readability and accessibility Gain perspectives through a humancentered design process on health disparities and inequities impacting Gulf countries, specifically stakeholders living in Qatar Learn to synthesize, analyze, and organize information gathered To gain an understanding of relational typographic systems and affordances To develop an ability to generate ideas and concepts through brainstorming and sketching. To develop skills in articulating and documenting design concepts.", "relevance": "Through various lectures, group exercises, directed working sessions, remote interviews with subject matter experts, readings, and case studies, students will undergo an intensive, three-phased learning process: research and ideation, designing and testing, and development of final design solution.", "learning_resources": "Will provide reading, case-studies and slides.", "extra_time_commitment": "6 hours of additional work outside of class each week"}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "Health literacy refers to how well a person can get the health information and services they need and understand them. Lack of health literacy relates directly to how often a patient speaks with a medical professional, access health information, follow medication dosage instructions, interpret health charts, make informed health decisions, and use medical tools for personal or family health care. Without these necessary skills, low health literate individuals face potential, serious risks related to medication errors, navigation challenges, and chronic condition management.  Students will learn basic communication and information design skills during this course so they can successfully create a communication design system that aids low health literate individuals at risk for chronic disease. By the end of the course, students will have designed, tested, and produced an effective health communications system that informs, motivates, and inspires people to make informed health decisions.", "short_name": "DES HEALTH COMMUN", "co_reqs": [], "instructors": [{"username": "kh", "first_name": "Kristin", "last_name": "Hughes", "tags": [], "hours_per_week": 0, "id": 1145, "semesters_taught": [{"semester": 2, "year": 2021}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Learning to Design Effective Health Communications and Services", "base_name": "Learning to Design Effective Health Communications and Services", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "research", "id": 14}]}