{"code": "51-217", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2020}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "photography, narrative, storytelling, aesthetics, contemporary trends in photography, visual hierarchy, composition, how to deconstruct image meaning, construction of photographic meaning, an understanding of color and how color delivers content, quality of light, how to output well crafted photographs, and proper digital photographic workflow.", "prerequisite_knowledge": null, "assessment_structure": "completion of final project.", "goals": "This micro will be a creative photography class its goal is to help guide the student in expressing their views of the world. In the end students will be better at making effective photographs. Along the way, they will learn how to deconstruct image narrative, meaning, and aesthetic choices. They will be guided in the construction of photographic narrative, meaning, and aesthetics. They will learn how to embed narrative in their own pictures. The aim of this class will be to make the student a stronger creator of images, as well as a betterinformed consumer of photographs and the subconscious things that are often coded into images.", "relevance": "We are all consumers and creators of photographic images. This class will help guide students in the creation of more effective images that are embedded with intended meaning. What stories do you want to tell, and how do you tell them? We will cover aesthetics, visual hierarchy, composition, narrative, and storytelling, as well as cover Adobe Photoshop. This class will make you a stronger creator of images as well as a better-informed consumer of photographs and the subconscious things that are often coded into photographs.", "learning_resources": "Provided by instructor", "extra_time_commitment": "Class time as well as a few hours of photographing and PhotoShopping images on your own. Estimated 6-8 hours outside of class."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}, {"sem": 3, "type": "INFO", "name": "specific_sem"}], "units": 3.0, "website": null, "long_desc": "This micro will be a creative photography class. In the end students will be better at making effective photographs. Along the way, they will learn how to deconstruct image narrative, meaning, and aesthetic choices, and be guided in the construction of photographic narrative, meaning, and aesthetics. Students will move from looking to seeing. They will learn how to embed narrative in their own pictures.   In addition, students will play with how photographers often perpetuate ideas. We will use image sequencing, editing, inclusion, and omission to build narrative around place. Well travel to a neighborhood and create a mass of photographs this could be as close as Education City or a slightly further location like Souq Waqif or Msheireb, or Katara. We will figure out what location works best forwith the people enrolled in the class. Once the set of images are created, participants will play with their order to tell multiple different stories based on given prompts for example, euphoric, sinister, joyful. In shifting time, space, characters, and how they play their parts, the photographers will tease out how their deliberate choices can either translate or trick, record or revise what was truly there.", "short_name": "PHOTO: IMPLIED NARR", "co_reqs": [], "instructors": [{"username": "dylanv", "first_name": "Dylan", "last_name": "Vitone", "tags": [], "hours_per_week": 0, "id": 1337, "semesters_taught": [{"semester": 1, "year": 2020}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Photography & the Implied Narrative", "base_name": "Photography & the Implied Narrative", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "for non-majors", "id": 6}]}