{"code": "66-181", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Through the global, interdisciplinary movements of posthumanism and transhumanism,\nthis Grand Challenge course explores humanity&#39;s entanglement with tools, specifically\nthose technologies that augment our bodies and existence in a way that is beyond what\nwe currently qualify as human. These movements grapple with the positionality,\nmediation, and shrinking agency of humans within larger systems of technology and\nknowledge (posthumanism), and question who we are, what we are becoming, and,\nmost controversially, where we are going (transhumanism). These movements see\nthese ongoing and upcoming changes as creating problems that humans are not yet\nprepared to understand.", "prerequisite_knowledge": null, "assessment_structure": "Students in this course will be assessed through various low-stakes assignments, a collaborative in-class presentation, an individual analysis paper, and a collaborative case study final project.", "goals": "Characterize the challenges associated with the definition of human, especially as they relate to augmentative technologies and systems nuance the dynamic relationship of technology to humans using post and transhumanism as an interdisciplinary basis for inquiry. Apply theories from both cultural studies and rhetoric to the definitional debate around human across fields of science and technology. Characterize the strengths and limitations of the post and transhumanist movements.Recognize disciplinary boundary demarcations, gatekeeping, and collaborations within the interdisciplinary challenges comprising post and transhumanism.Apply course theories to generate a case study analysis that integrates and contributes to discourse on the post and transhumanist challenge.Participate in constructive dialogue to support both the process and product of the collaboration.Shape teams and navigate collaborations in light of individual differences and interpersonal dynamics, responding productively to emerging conflicts.Engage a team to set, monitor, and adjust goals and strategies as neededResponsibly complete delegated tasks with quality and timeliness, using relevant tools and resources.", "relevance": "This course, a Dietrich College general education requirement, enables students to grapple with complex global issues through a multidisciplinary lens and through collaborative practice. This specific seminar section grapples with the post- and transhumanist movements as they seek to better understand humanity within global systems of augmentation, technology, and knowledge.", "learning_resources": "Students will have access to a variety of academic and public readings via Canvas, as well as several films, podcasts, case examples, and documentaries", "extra_time_commitment": "Students will attend one film (among several options) offered by CMU-Q's film club. Date and times will be flexible."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "In their firm desire to perfect the new Constitution, which defined and limited the powers and roles of their new government, the founding fathers insisted on explicit statements that would protect the rights of the new nations citizens.   Indeed, the protection of these essential rights in many ways drove and defined their successful rebellion from Britain.  This impulse resulted in ten amendments to the Constitution, which we have come to know as the Bill of Rights.   The very first and arguably considered at the time as the most essential of these was the First Amendment, which we sometimes call the free speech amendment to the Constitution.  This amendment guarantees every U.S. citizen five freedoms freedom of religion, speech, press, peaceable assembly, and the freedom to petition the government for redress of grievances.  This course examines the historical and philosophical roots of this key constitutional amendment, how it has been fleshed out and defined over time through case law, and the bases of some more recent critics of this amendments and current interpretations.", "short_name": "GRAND CHALLENGE", "co_reqs": [], "instructors": [{"username": "kadreher", "first_name": "Kira", "last_name": "Dreher", "tags": [], "hours_per_week": 0, "id": 4135, "semesters_taught": [{"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}], "photo_url": null}, {"username": "jsquires", "first_name": "Jeffrey", "last_name": "Squires", "tags": [], "hours_per_week": 0, "id": 4134, "semesters_taught": [{"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Grand Challenge Seminar", "base_name": "Grand Challenge Seminar", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "global", "id": 7}, {"type": "attribute", "name": "interdisciplinary", "id": 10}, {"type": "attribute", "name": "research", "id": 14}, {"type": "attribute", "name": "team project", "id": 17}]}