{"code": "67-102", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2016}, {"semester": 1, "year": 2017}, {"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Topics to be covered include: (i) introductory concepts of information systems (data vs information, strategic value of information, types of information systems, networking & information security); (ii) innovation and creativity; (iii) professional development; and (iv) web development with HTML, CSS & JavaScript.", "prerequisite_knowledge": null, "assessment_structure": "Regular inclass exercises and short quizzes, homeworks, one midterm exam, one case study development exercise, a term-long project involving the application of an emerging technology to an organizational context, development of a concept video and a group presentation, web development lab exercises and takehomes, and development of an individual professional website.", "goals": "The course provides a basic understanding of the topic of information systems and the various content areas under the discipline, fosters professional skills, emphasizes the importance of innovation, creativity, and teamwork, and helps students gain basic proficiency in web development. The overall objective is to provide a general background to subsequent IS courses the students will take as part of their disciplinary core.", "relevance": "The course is relevant to developing disciplinary skills and gaining foundational knowledge to IS freshmen.", "learning_resources": "\"REQUIRED TEXT BOOKS\n1) \"\"Information Systems for Business: An Experiential Approach\"\" by Belanger and Slyke, 2e.\n2) \"JavaScript and JQuery: Interactive Front-End Web Development\" 1st Edition by John Duckett.\n3) \"Beginning HTML and CSS\" by Rob Larson\n4) \"HTML and CSS: Design and Build Website\" by Jon Duckett\n\n\"", "extra_time_commitment": "None beyond the expected 9 hours per week involving attending classes, preparation for class or exam, homeworks and group project work."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "This course is an introduction to the world of Information Systems IS. It introduces the core concepts of IS and its importance in the modern world around us. The course provides a general overview on the implications of information systems on organizations, by describing what an information system is presenting some IS app. This course provides an introduction to the world of Information Systems IS. It introduces the core concepts of IS and its importance in the modern world around us.  The course provides a general overview of the implications of information systems to organizations, by describing what an information system is, presenting some IS applications, and discussing the implications of information systems on social and human aspects. The course also provides an initiation to essential information systems skills such as teamwork and project management. Classes will typically consist of lectures, guest speakers, labs with handson applications projects, and a semesterlong team project.  lications and discussing the implications of information systems on social and human aspects. The course also provides an initiation to essential information systems skills such as team work and project management.", "short_name": "CONCEPTS OF INFO SYS", "co_reqs": [], "instructors": [{"username": "dphelps", "first_name": "Daniel", "last_name": "Phelps", "tags": [], "hours_per_week": 0, "id": 176, "semesters_taught": [{"semester": 1, "year": 2015}, {"semester": 1, "year": 2016}], "photo_url": null}, {"username": "liginlal", "first_name": "Divakaran", "last_name": "Liginlal", "tags": [], "hours_per_week": 0, "id": 1033, "semesters_taught": [{"semester": 1, "year": 2016}, {"semester": 1, "year": 2017}, {"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}], "photo_url": null}, {"username": "caoun", "first_name": "Chadi", "last_name": "Aoun", "tags": [], "hours_per_week": 0, "id": 736, "semesters_taught": [{"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Concepts of Information Systems", "base_name": "Concepts of Information Systems", "skills": [{"id": 1189, "name": "Social Work", "slug": "social-work"}], "success": true, "attributes": []}