{"code": "67-220", "name": "Digital Accessibility - Ensuring Universal Access to the Information Society", "base_name": "Digital Accessibility - Ensuring Universal Access to the Information Society", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "DIGITL ACCESSIBILTY", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 1, "year": 2022}, {"semester": 1, "year": 2023}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [{"code": "67-315", "id": 1055, "name": "A Web For Everyone", "units": 9.0}], "equiv": [], "long_desc": "Digital accessibility addresses a users ability to easily access an electronic document, a website, or a computer application unhindered by visual, auditory, motor or cognitive impairments or temporal disabilities arising from age, illness etc. Students who takes this course will gain a deep understanding of the diverse problems faced by people with disabilities in their interactions in a digital space and how the use of assistive technologies help them surmount the related accessibility barriers CT1 and CT3. They will learn about inclusive design principles and how to author content with consideration of design decisions that impact digital accessibility. Besides gaining an understanding of usercentered design principles, the students will learn how to apply Web Content Accessibility Guidelines WCAG to design and develop a website CT2. To cap it, students will learn how to test, evaluate and report conformance of a website with usability principles and accessibility standards. CT3", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 1}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "catalog_levels": [], "skills": [], "attributes": [{"name": "communication & presentation", "id": 19, "type": "attribute"}, {"name": "collaboration & teamwork", "id": 21, "type": "attribute"}], "custom_fields": {"goals": "The overarching goal is to help students understand how to apply humancentered design principles and methods to the conception of meaningful digital experiences. More specifically, the student will independently research and understand how users with disabilities work with electronic documents or interact with websites and how assistive technologies help enhance their experience. The student will learn about Digital Content Authoring guidelines, Web Content Accessibility Guidelines WCAG and other standards and related regulations and employ qualitative and quantitative research methods to bring about insight and a focused direction in building accessible websites and testing for compliance. The student will also craft a final solution that meets the needs of a large base of users with differing cognitive and physical abilities, but at the same time is technically sound, aesthetically professional, and enjoyable to experience.", "key_topics": "Assistive technologies; inclusive design principles, content authoring; Web Content Accessibility Guidelines (WCAG); web development; accessibility audit.", "prerequisite_knowledge": "Basic understanding of computers and the Web and the use of common tools in authoring Word and pdf documents.", "assessment_structure": "Labs, quizzes and in class exercises will be an integral part of the classroom activity. Students will work in teams to analyze an organization's website for compliance with usability principles and WCAG guidelines. Besides their group project and homework assignments, the student will present readings related to the course topic. A midsemester and a final exam will complement all of the mentioned assessment activities.", "relevance": "With an ageing population and emerging regulations requiring organizational compliance with digital accessibility guidelines & standards, there is need for developing skilled professionals in this topic area. The course will bring together students from across multiple disciplines facilitating an understanding of human-centered design, development, and testing best practices to achieve the broad goal of digital accessibility.", "learning_resources": "Two textbooks are suggested and available for rent or purchase. Please refer to the syllabus for titles.", "extra_time_commitment": "One visit to a local public organization (such as a bank or a library) to understand the needs of disabled users and examine and report adequacy of existing solutions."}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}