{"code": "67-204", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2020}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": true, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Topics to be covered include (i) the basic building blocks - cryptography, distributed ledger, and consensus mechanism; (ii) application use cases; (iii) practical implementations; (iv) governance; and (v) barriers to adoption.", "prerequisite_knowledge": "Open to students of all disciplines who have completed their freshman course requirements.", "assessment_structure": "1. Five inclass activities and five homework assignments worth total of 25% (formative assessment)\n2. Term project involving development of a comprehensive case study and presentation (50%). (formative and summative assessment)\n3. One end-of-term examination worth 25% (summative assessment)", "goals": "The course provides exposure to blockchain technology that may be termed as disruptive. It will help students gain an indepth understanding of the blockchain business model canvas applied to finance, energy, healthcare, real estate, supply chains, smart cities etc. Besides enabling students to understand the components of blockchain technology the course will provide a better insight into how to leverage blockchains for solving specific organizational problems.", "relevance": "Industry experts characterize blockchains as a breakthrough technology that has the same transformative power as that of the Internet. Blockchain has the potential to solve a variety of problems that benefit from a decentralized model of trust.", "learning_resources": "1. Required Textbook: Blockchain Basics: A Non-Technical Introduction in 25 Steps - 978-1484226032\n2. Other readings to be posted on Canvas", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}, {"sem": 3, "type": "INFO", "name": "specific_sem"}], "units": 3.0, "website": null, "long_desc": "Industry experts characterize blockchains as breakthrough technology that has the same transformative power as that of the Internet. Blockchains have the potential to solve a variety of problems that benefit from a decentralized model of trust. This course will help students understand fundamental blockchain concepts and develop industry case studies of blockchain applications to finance, insurance, energy, healthcare, real estate, etc.", "short_name": "BLOCKCHAINS IN IND", "co_reqs": [], "instructors": [{"username": "liginlal", "first_name": "Divakaran", "last_name": "Liginlal", "tags": [], "hours_per_week": 0, "id": 1033, "semesters_taught": [{"semester": 2, "year": 2020}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": true, "topic": null, "name": "Blockchains in Industry", "base_name": "Blockchains in Industry", "skills": [], "success": true, "attributes": []}