{"code": "67-250", "offered_in_campuses": [2, 1], "offerings": [{"semesters": [{"semester": 2, "year": 2019}, {"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}, {"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Topics include: enterprise systems and integration, gaining competitive advantage with IS, business process reengineering and change management, structured approaches to the creation of IS, project management, mobile computing and the digital economy, front-end web development, database design and modeling, information security and privacy, and the implications of IS for people and society.", "prerequisite_knowledge": "No prior knowledge required.", "assessment_structure": "Grades in this course are determined by student performance in several areas: homework and in-class assignments (15%); case study project (15%); web development labs and project (15%); database project (15%); team project (10%); and two in-class exams (30%).", "goals": "Course goals include 1 Identify the fundamental concepts of the IS discipline and the role of information in the enterprise. 2 Describe various types of IS within an enterprise view including the enterprise strategy, business, application, information, and infrastructure layers. 3 Discuss and analyze linkages between business organization processes and information strategy and how enterprises can achieve competitive advantage with strategic deployments of IS. 4 Understand different IS development methodologies and contexts in which they could be applied. 5 Analyze enterprise case studies that focus on issues of the strategic value of IS in order to evaluate costs, benefits, and risks of projects and determine the effectiveness of different applications or technologies in a particular context. 6 Recognize specialized IS topics and trends, and their potential to transform organizational and social structures. 7 Apply structured approaches and techniques to develop a frontend web prototype with emphasis on usability and accessibility. Design and develop a database and analyze information hierarchies for enterprise decisionmaking. 9 Demonstrate responsibilities and contributions in a teambased environment based upon prenegotiated group timelines, roles and deliverables.", "relevance": "This is the first required-core course for all Information Systems majors.", "learning_resources": "See the syllabus for a list of required readings (most readings are provided in class) An online textbook is required (priced under $50).", "extra_time_commitment": "The course deliverables are spread throughout the semester and does not require additional time commitments outside of the standard expectations for a 9-unit course load."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "Information systems IS are changing work practices, reshaping organizations, transforming cultures, and giving new meaning to the ways we see the world. This course is designed to help students understand the role of IS in the enterprise and the means by which these systems are created, utilized and maintained. The course will focus on enterprise information architecture including the components of enterprise strategy, business, application, information, and infrastructure layers. This course provides not only a framework for understanding information systems, but also a language to identify their dynamic complexities and interdependencies.", "short_name": "INFO SYSTEMS MILIEUX", "co_reqs": [], "instructors": [{"username": "caoun", "first_name": "Chadi", "last_name": "Aoun", "tags": [], "hours_per_week": 0, "id": 736, "semesters_taught": [{"semester": 2, "year": 2018}, {"semester": 2, "year": 2016}, {"semester": 2, "year": 2017}, {"semester": 1, "year": 2018}, {"semester": 2, "year": 2019}, {"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}, {"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "The Information Systems Milieux", "base_name": "The Information Systems Milieux", "skills": [{"id": 312, "name": "Mean", "slug": "mean"}], "success": true, "attributes": []}