{"code": "67-203", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2021}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Disability & assistive technologies; inclusive design principles, content authoring; accessibility check.", "prerequisite_knowledge": "No prerequisites.\nNote: A basic understanding of computers and the Web and the use of common tools in authoring Word and pdf documents is assumed.", "assessment_structure": "Formative: Lab exercise, quizzes and projects will be an integral part of the course. Students will work in teams to analyze an organization's website for compliance with inclusive design principles and WCAG guidelines .\nSummative: An end-of-term session where students will present their projects to their peers besides submitting an individual project report.", "goals": "The overarching goal is to help students understand how to apply universal design principles and methods to the conception of meaningful digital experiences. More specifically, the student will research and understand how users with disabilities work with electronic documents or interact with websites and how assistive technologies help enhance their experience. The student will learn about Digital Content Authoring guidelines, Web Content Accessibility Guidelines WCAG and other standards and employ qualitative and quantitative research methods to bring about insight and a focused direction in building accessible documents and checking for compliance. The student will also be able to craft solutions that meet the needs of a large base of users with differing cognitive and physical abilities, but at the same time is technically sound, aesthetically professional, and enjoyable to experience.", "relevance": "With an ageing population and emerging regulations requiring organizational compliance with digital accessibility guidelines & standards, there is a pressing need for developing skilled professionals in this topic area. The course will bring together students from across multiple disciplines facilitating an understanding of human-centered design, development, and testing best practices to achieve the broad goal of digital accessibility.", "learning_resources": "Textbook and readings, w3.org resources on accessibility, other online resources and laboratory facilities.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "This course provides an introduction to digital accessibility and why it serves to ensure universal participation in the information society. Students who take this course will gain a deep understanding of the diverse problems faced by people with disabilities in their interactions in a digital space and how the use of assistive technologies help them surmount the related accessibility barriers. They will learn about inclusive design principles and how to author content with consideration of design decisions that impact digital accessibility. Students will learn how to create electronic documents e.g., MS Word and pdf that can be easily accessed by people unhindered by a variety of disabilities such as visual or hearing impairments. They will also gain a highlevel understanding of Web Content Accessibility Guidelines WCAG and how to use basic tools and techniques to detect nonconformance of a website with accessibility standards.", "short_name": "DIGTL ACCESS FUNDMNT", "co_reqs": [], "instructors": [{"username": "liginlal", "first_name": "Divakaran", "last_name": "Liginlal", "tags": [], "hours_per_week": 0, "id": 1033, "semesters_taught": [{"semester": 1, "year": 2021}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Digital Accessibility Fundamentals", "base_name": "Digital Accessibility Fundamentals", "skills": [], "success": true, "attributes": []}