{"code": "67-315", "offered_in_campuses": [2, 1], "offerings": [{"semesters": [{"semester": 1, "year": 2017}, {"semester": 3, "year": 2019}, {"semester": 3, "year": 2020}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Requirements analysis, web development, universal design, prototyping, accessibility testing, usability testing.", "prerequisite_knowledge": "67240/67272 or instructor consent (students who demonstrate a sound background in HTML, CSS & JavaScript from any discipline may register for this course with instructor consent)", "assessment_structure": "Labs, quizzes and in class exercises will be an integral part of the classroom activity. A term-long individual project will involve analysis of an organization's website for compliance with WCAG guidelines, design and development of an improved prototype, and usability studies of the prototype. Besides their individual project and homework assignments, the student will present readings related to the course topic. Exams will complement all of the mentioned assessment activities.", "goals": "The overarching goal is to help students understand how to apply humancentered design principles and methods to the conception of meaningful digital experiences. More specifically, the student will independently research and understand how users with disabilities interact with websites and how assistive technologies help enhance their experience. The student will learn about Web Content Accessibility Guidelines WCAG and other standards and related regulations and employ qualitative and quantitative research methods to bring about insight and a focused direction in building accessible websites and testing for compliance. The student will also craft a final solution that meets the needs of a large base of users with differing cognitive and physical abilities, but at the same time is technically sound, aesthetically professional, and enjoyable to experience.", "relevance": "With an ageing population and emerging regulations requiring organizational compliance with web content accessibility guidelines & standards there is need for developing skilled professionals in this topic area. The course will bring together students from across multiple disciplines facilitating an understanding of human-centered design, development, and testing best practices to achieve the goal of an inclusive World Wide Web.", "learning_resources": "Textbooks and other online resources, software manuals and laboratory classroom.", "extra_time_commitment": "One visit to a local organization (such as the library) to understand the needs of disabled users. This course is open to all students."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This course provides a strong foundation in usercentered design and the engineering of web accessibility. The student will gain expertise in methodologies and toolkits for designing, prototyping, and evaluating a web site ensuring that the content is equally accessible to people with disabilities. Upon successful completion of this course, the student will be able to discuss standards and metrics for use in web development projects and be proficient in different stages of the project life cycle including data gathering methods, analysis techniques, requirements specifications, application of universal design principles, prototyping, and testing for usability and WCAG Web Content Accessibility Guidelines compliance. A termlong individual project will involve analysis of an organizations website for compliance with WCAG 2.1 guidelines, design and development of an improved prototype, and usability studies of the prototype", "short_name": "A WEB FOR EVERYONE", "co_reqs": [], "instructors": [{"username": "liginlal", "first_name": "Divakaran", "last_name": "Liginlal", "tags": [], "hours_per_week": 0, "id": 1033, "semesters_taught": [{"semester": 1, "year": 2017}, {"semester": 3, "year": 2019}, {"semester": 3, "year": 2020}], "photo_url": null}], "anti_reqs": [{"units": 9.0, "code": "67-317", "id": 1057, "name": "Mobile Web Development and Usability Testing"}, {"units": 9.0, "code": "67-220", "id": 11369, "name": "Digital Accessibility - Ensuring Universal Access to the Information Society"}], "prereqs": {"text": "(67-272 at least D) or (67-240 at least D)", "raw_pre_req": "", "req_obj": {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 12.0, "code": "67-272", "id": 7075, "name": "Application Design and Development"}}, "type_string": "", "type": "course", "id": 7075}], "id": 7076, "screen_name": "67-272"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 390084}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 390085}], "id": 334969, "screen_name": "uu0jg9h2z7dlew6"}, {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 9.0, "code": "67-240", "id": 2722, "name": "Mobile Web Design & Development"}}, "type_string": "", "type": "course", "id": 2722}], "id": 2723, "screen_name": "67-240"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 390086}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 390087}], "id": 334970, "screen_name": "s0965y9baq8fqr8"}], "constraints": [{"data": {"x": 1, "is_and": false}, "type": "anyxof", "id": 390083}], "id": 334968, "screen_name": "lr76ggim8lvx0hd"}}, "is_req_repeatable": false, "topic": null, "name": "A Web For Everyone", "base_name": "A Web For Everyone", "skills": [], "success": true, "attributes": []}