{"code": "67-316", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2017}, {"semester": 2, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 3, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Topics include: (i) how human computer interaction (HCI) relates to other aspects of software engineering; (ii) basic knowledge related to user interface design; (iii) features of interaction styles and devices and their relationship to user characteristics; (iv) development methodology and toolkit for prototyping/implementing user interfaces; and (v) exposure to a variety of interface devices such as AR, VR, brain interfaces, gesture devices, etc. and state of the art usability testing tools such as Morae, Tobii Eye-tracker and Face Reader.", "prerequisite_knowledge": "Open to all IS juniors and seniors.", "assessment_structure": "Graded activities will involve regular inclass work, home works, quizzes, two exams, two group projects, one or more field Studies & related case development, and reading presentations", "goals": "Upon successful completion of this course, students will be able toa Discuss the cognitive and affective background concepts that are important to HCI.b Discuss and assess various usercentered design models that may be used in an interface design project.c Discuss and develop standards and metrics that may be used in an interface design project.d Design and develop a user interface prototype and relate the design to the concepts presented in class.e Evaluate interfaces through data gathering methods, analysis techniques, and use these evaluations to improve the design.f Understand usability evaluation methods outlining the important interface design questions, a rationale for studying the questions, a methodology for testing, and suitable testing instruments.", "relevance": "Today, there are many disciplines that work in technology, design, and the interface between - software architecture, business development, product design and engineering, to name a few. Another such discipline is interaction design, which maintains a broad mind about what types of products it creates and how technology is a part of those products, all the while firmly holding human-centeredness as a core value. These skills and knowledge are invaluable to Information Systems students as they move into the real world and start building information systems for real world applications.", "learning_resources": "\"Required Textbooks -\n1. Technology as Experience - McCarthy & Wright\n2. User Experience Remastered - Chauncey Wilson\n3. Seductive Interaction Design - Stephen P. Anderson\n2. Other readings to be posted on Canvas\n\n\"", "extra_time_commitment": "One or more field studies outside regular class hours will involve visiting a local organization such as a museum or library to understand and dissect how technology could be deployed in a meaningful manner to enhance user experience."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This course emphasizes teambased activities to promote engaged learning and application of usercentered design and usability testing concepts.   Students who complete this course will have a good understanding of designing for user experience. The course emphasizes three themes and contexts for digital design and humancomputer interaction HCI designing for the web, designing for mobile use, and multimodal interactive design. Students will also be exposed to a variety of usability testing methods with stateoftheart tools such as Morae and Tobii eyetracker.", "short_name": "HMN CMPT INF DES TST", "co_reqs": [], "instructors": [{"username": "liginlal", "first_name": "Divakaran", "last_name": "Liginlal", "tags": [], "hours_per_week": 0, "id": 1033, "semesters_taught": [{"semester": 2, "year": 2018}, {"semester": 1, "year": 2015}, {"semester": 2, "year": 2017}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 3, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Human Computer Interface Design and Testing", "base_name": "Human Computer Interface Design and Testing", "skills": [{"id": 1351, "name": "Digital Arts", "slug": "digital-arts"}, {"id": 1537, "name": "Art Design", "slug": "art-design"}, {"id": 1539, "name": "Promotional Design", "slug": "promotional-design"}], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "maker", "id": 12}, {"type": "attribute", "name": "research", "id": 14}]}