{"code": "67-380", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This course is an introduction to information systems security for the IS student. The course will introduce the student to fundamental concepts in information system security, including operational issues, planning, and design. Topics will include confidentiality, integrity, and availability; risk; access controls and access control frameworks; security policies; authentication strategies and issues; auditing; using cryptography; security design issues; controlling information flows; malicious logic; and applying security principles", "prerequisite_knowledge": "Students should have a basic understanding of programming, data structures, and computer systems equivalent to that achieved through 15-122/15-121.", "assessment_structure": "Students will be assessed through a series of quizzes and labs.", "goals": "Students will understand fundamental information system security principles network services authentication and access control logging and log analysis attacks, threats, and vulnerabilities symmetric and asymmetric cryptography and risk and risk management related to information systems", "relevance": "Students will develop a broad understanding of how information systems are vulnerable to a variety of attacks and how those attacks impact users, organizations, and society. Certain topics related to security will be investigated in-depth depending on the interests of the students and faculty.", "learning_resources": "Students will have access to appropriate textbooks and related websites that support the key concepts in the course.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This course is an introduction to information systems security for the IS student.  The course will introduce the student to fundamental concepts in information system security, including operational issues, planning, and design.  Topics will include confidentiality, integrity, and availability risk access controls and access control frameworks security policies authentication strategies and issues auditing using cryptography security design issues controlling information flows malicious logic and applying security principles", "short_name": "INFORMATION SYS SEC", "co_reqs": [], "instructors": [{"username": "dphelps", "first_name": "Daniel", "last_name": "Phelps", "tags": [], "hours_per_week": 0, "id": 176, "semesters_taught": [{"semester": 2, "year": 2022}], "photo_url": null}], "anti_reqs": [{"units": 9.0, "code": "67-280", "id": 2196, "name": "Special Topics: Information System Security"}, {"units": 9.0, "code": "67-367", "id": 11561, "name": "Information Warfare"}], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Information Systems Security", "base_name": "Information Systems Security", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "lab component", "id": 11}]}