{"code": "67-343", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2021}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Mobile computing, application development, application design", "prerequisite_knowledge": "15-112", "assessment_structure": "Assessment will primarily be in two parts: Four weekly lab exercises where students build small apps, like the Stopwatch app as seen at https://67443.cmuis.net/labs/1. This example is from my popular mobile app class in iOS that I offer in Pittsburgh; labs would be similar, but adapted to the Flutter framework as it works for both Android and iOS. To assist students with the labs, I would schedule a two-hour block each week of extra office hours specifically focused on answering lab-related questions. We will also answer questions via the course Piazza. A course project completed by teams of 3-4 students where the teams build mobile apps that can be deployed to devices. The project will be broken into three sprints: Sprint 1: Ideation -- the teams purpose an idea for a mobile app and answer a series of questions related to the desirability, feasibility, and viability of the application. Sprint 2: User design -- the teams craft a series of wireframes that illustrate the key features of the app. In my other mobile class, we get a free educational license for Balsamiq and use that software package for all wireframes. Sprint 3: Building the app -- the teams put their plans into action and actually build out their mobile apps using Flutter/Dart. There are no labs in the last two weeks so students can fully concentrate on developing their app.", "goals": "After successfully completing this course, students should be able to do the following Use the Flutter framework and Dart programming to develop a variety of mobile applications for both Android and iOS devices Apply disciplined techniques for bringing an original idea from fuzzy concept, to prototype design, to feasibility testing, to the reality of potential application launch Be able to work with the asynchronous transfer of data between app and service and optimize processing to improve user experience Know and apply principles of usercentered design to the development of software for mobile platforms to ensure a rich and satisfactory user experience", "relevance": "The opportunities to offer innovative applications on the mobile computing platform continue to expand as the pace of mobile technology continues to grow unabated. Students in this course will learn key concepts in mobile application development using Google's Flutter toolkit and Dart programming language, which allows apps to be compiled for both the Android and iOS platforms.", "learning_resources": "I develop a pretty extensive set of lab instructions to guide students through mobile application development. I don't assign a textbook as most textbooks in this area quickly become out-of-date in a short time. For wireframing, Balsamiq has a great set of tutorial videos on their Youtube channel that we encourage students to watch as they are planning out their wireframes in Sprint 2. (We do talk about the wireframing process in class, but the tutorials cover more ground than we can in our limited time.) I would use Canvas and Piazza to handle asynchronous communications for the class.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "The opportunities to offer innovative applications on the mobile computing platform continue to expand as the pace of mobile technology continues to grow unabated. Students in this course will learn key concepts in mobile application development using Googles Flutter toolkit and Dart programming language, which allows apps to be compiled for both the Android and iOS platforms. In addition to course lectures, each student will complete a series of weekly lab exercises where they will build a variety of small mobile applications. Students will demonstrate course learning by working together in teams of 34 to create a new mobile application that meets a need that is unaddressed or poorly addressed in the current marketplace.", "short_name": "MOBILE APP DEV", "co_reqs": [], "instructors": [{"username": "lheimann", "first_name": "Larry", "last_name": "Heimann", "tags": [], "hours_per_week": 0, "id": 347, "semesters_taught": [{"semester": 1, "year": 2021}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "(15-112 at least D)", "raw_pre_req": "", "req_obj": {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 12.0, "code": "15-112", "id": 5637, "name": "Fundamentals of Programming and Computer Science"}}, "type_string": "", "type": "course", "id": 5637}], "id": 5638, "screen_name": "15-112"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 2731352}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 2731353}], "id": 2432863, "screen_name": "7n7gydjmmigx5fz"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 2731351}], "id": 2432862, "screen_name": "hd7zy21sqgn3gya"}}, "is_req_repeatable": false, "topic": null, "name": "Mobile Application Development in Flutter", "base_name": "Mobile Application Development in Flutter", "skills": [], "success": true, "attributes": []}