{"code": "67-329", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This course addresses current technology-based challenges that result from global systems. A significant first half of the course will cover global project management and involve realistic global projects with partnering universities. The second half of the course will address the challenges of global technology sourcing, and the impacts of technology on social and cultural topics. Upon successful completion of the course, students will have gained an understanding of the dimensions of global process and project management, global sourcing, and societal impacts of IT globalization.", "prerequisite_knowledge": null, "assessment_structure": "Grades in this course are determined by student performance in several areas: in-class quizzes and discussions (10%), two non-technical information systems projects with students at CMU-Pittsburgh and CMU-Qatar (50%), brief individual reports and team presentation on sourcing destinations (5%), serving as a seminar leader on a global systems topic (5%), and two in-class written exams (30%).", "goals": "Course goals include 1 Understand the challenges of global information systems and its impact on society, organizations and managerial practices. 2 Explain the basics of global project management and the global project lifecycle including project evaluation, initiation, planning, budgeting and implementation. 3 Discuss the benefits, disadvantages, opportunities and challenges of outsourcing from multiple stakeholder perspectives. 4 Analyze the impact of technology on contemporary sociocultural issues from multiple perspectives including people, groups, organizations and society at large. 5 Analyze key issues in crosscultural collaboration across cultural and temporal boundaries. 6 Gain an understanding of teambuilding and collaboration including working with global third parties.", "relevance": "This course is an Information Systems elective and a requirement for the Global Systems and Management minor. Students must have sophomore standing or higher.", "learning_resources": "See the syllabus for a list of required readings (readings are provided in class - a textbook is not required).", "extra_time_commitment": "The course deliverables are spread throughout the semester and does not require additional time commitments outside of the standard expectations for a 9-unit course load."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "Globalization and outsourcing of information systems IS is a mainstay of the business environment. The decision to outsource software services to providers in distant places has many risks and thus careful management of critical success factors is essential.  Likewise, products and services are being developed and delivered by teams of people in diverse locations working together. Management of these sourcing models and human capital relationships will be an increasingly important skill for students expecting to fully participate in the emerging IS marketplace of the 21st century.  This course introduces the effective fundamentals of global project management and the mechanics of sourcing arrangements including offshore outsourcing.  Students will also examine the effects of human diversity and crosscultural considerations in the creation, use and management of information systems.", "short_name": "CONTP THMS GLBL SYST", "co_reqs": [], "instructors": [{"username": "selmal", "first_name": "Selma", "last_name": "Limam Mansar", "tags": [], "hours_per_week": 0, "id": 1512, "semesters_taught": [{"semester": 1, "year": 2015}, {"semester": 2, "year": 2017}, {"semester": 1, "year": 2017}, {"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Contemporary Themes in Global Systems", "base_name": "Contemporary Themes in Global Systems", "skills": [{"id": 311, "name": "Expectation", "slug": "expectation"}], "success": true, "attributes": []}