{"code": "67-354", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The course introduces students to key topics relevant to Information Systems and Sustinability, including: Sustainability Dimensions (environmental, economic, social, and technological), Green Information Systems, and Smart Cities.", "prerequisite_knowledge": "67-250 is a prerequisite for this course unless otherwise approved by the instructor. Students need to have a basic understanding of information systems and its role in value creation and decision making. Students are also expected to have a basic understanding of web and database design, development, and modeling.", "assessment_structure": "Assessments in the course could typically include examinations, research report, reflections and synthesis, presentations, and Green IS innovation term project, as well as participation and contribution. Assessment adopt both, an individual perspective and a team perspective. Refer to course outline for specific assessment items.", "goals": "1. Understand and appreciate the complex sustainability challenges facing contemporary society.2. Understand and appreciate the pivotal roles IS plays in enabling sustainable action.3. Identify intraorganizational and community wide stakeholders and their role in sustainability.4. Critically evaluate environmental, societal, economic, and technological issues relating to sustainability and recommend courses of action to simultaneously address these issues.5. Evaluate evolving Green ITIS and smart practices for addressing sustainability challenges.6. Synthesize literature from academic and professional sources and propose robust and practical organizational sustainability arguments and policy initiatives.7. Articulate, design, develop and present effective multidimensional sustainability solutions. 8. Demonstrate responsibility and effective contribution in a teambased environment based upon prenegotiated group timelines, roles and deliverables.", "relevance": "The course is relevant to all IS students as it provides a broader perspective to social and organizational behavior and their impact on the world. It prepares students to evaluate sustainability challenges and developed innovative, strategic, practical, and rigorously supported IS based solutions.", "learning_resources": "The course incorporates a combination of online materials consisting of scholarly articles, governmental publication, and industry reports, as well as a textbook.", "extra_time_commitment": "This is a 9 unit course. On average, a student is expected to spend 9 hours a week on this course, consisting of 3 hours in class and 6 hours of self-study."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "Environmental, economic, and societal challenges are affecting the sustainability of many communities around the globe. Given its multidisciplinary foundation, IS presents an important potential for enabling adaptation and mitigation to these challenges. IS innovation could also play a prominent role in transforming unsustainable problem spaces into sustainable and resilient systems. What is needed is sustainability minded IS professionals to lead such transformation. This course introduces students future IS leaders to the fundamentals of sustainability in the 21st century. It includes topics on Green IS, Smart Cities, and the Information Economy. The course invites students to proactively reflect on sustainability issues and their effects on policy and leadership. In such reflection, students are encouraged to consider various casebased scenarios where they evaluate challenges to sustainability and developed innovative, strategic, practical, and rigorously supported IS based solutions.", "short_name": "SUSTAIN DIGITAL AGE", "co_reqs": [], "instructors": [{"username": "caoun", "first_name": "Chadi", "last_name": "Aoun", "tags": [], "hours_per_week": 0, "id": 736, "semesters_taught": [{"semester": 1, "year": 2015}, {"semester": 1, "year": 2016}, {"semester": 1, "year": 2017}, {"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "(67-250 at least D)", "raw_pre_req": "", "req_obj": {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 9.0, "code": "67-250", "id": 2248, "name": "The Information Systems Milieux"}}, "type_string": "", "type": "course", "id": 2248}], "id": 2249, "screen_name": "67-250"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 624511}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 624512}], "id": 534577, "screen_name": "hp7r0mfpi8punj7"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 624510}], "id": 534576, "screen_name": "n5fx82jlikb7zqb"}}, "is_req_repeatable": false, "topic": null, "name": "Sustainability in the Digital Age", "base_name": "Sustainability in the Digital Age", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "global", "id": 7}, {"type": "attribute", "name": "research", "id": 14}, {"type": "attribute", "name": "sustainability/environment", "id": 16}, {"type": "attribute", "name": "team project", "id": 17}]}