{"code": "67-357", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2018}, {"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 3, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Topics to be covered include (i) different types of analytics with examples; (ii) case studies of how analytics improves healthcare decision making; (iii) how to leverage analytics in healthcare quality improvement activities; (iv) how to develop an analytics strategy; (iii) how improved data quality and better data governance enhances the quality of healthcare; (v) creating a data-driven healthcare organization; and (vi) exemplars of applying big data to transform the healthcare industry;", "prerequisite_knowledge": "67-272: Application Design and Development", "assessment_structure": "This course will use a combination of reading assignments, case studies, group projects, three exams, inclass activities, and a series of lab activities in descriptive, predictive, and prescriptive analytics applied to healthcare .", "goals": "The primary goal of this course is to help students develop an analytics mindset in the healthcare context. The student will gain the ability to discuss the business value of analytics in healthcare, particularly in reducing costs and increasing quality, be able to work with healthcare data and understand the importance of data quality and data governance. They will learn to apply analytics tools to solve realworld problems in the healthcare domain with focus on descriptive, predictive, and prescriptive modeling and analysis. The student will gain understanding of the promises and perils of big data in healthcare and develop case studies on applying big data analytics to develop innovative solutions to emerging problems. Further, the student will understand the strategic implications in becoming an analytics organization. Be able to demonstrate responsibilities and contributions in a teambased environment based upon prenegotiated group timelines, roles and deliverables.", "relevance": "Healthcare analytics is gaining increasing attention as an effective means of quality improvement while reducing costs. This course provides students a solid foundation to applying analytics in the real world.", "learning_resources": "\"Required Texts:\nTB1- \"Healthcare Analytics: For Quality and Performance Improvement\" by Trevor L. Strome\nTB2 - \"R in Action\" by Robert Kabacoff\n\"", "extra_time_commitment": "None beyond the regular 9-unit hours of classwork, homework, preparation for exams, and team activities."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This course will help students gain a deep understanding of how healthcare analytics supports the reengineering of complex processes that drive return on investment and reduced medical costs and how the big data revolution is accelerating value and innovation in healthcare.  Topics to be covered include i how analytics improves healthcare decision making ii how to leverage analytics in healthcare quality improvement activities iii how to develop an analytics strategy iii how improved data quality and better data governance enhances the quality of healthcare v creating a datadriven healthcare organization and vi applying big data to transform the healthcare industry.  Besides gaining handson lab experience with analytics tools and technologies used in realworld healthcare organizations, students will also work on a group project to understand better the challenges and opportunities that big data analytics presents to healthcare and the life sciences.", "short_name": "HLTHCR ANLTC & BG DT", "co_reqs": [], "instructors": [{"username": "liginlal", "first_name": "Divakaran", "last_name": "Liginlal", "tags": [], "hours_per_week": 0, "id": 1033, "semesters_taught": [{"semester": 2, "year": 2018}, {"semester": 1, "year": 2015}, {"semester": 1, "year": 2016}, {"semester": 2, "year": 2017}, {"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 3, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "(36-200 at least D)", "raw_pre_req": "", "req_obj": {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 9.0, "code": "36-200", "id": 605, "name": "Reasoning with Data"}}, "type_string": "", "type": "course", "id": 605}], "id": 606, "screen_name": "36-200"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 4593171}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 4593172}], "id": 4016562, "screen_name": "p4ml8dnuvb8pdkb"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 4593170}], "id": 4016561, "screen_name": "gzwq68101ut61q2"}}, "is_req_repeatable": false, "topic": null, "name": "Healthcare Analytics and Big Data", "base_name": "Healthcare Analytics and Big Data", "skills": [{"id": 23, "name": "Medicine", "slug": "medicine"}, {"id": 1239, "name": "Group Management", "slug": "group-management"}], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "reading intensive", "id": 13}]}