{"code": "67-379", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2016}, {"semester": 1, "year": 2017}, {"semester": 2, "year": 2019}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The course introduces students to Geographical Information Systems. It uses a leading GIS software, ArcGIS from ESRI, and covers geospatial concepts, map design, GIS outputs, geodatabases, importing spatial and attribute data, geocoding, spatial data processing, and spatial analysis, among others.", "prerequisite_knowledge": "67-262 Database Design and Development is a prerequisite for this course unless otherwise approved by the instructor. Students need to have an understanding of database design, development, and modeling.", "assessment_structure": "Assessments in the course could typically include weekly GIS assignments, examinations, term project, and participation contributions.", "goals": "1. Formulate, design and demonstrate basic GIS applications in new problem domains.2. Integrate spatial thinking and GIS analysis into diverse decision contexts.3. Locate, retrieve and use appropriate data for GIS applications.4. Explain and apply concepts of coordinate systems and projections.5. Demonstrate basic proficiency in usage of industry leading GIS software tool, particularly, ESRIs ArcGIS.6. Communicate locationbased facts and recommendations effectively and efficiently.", "relevance": "The course is relevant to all IS students as it provides a broader perspective to data management, location analytics, data science, and data visualization through GIS.", "learning_resources": "There is a required textbook for this course as well as online resources and data.", "extra_time_commitment": "This is a 9 unit course. On average, a student is expected to spend 9 hours a week on this course, consisting of 2.5 hours in class and 6.5 hours of self-study."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This course is only offered at Carnegie Mellon in Qatar.  It is often said that a picture is worth a thousand words. This is particularly relevant to the current information age. We have an evergrowing wealth of data that could uncover great benefits if properly visualized. Much of the data which we generate and utilize hold geographical aspects. Demographic, health, education, environment, resource, crime, transport, economic, and development data could be effectively represented through Geographic Information Systems GIS. GIS provide the necessary tools to analyze and visualize data in order to uncover relationships that are not readily apparent. This holds a great potential for improved planning, communication, and decision making, leading to positive social and organizational implications. To harness such potential, this course introduces students to the basics of GIS through theoretical and practical sessions aimed at establishing fundamental GIS understanding and skills.", "short_name": "PRINCIPLES OF GIS", "co_reqs": [], "instructors": [{"username": "caoun", "first_name": "Chadi", "last_name": "Aoun", "tags": [], "hours_per_week": 0, "id": 736, "semesters_taught": [{"semester": 1, "year": 2016}, {"semester": 1, "year": 2017}, {"semester": 2, "year": 2019}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "(67-262 at least D)", "raw_pre_req": "", "req_obj": {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 9.0, "code": "67-262", "id": 2920, "name": "Database Design and Development"}}, "type_string": "", "type": "course", "id": 2920}], "id": 2921, "screen_name": "67-262"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 559318}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 559319}], "id": 482498, "screen_name": "cgd7ynrl1vq1ihi"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 559317}], "id": 482497, "screen_name": "bsh2a1uvaa2zrzo"}}, "is_req_repeatable": false, "topic": null, "name": "Principles of Geographic Information Systems", "base_name": "Principles of Geographic Information Systems", "skills": [], "success": true, "attributes": []}