{"code": "67-338", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Column, modular, hierarchical grids, typography and images within grid structures.", "prerequisite_knowledge": null, "assessment_structure": "Students are assessed through exercises, a project, homework, participation, and a test at the semester's mid-point.", "goals": "Develop a better understanding of visual composition through the grid, Learn the vocabulary of grid design in critique, Manipulate typographic variables to create intriguing and appropriate experience,Learn approaches to invention using image, text, typography, Create simple to complex grid structures, Develop skills in Adobe CC i.e. IllustratorPhotoshopAdobe XD for online grid systems.", "relevance": "Any student who wants or needs to work with grid systems to organize information for presentation or interaction in online environments will find this course relevant to their major and/or personal goals.", "learning_resources": "A textbook is required that will also be available in the library; additional readings and examples will be on Canvas.", "extra_time_commitment": "Design solutions sometimes come quickly and at other times require more thought. Overall, the expectations of a nine-unit class should suffice."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "Whether you create, oversee, or want practice solving problems through grid systems for websites, responsive applications, slide presentations, or data visualizations, this course provides the skills and perspective needed to communicate in grid environments a synthesis of content, structure, and interaction.   Grids emerged to address contentstructure needs linked to print production, leaving opportunities to fully explore how they can better help stakeholders in interactive environments. As we explore this space, specific skillsets will include   developing a better understanding of visual composition through the grid,   using the vocabulary of communication and information design in critique,   manipulating typographic variables to create readable documents,   learning approaches to invention using image, text,  typography,   creating simple to complex grid structures,   developing skills in Illustrator, Photoshop, and Adobe XD,   adapting simple prototypes to HTMLCSS through basic Bootstrap.", "short_name": "INFO & GRID DESIGN", "co_reqs": [], "instructors": [{"username": "zizan", "first_name": "Susan", "last_name": "Hagan", "tags": [], "hours_per_week": 0, "id": 175, "semesters_taught": [{"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Information & Grid Design", "base_name": "Information & Grid Design", "skills": [], "success": true, "attributes": []}