{"code": "67-415", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": true, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This course investigates the ethical and regulatory implications of technology by adopting a four-dimensional framework focused on Privacy, Accuracy, Property, and Accessibility (PAPA Framework. It examines legal rights and corresponding duties and responsibilities of stakeholders. The course delves into established and emergent themes including cyber law, surveillance, dis/misinformation, artificial intelligence, intellectual property, cybersecurity, and organizational policy. Its primary focus is on social, behavioral, and legal implications of technology, assessed from multiple perspectives pertaining to individuals, organisations and societies.", "prerequisite_knowledge": "Sophomores and above in any major, unless otherwise approved by the instructor.", "assessment_structure": "Assessments in this course could typically include class discussions, debates, research reports, presentations, assignments, homeworks, quizzes, case studies, and a term project. Assessments adopt an individual perspective and a team perspective. Refer to the course outline for specific details.", "goals": "1.Describe ethical theories and apply them to cyberspace.2.Explain multidimensional perspectives to regulation.3.Identify stakeholders across individual, organisational, and societal strata, along with their rights, impacts, duties, and responsibilities. 4.Assess risks presented by information systems and technologies, and their implications on Privacy, Accuracy, Property, and Accessibility.5.Articulate, synthesize, present, and defend ethical and regulatory recommendations grounded in legal, factual, and scientific evidence.6.Demonstrate responsibility and effective contribution in a teambased environment based upon prenegotiated group timelines, roles and deliverables.", "relevance": "The course is relevant to all students (future leaders) as it equips them with a core foundation for understanding ethics and regulation in cyberspace; a critical foundation for professionals in the digital age.", "learning_resources": "The learning resources primarly consit of texbooks, scholary articles, industry reports and case studies, as well as online materials.", "extra_time_commitment": "On average, a student is expected to spend 9 hours a week on this course, consisting of 2.5 hours in class and 6.5 hours of self-study."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This course investigates the ethical and regulatory implications of technology by adopting a fourdimensional framework focused on Privacy, Accuracy, Property, and Accessibility PAPA Framework. It examines legal rights and corresponding duties and responsibilities of stakeholders. The course delves into established and emergent themes including cyber law, surveillance, dismisinformation, artificial intelligence, intellectual property, cybersecurity, and organizational policy. Its primary focus is on social, behavioral, and legal implications of technology, assessed from multiple perspectives pertaining to individuals, organisations and societies.", "short_name": "CYBER ETHICS AND REG", "co_reqs": [], "instructors": [{"username": "caoun", "first_name": "Chadi", "last_name": "Aoun", "tags": [], "hours_per_week": 0, "id": 736, "semesters_taught": [{"semester": 1, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": true, "topic": null, "name": "Cyber Ethics and Regulation", "base_name": "Cyber Ethics and Regulation", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "ethics", "id": 5}, {"type": "attribute", "name": "global", "id": 7}, {"type": "attribute", "name": "reading intensive", "id": 13}, {"type": "attribute", "name": "research", "id": 14}, {"type": "attribute", "name": "team project", "id": 17}]}