{"code": "67-443", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 12.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This course provides students with the concepts and techniques to design and develop mobile applications, and to understand the design process for mobile applications. Students will learn some of the key concepts in mobile application.", "prerequisite_knowledge": "Programming skill as demonstrated in 67-272 or equivalent. Software team skills as demonstrated in 67-373 or equivalent.", "assessment_structure": "Grades in this course are determined by student performance in five areas: a course project (worth 35% total), intermediate sprint deliverables (worth 15% overall), one midterm examination (worth 25% overall), nine weekly labs beginning in week one (worth 18% total) and attendance, short in-class assignments, and quizzes (worth 7% total).", "goals": "At the end of this course, students should be able to Use the iOS andor Android frameworks to develop a variety of mobile applications students can choose their track and platformCreate innovative solutions to address realworld situations that meet user needs that have not yet been addressed by the marketApply disciplined techniques for bringing an original idea from fuzzy concept, to prototype design, to feasibility testing, to the reality of potential application launch Understand design patterns and other aspects of advanced software design and architecture Build test suites for mobile applications and apply principles of Test Driven Development TDD to mobile application development Know and apply principles of usercentered design to the development of software for mobile platforms to ensure a rich and satisfactory user experience Apply best practices in agile project management to make plans, organize projects, align resources, monitor obstacles to success and design strategies to overcome them, and achieve desired outcomes", "relevance": "This course is an elective course for seniors in information systems.", "learning_resources": "See syllabus for required and reference resources.", "extra_time_commitment": "Students should plan for occasional extra time commitment before key due dates. Careful planning and time management will reduce the need for extra time commitment."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 12.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}], "units": 12.0, "website": null, "long_desc": "This course provides students with the concepts and techniques to design and develop innovative mobile applications. Students will develop a series of smaller mobile applications in weekly lab sessions using either iOS or Android frameworks. In addition, student teams will build a larger mobile application, as part of a semesterlong project, that fills a demand not effectively met in the current market. In the process of developing these applications, students will gain a strong understanding of mobile application development, mobilecentered design, the process of creating and testing innovative application design, and larger principles of software engineering. In weekly labs, students can choose either the SwiftiOS or KotlinAndroid track to complete course work, but lectures will primarily use Swift to illustrate larger points of software architecture and engineering. This course is open only to seniors in the IS major who have completed 67373 or by special permission of the instructor.", "short_name": "MOBILE APP DEV", "co_reqs": [], "instructors": [{"username": "maazam", "first_name": "MOHAMMAD", "last_name": "AAZAM", "tags": [], "hours_per_week": 0, "id": 5607, "semesters_taught": [{"semester": 2, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "(67-272 at least D)", "raw_pre_req": "", "req_obj": {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 12.0, "code": "67-272", "id": 7075, "name": "Application Design and Development"}}, "is_hidden": false, "type_string": "", "type": "course", "id": 7075}], "id": 7076, "screen_name": "67-272"}], "constraints": [{"data": {"x": 1, "is_and": true}, "is_hidden": false, "type": "anyxof", "id": 5155080}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "is_hidden": false, "type_string": "Minimum grade of D", "type": "mingrade", "id": 5155081}], "id": 4390764, "screen_name": "jz80pnt4yyfkw1l"}], "constraints": [{"data": {"x": 1, "is_and": true}, "is_hidden": false, "type": "anyxof", "id": 5155079}], "id": 4390763, "screen_name": "y5iv8vfbaonpfs6"}}, "is_req_repeatable": false, "topic": null, "name": "Mobile Application Design and Development", "base_name": "Mobile Application Design and Development", "skills": [], "success": true, "attributes": []}