{"code": "67-404", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": true, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "In this course, we will dig into the blockchain technology. We will learn from the basic, single-purpose blockchain (such as for Bitcoin) to general purpose blockchain (which includes a range of use-cases). The course will cover a broad spectrum of blockchain technology, different consensus algorithms, its various real-world use-cases - with an eye on developing our own blockchain. We will also understand various challenges with this technology, and a case-study that covers implementation in Python. This would be an interactive course and the students are expected to share ideas and their thoughts.", "prerequisite_knowledge": "Basic understanding of Python programming, data communication, data storage, data security", "assessment_structure": "They key assessment criteria would be related to how sound the understanding is. The assessment would be mainly open-ended, with real-world use-cases and scenarios. Most of the assessment would be based on technical knowledge, including development. There would be quizzes, homeworks, and project(s).", "goals": "Theyll have a good idea of what overarching blockchain technology is what are its associated technologies, including its future pontetials. The students would be able to understand their individual roles if they are interested in this futuristic technology, rather domain.", "relevance": "Blockchain technology covers a wide range of multidisciplinary use-cases, and hence, this course would be quite relevant to the students generally regardless of their concentration or the pool of courses they have taken. The students will learn what this promising technology of blockchain is, what they need to understand currently if they are interested in this field and would like to find a career or further their knowledge.", "learning_resources": "Students are encouraged to find online resources.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "In this course, we will dig into the blockchain technology. We will learn from the basic, singlepurpose blockchain such as for Bitcoin to general purpose blockchain which includes a range of usecases. The course will cover a broad spectrum of blockchain technology, different consensus algorithms, its various realworld usecases  with an eye on developing our own blockchain. We will also understand various challenges with this technology, and a casestudy that covers implementation in Python. This would be an interactive course and the students are expected to share ideas and their thoughts.", "short_name": "BLOCKCHAIN APPLICAT", "co_reqs": [], "instructors": [{"username": "maazam", "first_name": "MOHAMMAD", "last_name": "AAZAM", "tags": [], "hours_per_week": 0, "id": 5607, "semesters_taught": [{"semester": 1, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": true, "topic": null, "name": "Blockchain Applications", "base_name": "Blockchain Applications", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "entrepreneurship", "id": 4}, {"type": "attribute", "name": "interdisciplinary", "id": 10}, {"type": "attribute", "name": "lab component", "id": 11}, {"type": "attribute", "name": "research", "id": 14}, {"type": "attribute", "name": "sustainability/environment", "id": 16}]}