{"code": "67-410", "offered_in_campuses": [2], "offerings": [{"semesters": [], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This course is designed as an introductory course in Critical Care Data Science, providing an introduction to the tools and techniques of data science, specifically focused on clinically relevant critical care. Electronic Medical Records; Common Data Models for Clinical Data; SQL Querying; Computational Phenotyping; Common Machine Learning Techniques (Supervised; Unsupervised; Reinforcement Learning); and Reporting Clinical Data Science Research.", "prerequisite_knowledge": "Students should have a basic understanding of programming, data structures, and computer systems equivalent to that achieved through 15-122/15-121", "assessment_structure": "Students will be assessed through a series of quizzes and labs", "goals": "Students will understand electronic medical record data models and specifications how to use common data models to increase accessibility of data from electronic medical record systems computational phenotyping how to query data models how to use common data science techniques in the clinical setting and how to report clinical data science research.", "relevance": "Students will develop an understanding of how information systems and data science techniques are applied in medical settings to support clinical decision making and to identify ways to improve patient care and outcomes.", "learning_resources": "Students will have access to appropriate textbooks and related websites that support the key concepts in the course.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This course is designed as an introductory course in Critical Care Data Science, providing an introduction to the tools and techniques of data science, specifically focused on clinically relevant critical care.  Electronic Medical Records Common Data Models for Clinical Data SQL Querying Computational Phenotyping Common Machine Learning Techniques Supervised Unsupervised Reinforcement Learning and Reporting Clinical Data Science Research.", "short_name": "CLINICAL DATA SCIENC", "co_reqs": [], "instructors": [], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Clinical Data Science", "base_name": "Clinical Data Science", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "lab component", "id": 11}, {"type": "attribute", "name": "research", "id": 14}]}