{"code": "70-104", "name": "Business Leadership Endeavor I", "base_name": "Business Leadership Endeavor I", "units": 3.0, "min_units": 3.0, "max_units": 3.0, "short_name": "BLE I", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 2, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "Business Leadership Endeavor BLE is a required 3mini course sequence 70104,70204,70304 offered to undergraduate business students only. BLE 70104 is the first mini of the BLE course sequence.  Each previous mini will serve as a prerequisite for the next in sequence. BLE introduces students to their leadership journey via four development frameworks student development, personal development, professional development, and community development. BLE 70104 will introduce students to the fundamental building blocks required for their development. Students will learn to develop and improve habits, sharpen personal and professional development skills, and develop meaningful networks. This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 1}, {"name": "specific_sem", "type": "INFO", "sem": 2}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "catalog_levels": [], "skills": [], "attributes": [{"name": "discussion intensive", "id": 2, "type": "attribute"}, {"name": "interdisciplinary", "id": 10, "type": "attribute"}, {"name": "service learning", "id": 15, "type": "attribute"}], "custom_fields": {"goals": "In this course, students will learn and apply the Big Five Fundamentals Creating Your Product, Etiquette and Habits, Relational vs. Transactional, Teaming, Networking for student success and professional development via class discussions, journal writing, final project and class exercises.", "key_topics": "student development, personal development, professional development, community development", "prerequisite_knowledge": "No prior knowledge required.", "assessment_structure": "Class participation, in- class exercises, self-reflection journal and individual project", "relevance": "The course is for incoming Tepper Business School majors. It will explore a variety of personal and professional skills essential for success in the classroom, at work, and in life.", "learning_resources": "Canvas site, readings, cases, short topic memos", "extra_time_commitment": "Project, self-reflection journal and meetings with mentors; this course is remote-only for Fall 2021 for ALL students"}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}