{"code": "70-100", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2015}, {"semester": 1, "year": 2016}, {"semester": 1, "year": 2017}, {"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Venture Capital and funding of business start up, Cost Analysis, Break Even and Sensitivity Analysis, Financial and Accounting Concepts, Decision Making Data Driven, Modern Marketing, Operations Management, Distribution and Logistics.", "prerequisite_knowledge": "Basic Statistics, Probability Distributions, Computation using Microsoft Excel", "assessment_structure": "4 Tests , Assignments and Cases, and Quizzes", "goals": "This course examines the fundamental issues in the development of and roll out of products and services globally. It provides a foundation for understanding the functional areas of business and how they contribute to management of a firm. Students use this foundation knowledge to analyze cases and complete projects in order to gain an understanding of some of the key issues affecting a wide range of the most important global industries. Firstyear students also can gain a better understanding the vast array of career possibilities available to those who study business.", "relevance": "This course will introduce you to the exciting world of business where several functional areas have to work together seamlessly to drive customer satisfaction. You will learn business terminology and principles of modern management control.", "learning_resources": "Lecture Slides, Problem Sets, Cases. Reading material on the Course Canvas Site. Students will have to purchase a text book", "extra_time_commitment": "Team meetings periodically throughout the semester"}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "The course is for nonTepper BA students and provides a comprehensive overview of business, including how enterprises determine goals, strategies and operational tactics in competitive markets and the increasingly global environment. It covers different types of businesses  entrepreneurial and corporate, industries, markets, and economies. Students learn about the role of business in society, the various functional areas that make business work, and how companies develop plans and processes to achieve their goals for customers, shareholders, and employees. The course has special emphasis on providing a broad overview of business to augment students major area of study for their professional development. Declared Tepper BA students are not eligible to enroll.This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.", "short_name": "GLOBAL BUSINESS", "co_reqs": [], "instructors": [{"username": "starling", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 2865, "semesters_taught": [{"semester": 1, "year": 2015}, {"semester": 1, "year": 2016}], "photo_url": null}, {"username": "miltonc", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 595, "semesters_taught": [{"semester": 1, "year": 2017}, {"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Global Business", "base_name": "Global Business", "skills": [{"id": 14, "name": "Business", "slug": "business"}, {"id": 1841, "name": "Economy", "slug": "economy"}], "success": true, "attributes": [{"type": "attribute", "name": "entrepreneurship", "id": 4}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "global", "id": 7}, {"type": "attribute", "name": "interdisciplinary", "id": 10}]}