{"code": "70-106", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Mathematics of Optimization; Economics; Organizational Behavior", "prerequisite_knowledge": null, "assessment_structure": "There will be a mix of assignments, in-class exercises, and cases done individually and in groups. There will also be a midterm and final exam. An important component of the assessment will require students to be actively engaged with the material to support everyone's learning both inside and outside of formal class. (The short version of that sentence is \\class participation.\")", "goals": "After completing the course, students will be able to identify and articulate issues in business. More importantly, students will be able to study and understand the issue from the three lenses of optimization, economics, and organizations.", "relevance": "The course is for the Tepper School's incoming Business majors. It provides both a foundation and perspective for the curriculum to follow.", "learning_resources": "The course material is eclectic and broad. So no one text book covers this material. We will use readings, cases, videos, and short topic memos.", "extra_time_commitment": "There may be one or two meetings outside regular class time where we can get all of us together at one time. The remote section is only available for students approved for remote study in Fall 2021."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "This course is only available for Business Majors. The focus on the class is on the three core lenses used to study and advance the science and practice of business. We will study the mathematics of optimization, economics, and the behavior in and of organizations. These are the foundations of the disciplines of finance, accounting, marketing, ..., that follow in the curriculum. Over the course of the semester, we will tackle complex multifaceted business problems. Think of examples like, bikeshare and the shareeconomy, international trade and supply chain, AI and the impact on work. For each case, we will work to apply the three lenses. A pillar for the semester is that business problems are not siloed in narrow disciplines, we must draw resources from disciplines across the entire university. The second pillar of our class is solving all problems  across all of society  requires your understanding of business science. This course may use thirdparty course material that is not available for individual purchase from the publisher.  If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.", "short_name": "BUSINESS SCI", "co_reqs": [], "instructors": [{"username": "mfarooqi", "first_name": "Muhammad", "last_name": "Farooqi", "tags": [], "hours_per_week": 0, "id": 1718, "semesters_taught": [{"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "photo_url": null}, {"username": "iadeinat", "first_name": "Iman", "last_name": "Adeinat", "tags": [], "hours_per_week": 0, "id": 4876, "semesters_taught": [{"semester": 1, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Business Science", "base_name": "Business Science", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "team project", "id": 17}]}