{"code": "70-246", "name": "Innovation & Entrepreneurial Mindset", "base_name": "Innovation & Entrepreneurial Mindset", "units": 6.0, "min_units": 6.0, "max_units": 6.0, "short_name": "ENTREP MINDSET", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 2, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "This course is designed to introduce students to the theory and frameworks used to develop and implement innovative solutions to societal and entrepreneurial problems.  The curriculum incorporates the latest on innovative behavioral traits and frameworks with a highly experiential format to expose undergraduate students to out of the box thinking.  For example, the instructor would use the lecture section of the class to explain the behavioral techniques that lead to innovative solutions based on the Innovators DNA by Clayton Christensen.  Teams of 36 students each would then examine a problem and be asked to generate 3 potential solutions and a proposed solution, using the techniques presented. Volunteers from the local Carnegie Mellon and entrepreneurial community will serve as mentors and judges, thereby providing a real world learning and networking experience.  Ultimately, the best solution will be selected, using a shark tank format.  While the selection of a winning solution will be fun for the class, the students will be graded on their having demonstrated the theory  techniques presented in class.  Each week will address a new and important topic related to the innovative  entrepreneurial mindset.  Weekly format will include one day of lecture and one day of application of the theory introduced in a fun and competitive format. This course may use thirdparty course material that is not available for individual purchase from the publisher. If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided. The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "catalog_levels": [], "skills": [], "attributes": [{"name": "diversity", "id": 3, "type": "attribute"}, {"name": "entrepreneurship", "id": 4, "type": "attribute"}, {"name": "for non-majors", "id": 6, "type": "attribute"}, {"name": "interdisciplinary", "id": 10, "type": "attribute"}, {"name": "team project", "id": 17, "type": "attribute"}], "custom_fields": {"goals": "The goal of this course is to expose students to what working in an innovation group or starting a new venture is like. Students will be exposed to many of the skills necessary to be successful in these environments with the goal of providing each student some clarity and insight into whether this is a path that they would like to take.", "key_topics": "Innovation, Entrepreneurship, Entrepreneurship, Start-ups, Social Entrepreneurship, Negotiating, Ethics, Customer Discovery, Sales, Pitching", "prerequisite_knowledge": "Students should be familiar with problem-solving within a good amount of uncertainty and ambiguity, and in working with teams of students with very diverse backgrounds.", "assessment_structure": "Approximately every week is a separate module consisting of one lecture presenting theory or frameworks on the theme of that week and a second experiential workshop typically organized in a competitive framework. Each module will be graded separately. There is no final exam.", "relevance": "This course is designed for students exploring the possibility of entering an applied innovation based profession in a larger company or getting involved in an entrepreneurial venture. Candidate students come from all disciplines from across the university including (but not limited to) engineering, business, computer science, drama, design, architecture, etc.", "learning_resources": "Case studies, web pages, in-class lecture materials", "extra_time_commitment": null}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}