{"code": "70-306", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2021}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Product Management, Customer Discovery, Business Models, Pricing, Product Development", "prerequisite_knowledge": "None, though the course will be most appropriate for BA, IS, and CS students", "assessment_structure": "Students will complete multiple graded written assignments such as case study analyses, product or industry assessments, and/or the development of a product roadmap. Depending on the number of students enrolled, there will also be a substantial subjective participation component and/or a final exam. Basically, if enrollment is small then I will treat the course as a seminar and work closely with each individual student as they complete their case studies and roadmap. If enrollment is larger (say, more than 15 students) I will have less time available to assess each individual student's mastery directly so I will hold a final exam to evaluate how well they have mastered the material.", "goals": "Students who complete this course will be able to Explain the role of the Product Manager in techdriven companies Structure productrelated decisions to account for the needs and constraints of a variety of stakeholders Use tools such as product roadmaps and basic financial proformas to structure their analyses and communicate their decisions Students who are interested in pursuing a career as a Product Manager will find this course to be a good launch point for identifying the skills that they will need to develop during their time at CMU and understanding how companies go about selecting people for Product Management roles.", "relevance": null, "learning_resources": "I will pull a selection of articles from a variety of sources into a coursepack. I may also use some trade books that are available in digital format.", "extra_time_commitment": "Students should plan to spend ~2 hours working outside of class for each hour spent in class"}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "Over the past decade or so, the role of the Product Manager has become increasingly important in technologydriven firms. The Product Manager is often considered The CEO of The Product, in that they have overall responsibility for shipping the right product, to the right set of customers, at the right price, through the right channels, in a way that generates value profit for the company and value for their customers. Its a challenging job, and one that requires a broad range of expertise.  This course introduces the primary decisions that a Product Manager needs to make, the tasks that they need to complete in order to make those decisions effectively, and the organizational dynamics that they need to be able to read and understand to drive their initiatives through to successful completion. In addition to understanding the milieu in which Product Managers operate, the course introduces tools and frameworks for evaluating alternatives and making effective productrelated decisions.", "short_name": "INTRO PROD MGT", "co_reqs": [], "instructors": [{"username": "rm74", "first_name": "Robert", "last_name": "Monroe", "tags": [], "hours_per_week": 0, "id": 237, "semesters_taught": [{"semester": 1, "year": 2021}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Introduction to Product Management", "base_name": "Introduction to Product Management", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "reading intensive", "id": 13}, {"type": "attribute", "name": "research", "id": 14}, {"type": "attribute", "name": "writing intensive", "id": 18}]}