{"code": "70-344", "name": "Internet Ethics", "base_name": "Internet Ethics", "units": 3.0, "min_units": 3.0, "max_units": 3.0, "short_name": "INTERNET ETHICS", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [2], "offerings": [{"campus_id": 2, "semesters": [{"semester": 2, "year": 2023}], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "The use and abuse of social media and other online platforms has become a major global issue. This course provides a conceptual framework for analyzing some of the ethical controversies these practices raise. Controversial practices include collection and selling of personal data, promotion of rumor and misinformation, cyberbullying, manipulation of social media newsfeeds, and electronic surveillance, as well as efforts by Internet platforms to curtail these activities. Student teams will analyze and ethically evaluate the Internet activities of a platform or company of their choice and present their findings to the class.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [{"first_name": "John", "last_name": "Hooker", "username": "jh38", "photo_url": null, "hours_per_week": 0, "tags": [], "semesters_taught": [{"semester": 2, "year": 2023}], "id": 559}], "is_repeatable": true, "is_req_repeatable": true, "catalog_levels": [], "skills": [], "attributes": [], "custom_fields": {"goals": "Provide a framework for rigorous analysis of ethical issues provide supervised practtice at analyzing ethical issues raise awareness of online practices and their personalsocial impact", "key_topics": "Ethical principles, online privacy, social media abuse, online surveillance, responsibilities of online platforms", "prerequisite_knowledge": null, "assessment_structure": "Team project -- analysis of issues surrounding internet policies of a particular firm or organization, with class presentation. Regular listening quizzes to direct learning during class sessions.", "relevance": "Social media and the Internet are transforming societies worldwide, a trend that poses urgent ethical issues. Nearly everyone uses social media, and many design or rely on websites at work.", "learning_resources": "Case studies; business media; reputable online sources; readings, such as Zuboff's \"The Age of Surveillance Capitalism\"", "extra_time_commitment": "Research for and preparation of class presentation"}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}