{"code": "70-352", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2016}, {"semester": 2, "year": 2017}, {"semester": 2, "year": 2020}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Premise: Perception may or may not be Reality. But Perception is, in fact, what Influences people.\nThis experiential communications course focuses on how you as a Leader can choose to more effectively express yourself & influence others using practical, hands-on tools from Acting in professional, live Theatre. You will choose to effectively Influence your Listeners' perception of you through the use of: \"Action\"; Assertiveness, Confidence & Expressiveness (ACE); the Communication Tools; and the incorporation of The Seven Steps Of Effective Presence (or core competencies).", "prerequisite_knowledge": null, "assessment_structure": "Grading is based on the participant's assertive fulfillment of all course requirements. Grading focuses on individual effort rather than on competitive results.\nParticipants will be graded based on:\n1-attendance & punctuality; a Lateness or leaving early will be treated as half an absence.\n2-active participation in in-class discussions;\n3-full preparedness for each assignment, including outside rehearsals as needed;\n4-full compliance with instructions & completion of all assignments; &\n5-mastery of \"The Seven Steps Of Effective Presence\" (or core competencies).", "goals": "The Seven Steps Of Effective Presence or core competencies are the standards by which inclass work will be assessed. Participants will participate in inclass discussions and complete written performed assignments. I will provide both verbal written feedback toward the goalso to choose to assertively Influence others through knowledgeable use of Actions toward a Goal o to choose to grab and hold audience attention interest o to choose to project greater SelfConfidence manage tension or stage fright o to choose to better shape your relationship with your Listeners o to choose to aspire to an empathetic assertive SpeakertoListener mindset ando to choose begin to master outer communication tools, such as eye contact, body language, movement stillness, gesture, key words, inflection, vocally commanding a room, dynamic diversity. Toward these Goals, participants will examine the Inner Acting tools of o Your Best Possible Self confident assertive expressive o a new, assertive frame of mind for the Speaker toward the Listener o The Seven Steps Of Effective Presence or core competencies 1WANT TO DO IT. Genuine Enthusiasm, Curiosity Respect 2 DEFINE IT. Preparation, Clarity, Informed Context 3OWN IT. Personal Connection, Empathy 4MAKE IT POP. Dynamic Variety, Contrast 5ELEVATE IT. Personal Risk, Bravery 6CUSTOMIZE IT. Economy, Specificity 7MAKE IT COMPELLING Ease, Confidence Efficacy.", "relevance": "The Course challenges participants to improve their communication skills as leaders; to \"get out of themselves\", to expand their comfort zones when communicating in public, to choose to take risks & to think more flexibly - all toward becoming more assertive, confident & expressive leaders. The course has been referred to as: \"teaching an important life skill\"; \"Cross Training For Business People\"; \"Ethical Acting\"; & even \"Charisma 101\". It will not improve your PowerPoint - but will improve the communicator standing in front of your PowerPoint.", "learning_resources": "Course Materials: All required course materials are provided in a Course Packet that will be provided on Canvas and can also be emailed to participants, including the Syllabus; the Backstory & Index; information about the art of Acting; Instructions for All Assignments; PowerPoint slides re Action, re the Seven Steps Of Effective Presence and also re The Communication Tools; instructions for all Assignments; plus the texts for all performance materials to be used during the course.\nAlso, I will provide both verbal & written feedback for all assignments.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 3.0, "website": null, "long_desc": "This is a oneweek course that is offered only at CMU in Qatar.  This course provides a uniquely broadening educational experience for business students through an exploration  understanding of the process of Acting  the unique performeraudience relationship.   Using techniques of Acting, the course will concern itself with a new selfawareness  greater confidence in public communication the expansion  diversification of ones range of personal expression methods to more effectively shape a public performance  of empowering the student to put hisher best Self forward when in contact with an audience  a reinvestment in passion.", "short_name": "BUSINESS ACTING", "co_reqs": [], "instructors": [{"username": "gh28", "first_name": "Geoffrey", "last_name": "Hitch", "tags": [], "hours_per_week": 0, "id": 941, "semesters_taught": [{"semester": 2, "year": 2016}, {"semester": 2, "year": 2017}, {"semester": 2, "year": 2020}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Business Acting", "base_name": "Business Acting", "skills": [{"id": 1857, "name": "Investing", "slug": "investing"}], "success": true, "attributes": []}