{"code": "70-395", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This is a course on early stage investing, how fund raisers are evaluated, and optimize the path to funding. We will focus on how venture investors find, evaluate and price their investments. While the course includes a brief overview of the venture capital and investment life cycles, we will spend the majority of our time developing the knowledge and skills necessary to present an idea and raise capital appropriately. Topics include: early stage investing, understanding your audience, developing knowledge and skills necessary to lead private equity deals, what makes investors decide on an investment?", "prerequisite_knowledge": "Students are highly encouraged to take any of the introductory entrepreneurship classes offered in various schools and departments. While no financial background is required, this class will not cover the basics of entrepreneurship from the entrepreneur's perspective, but will be looking from the investor point of view.", "assessment_structure": "Homework 10%; Class participation/Attendance (5/25%) 30%; Case study 1 30%, Case study 2 30%; Extra credit (idea book) TBD.", "goals": "By the end of the semester, you should be able to answer the questions listed in the last section with a strong degree of confidence. You should also be able to Understand general Investment ModelPackage Tools Stage, Size, Industry, Markets, and the like DevelopIdentify Company Overview Company, Need, Market, Product, Novelty, Comparables, Competition, etc.... Understand mechanics and key points in Funding Resources, diligence, valuation Understand Venture Deal Terms Prepare simple diligence, comparables and exit analysis Present an effective, tothepoint investment recommendation Present an effective and stimulating investor presentation.", "relevance": "This class is about funding early stage ventures. I don't assume that you have much entrepreneurial background, but if you have taken any of the various introductory entrepreneurship classes that is helpful. I also don't assume that you have any business or finance background. We will be looking at funding from the funder's point of view. The theory behind that is that once you understand what is important to funders, you can more successfully raise funds as an entrepreneur. Also, some of you may be looking into careers from the funding side; in that case, you will find this course covers essential information.", "learning_resources": "Guest speakers, discussion, homework, texts: \"How Venture Capitalists evaluate Potential Venture Opportunities\" (Michael J. Roberts, Lauren Barley, 9-805-019, Rev. Dec 1 2004); \"Primer on Angel Investing\" (Jon Kaufman); \"Raising Capital for Entrepreneurs\"; \"Industry Insiders on Angel Funding, Venture Capital, and Growth Money from Private Investors\" (John May. etc); Other supplies may be presented over the course schedule (multiple investment documents, such as private placement memoranda, PPP instructions).", "extra_time_commitment": "Homework and team project work"}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "So you want to do a startup and you know that you need funding. There are multiple ways to fund a new venture bootstrapping, economic development, angels, venture capitalists. The question is what are these funders looking for in an early stage investment What is important to them How do they decide which companies to invest in and which not This class looks at funding from the funders point of view and provides the student with a framework of the investment process investment criteria, sourcing, selection, due diligence, deal structure, valuation, post investment involvement. Real companies seeking funding are used for the final project in which students will be expected, as investment teams, to make investment decisions and convince their fellow investors the class to join them or not.   This is a highly interactive and project class. There will be multiple guest speakers. This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.", "short_name": "FUNDING ENTREP VENTR", "co_reqs": [], "instructors": [{"username": "emerson", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 1878, "semesters_taught": [{"semester": 1, "year": 2016}], "photo_url": null}, {"username": "sakguc", "first_name": "Serkan", "last_name": "Akguc", "tags": [], "hours_per_week": 0, "id": 481, "semesters_taught": [{"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}], "photo_url": null}, {"username": "gmwhite", "first_name": "George", "last_name": "White", "tags": [], "hours_per_week": 0, "id": 803, "semesters_taught": [{"semester": 1, "year": 2015}, {"semester": 1, "year": 2017}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}], "photo_url": null}, {"username": "mhakim", "first_name": "Maher", "last_name": "Hakim", "tags": [], "hours_per_week": 0, "id": 756, "semesters_taught": [{"semester": 1, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Funding Entrepreneurial Ventures", "base_name": "Funding Entrepreneurial Ventures", "skills": [{"id": 1857, "name": "Investing", "slug": "investing"}], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "entrepreneurship", "id": 4}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "interdisciplinary", "id": 10}, {"type": "attribute", "name": "reading intensive", "id": 13}, {"type": "attribute", "name": "team project", "id": 17}, {"type": "attribute", "name": "writing intensive", "id": 18}]}