{"code": "70-424", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2016}, {"semester": 2, "year": 2019}, {"semester": 2, "year": 2021}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Financial reporting history; articulation of financial statements; accounting for revenue, inventory, tangible and intangible assets, leases, equity and debt financing, taxes, and mergers and acquisitions; earnings management; non-GAAP disclosure requirements; trade credit; hedging and hedge accounting; accounting-based debt contracting; executive compensation", "prerequisite_knowledge": "Appropriate for students who have taken 70-122 and are interested in a career in business or related fields.", "assessment_structure": "Two midterm quizzes, case assignments, and a final project.", "goals": "The objective of this course is to provide students who intend to pursue a career path that involves financial statement information, which includes virtually all business students and many others, with a deeper understanding of the process that generates this information. The course extends introductory financial accounting concepts and discusses them not only from the perspective of corporate managers or investors, but also in a regulation and policy context. This course should empower students to see beyond the numbers to understand the economic incentives of the managers and analysts that use them as a mode of communication.", "relevance": "Students will gain a better understanding of the economics of financial reporting, which will provide them with an edge in interviews and help them interpret financial information presented to them by various sources, including corporations, media, analysts, and co-workers. The material in this course is important for most post-business-school employment opportunities.", "learning_resources": "Optional textbook. Course packet includes relevant case studies", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": "http://tepper.cmu.edu/prospective-students/course-page/70424/corporate-financial-reporting", "long_desc": "This course is designed to strengthen your ability to correctly interpret financial statements and their accompanying disclosures. The course is aimed at anyone whose career might involve working with accounting and other financial data, and should be especially useful for those interested in consulting and financial analysis. Throughout the semester we will discuss the key disclosure rules in the United States, the communication methods available to managers, managers incentives and ability to exert discretion over reported earnings, and the interplay between a companys corporate strategy and its financial reporting policies and practices. The course emphasizes a number of topics of recent interest to the business community including the quality of earnings, mergers and acquisitions, corporate innovation and RD, postemployment benefits, executive compensation, and intangible assets. This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.", "short_name": "CORP FINAN REPTNG", "co_reqs": [], "instructors": [{"username": "jo0x", "first_name": "John", "last_name": "O'Brien", "tags": [], "hours_per_week": 0, "id": 1651, "semesters_taught": [{"semester": 1, "year": 2016}, {"semester": 2, "year": 2019}, {"semester": 2, "year": 2021}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "(70-122 at least D)", "raw_pre_req": "", "req_obj": {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 9.0, "code": "70-122", "id": 2763, "name": "Introduction to Accounting"}}, "type_string": "", "type": "course", "id": 2763}], "id": 2764, "screen_name": "70-122"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 14405}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 14406}], "id": 11612, "screen_name": "k3pv30v2cpt4poy"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 14404}], "id": 11611, "screen_name": "4zhmrun2vibr9oc"}}, "is_req_repeatable": false, "topic": null, "name": "Corporate Financial Reporting", "base_name": "Corporate Financial Reporting", "skills": [{"id": 333, "name": "Executable Analysis", "slug": "executable-analysis"}, {"id": 1231, "name": "Community Involvement", "slug": "community-involvement"}, {"id": 1858, "name": "Financial Analysis", "slug": "financial-analysis"}], "success": true, "attributes": [{"type": "attribute", "name": "for non-majors", "id": 6}]}