{"code": "70-474", "offered_in_campuses": [2, 1], "offerings": [{"semesters": [{"semester": 1, "year": 2015}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": null, "prerequisite_knowledge": null, "assessment_structure": null, "goals": null, "relevance": null, "learning_resources": null, "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "We will first compare and contrast the ideas of various quality gurus, examining ways to define and measure quality. In most cases, the goal should be to design and maintain a process which is in statistical control, producing with the best nominal value, and with a minimum of variation. How to determine what is best is a topic which we will also discuss we will explore the use of the Taguchi Loss Function to help answer this question. We will also consider issues surrounding successful adoption of quality initiatives  finding ways of improving quality but being unable to get anyone to implement them is a prototypical problem in quality programs. We will then discuss strategies and tools which can be used to try to ensure quality it is important to not only be familiar with the tools of quality design and control, but also to understand when and how they can best be correctly applied. In this area we will study three central topics  the first two, sampling and control charts, serve as a basis for the correct application and evaluation of the third, design of experiments. These central topics will be illustrated through exercises, experiments, and cases, culminating in a final interactive capstone case for the class. We will conclude with a discussion of sixsigma, exploring its similarities and differences as compared to traditional quality programs. At the conclusion of the course you will understand the sixsigma framework, and be comfortable with its technical tools. Other topics we will consider include process capability, setting tolerances, process control, quality in service operations, evaluatory techniques such as the House of Quality, and ISO 9000 certification. The goal of the course is not to indoctrinate students into any single quality assurance framework, but rather to teach them the techniques that are common, and central, to any effective quantitative quality design and maintenance program.", "short_name": "QUALTY MGMT PRDCVTY", "co_reqs": [], "instructors": [{"username": "kekresh", "first_name": "Sham", "last_name": "Kekre", "tags": [], "hours_per_week": 0, "id": 145, "semesters_taught": [{"semester": 1, "year": 2015}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Quality Management and Productivity", "base_name": "Quality Management and Productivity", "skills": [], "success": true, "attributes": []}