{"code": "70-453", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2016}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Business process analysis and specification; developing and applying technology to improve business processes; understanding and navigating complex organizations; effectively presenting recommendations to a variety of audiences.", "prerequisite_knowledge": "See course prerequisites.", "assessment_structure": "You will learn new skills in this class largely through hands-on work, in-class discussions, in-class presentations, and a substantial semester long consulting project. Grades will be based on your ability to analyze a business situation and effectively communicate a recommended course of action through oral presentations and written reports. In the first half of the course, these exercises will typically be shorter case studies and exercises. In the second half of the course you will work with a student team on a substantial final project with numerous presentation and analysis milestones between project initiation and delivery of your final report.", "goals": "In this course, you will learn to how to effectively lead and undertake information system analysis and design projects. In doing so you will develop your intellectual toolbox for business technologies consulting by learning to apply specific tools and techniques such as BPMN and Agile development methodologies. Beyond the concrete analysis and design techniques, you will develop a set of work practices and habits of thought that should serve you well in your consulting career.", "relevance": "This course is primarily intended for students considering going into management consulting as a career. Students in the course will develop an understanding of the role of the management consultant in large organizations -- both the consulting firm and the client organization -- and how to be effective in the role. For all business students, even those who are not planning to pursue a management consulting career, skills in understanding how business processes work in an organization, identifying opportunities to improve those processes through the application of technologies, and how to communicate those recommendations are tremendously valuable for anybody working in a large and complex organization.", "learning_resources": "In the earlier parts of the course, students will be provided a combination of assigned readings and case studies for class sessions. In the latter parts of the course, students will be expected to do their own research on the topics assigned and share what they have found with the class, including their assessment of how what they have found relates to the final project.", "extra_time_commitment": "Students should plan to spend, on average, 4-6 hours outside of class on readings, exercises, writing reports, and preparing presentations. Failure to keep up with the work on a regular basis can lead to some weeks with substantially more than six hours of work required, especially as the end of the final project nears. Keeping up with the weekly assignments, readings, and project milestones will typically keep the weekly load in the 4-6 hours/week range."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "In this course, you will learn to how to effectively lead and undertake information system analysis and design projects. In doing so you will develop your intellectual toolbox for business technologies consulting by learning to apply specific tools and techniques such as BPMN and Agile development methodologies. You will practice applying these techniques on a variety of case studies, examples, and a substantial semesterlong project. Beyond the concrete analysis and design techniques, you will develop a set of work practices and habits of thought that should serve you well in your consulting career. This will be a very handson course in which you will largely learn by doing. Most class sessions will include a combination of some presentation by the instructor, some discussion possibly of a case study, and exercises to practice working with the days tools and concepts. Homework assignments, inclass presentations, and a semesterlong term project are essential parts of the course.", "short_name": "BUS TECH FOR CONSLTG", "co_reqs": [], "instructors": [{"username": "mhakim", "first_name": "Maher", "last_name": "Hakim", "tags": [], "hours_per_week": 0, "id": 756, "semesters_taught": [{"semester": 2, "year": 2016}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "(70-110 at least D) or (70-451 at least D)", "raw_pre_req": "", "req_obj": {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 9.0, "code": "70-110", "id": 5963, "name": "Business Computing"}}, "type_string": "", "type": "course", "id": 5963}], "id": 5964, "screen_name": "70-110"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 9380}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 9381}], "id": 8552, "screen_name": "ky0yietq5gwkk3o"}, {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 9.0, "code": "70-451", "id": 1440, "name": "Management Information Systems"}}, "type_string": "", "type": "course", "id": 1440}], "id": 1441, "screen_name": "70-451"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 9382}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 9383}], "id": 8553, "screen_name": "6awyd666t5no2ba"}], "constraints": [{"data": {"x": 1, "is_and": false}, "type": "anyxof", "id": 9379}], "id": 8551, "screen_name": "69smxoyn1kvh2hw"}}, "is_req_repeatable": false, "topic": null, "name": "Business Technology for Consulting", "base_name": "Business Technology for Consulting", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "lab component", "id": 11}, {"type": "attribute", "name": "reading intensive", "id": 13}, {"type": "attribute", "name": "research", "id": 14}, {"type": "attribute", "name": "writing intensive", "id": 18}]}