{"code": "70-482", "offered_in_campuses": [2, 1], "offerings": [{"semesters": [{"semester": 2, "year": 2017}, {"semester": 2, "year": 2018}, {"semester": 2, "year": 2019}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "We will study economic and behavioral approaches and their applications in: product line pricing; price discrimination; dynamic pricing; auction; bundling and competitive pricing; behavior aspects (psychological factors).", "prerequisite_knowledge": "See course prerequisites", "assessment_structure": "Two in-class quizzes, one mid-term exam, one final exam, and a course project presentation.", "goals": "This course provides a toolkit of offtheshelf pricing strategies. The focus of the course is to understand the importance of the demand curve and customer willingnesstopay in pricing strategy, to learn how to calculate profitmaximizing prices in varying contexts.", "relevance": "Students will build the right intuition that guides everyday pricing decisions, master some concrete analytical and numerical tools for analyzing and designing innovative price/monetization strategies, and apply the concepts in a variety of business contexts.", "learning_resources": "There is no required textbook. A recommended (and optional) reference: Principles of Marketing, 14th Edition, by P. Kotler and G. Armstrong. 2010.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "Pricing is a critical marketing decision which enables a firm to translate customer value into profit. This course provides a first survey of pricing concepts. Instead of discussing pricing in isolation, we focus on the interplay between pricing and other aspects of marketing, such as positioning, branding and advertising. To this end, we provide a formal treatment of pricing concepts in the framework of game theory. Finally, we also discuss nonpricing tools that firms can use in order to capture customer value. Specifically, we cover cases wherein firms generate a profit while keeping their services free, a phenomena that is widely observed among Internet firms. This course has no formal prerequisite, but a willingness to study formal i.e., mathematical models is assumed. Any previous exposure to microeconomics analysis and game theory will be helpful. This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.", "short_name": "PRICING STRTGY", "co_reqs": [], "instructors": [{"username": "smathur", "first_name": "Sameer", "last_name": "Mathur", "tags": [], "hours_per_week": 0, "id": 4929, "semesters_taught": [{"semester": 1, "year": 2022}], "photo_url": null}, {"username": "sp4k", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 1874, "semesters_taught": [{"semester": 2, "year": 2017}], "photo_url": null}, {"username": "pstuettg", "first_name": "Peter", "last_name": "Stuettgen", "tags": [], "hours_per_week": 0, "id": 657, "semesters_taught": [{"semester": 2, "year": 2018}, {"semester": 2, "year": 2019}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Pricing Strategy", "base_name": "Pricing Strategy", "skills": [{"id": 1268, "name": "Translation", "slug": "translation"}, {"id": 1343, "name": "Game Theory", "slug": "game-theory"}, {"id": 1429, "name": "Advertising", "slug": "advertising"}, {"id": 1864, "name": "Microeconomics", "slug": "microeconomics"}], "success": true, "attributes": [{"type": "attribute", "name": "for non-majors", "id": 6}]}