{"code": "70-443", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 2, "year": 2021}, {"semester": 2, "year": 2022}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Concepts of digital advertising and ad-auctions, efficiently running an ad-campaign, using crowd to push products on social media, how to makes ads go viral. Several related case studies.", "prerequisite_knowledge": "Familiarity with digital advertising", "assessment_structure": "The course will have the following assessment structure\nCase Presentation & Write-ups (Group): 30%\nClass Discussion (Individual): 10%\nSocial Media Campaign Analysis (Group): 20%\nMid-Term Exam (Individual): 20%\t\nFinal Exam (Individual): 20%", "goals": "Upon completing the course a student will be able to run real adcampaigns efficiently and will know about the best and worst practices in digital marketing. The student will also be able to advertise successfully on socialmedia platforms.", "relevance": "This course exposes students to various techniques of pushing a product in digital economy.", "learning_resources": "Detailed lecture notes will be available during the semester.", "extra_time_commitment": "Homeworks; a group project for which student teams meet outside of class; optional review sessions before exams."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This course explores issues related to digital and social media marketing. This is a handson class where students utilize real world data. Specifically, we study the following topics a Search Engine and Sponsored Search Optimization how search engines, keyword auctions, retargeting, mobile marketing, social network marketing and search engine marketing work, and how to optimize pay per click advertisement efforts. b EconoMining how firms are getting or can get useful information from user generated content using text mining and opinion mining capabilities to drive their product development, placement, and advertisement decisions. c Social MediaViral Marketing how to design a social media marketing campaign the key ingredients that make such campaigns successful how to run a campaign for a viral product measuring the success of a social media campaign d Wisdom of the Crowds how to design crowdsourcing contests what and how to crowdsource prediction markets and how to design them for success and the kinds of questions are best suited for prediction markets. This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.", "short_name": "DGTL MKTG SCL MD STG", "co_reqs": [], "instructors": [{"username": "pbhb", "first_name": "Peter", "last_name": "Boatwright", "tags": [], "hours_per_week": 0, "id": 737, "semesters_taught": [{"semester": 2, "year": 2018}], "photo_url": null}, {"username": "varuns2", "first_name": "Varun", "last_name": "Sharma", "tags": [], "hours_per_week": 0, "id": 4192, "semesters_taught": [{"semester": 1, "year": 2019}, {"semester": 2, "year": 2021}, {"semester": 2, "year": 2022}, {"semester": 1, "year": 2022}], "photo_url": null}, {"username": "bcollier", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 2826, "semesters_taught": [{"semester": 1, "year": 2015}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Digital Marketing and Social Media Strategy", "base_name": "Digital Marketing and Social Media Strategy", "skills": [{"id": 1429, "name": "Advertising", "slug": "advertising"}], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "for non-majors", "id": 6}]}