{"code": "70-452", "name": "Introduction to Product Management", "base_name": "Introduction to Product Management", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "INTRO TO PRODUCT MAN", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1, 2], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 2, "year": 2023}, {"semester": 1, "year": 2023}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "This course introduces the role and responsibilities of the Product Manager in a technologyintensive product or services company. The overarching goal of the course is to give you the knowledge and tools you need to make good product decisions so that your team can ship the right product, to the right customers, through the right channels, at the right price. To that end, you will learn to apply tools and techniques for building and managing a product roadmap, prioritizing development requests, evaluating tradeoffs, and modeling the financial implications of different business models, operating models, pricing, and packaging options. Along the way, we will look at many of the core activities and tasks that an effective Product Manager needs to master, includingUnderstanding value propositions and customer priorities, Identifying and selecting customer and market segments, Packaging and bundling capabilities and benefits into a cohesive set of offerings, Selecting pricing models and setting specific prices, Estimating the likely benefits and costs of proposed product enhancements, Modeling and evaluating the financial implications of product choices, Managing the full product life cycle, from conception to sunsetting. This course may use thirdparty course material that is not available for individual purchase from the publisher. If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided. The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 1}, {"name": "specific_sem", "type": "INFO", "sem": 2}, {"name": "specific_sem", "type": "INFO", "sem": 3}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "catalog_levels": [], "skills": [], "attributes": [], "custom_fields": {"goals": "By the end of this course you should be able to Articulate the primary responsibilities of a product manager for technologyintensive products, and the tasks that they do to fulfill those responsibilities Identify and prioritize customer needs, wants, and desires Identify which of these your offering will address, for whom it will address them, and how it will address them Make effective decisions regarding product tradeoffs Make effective decisions regarding product pricing and packaging Model the financial implications of alternative product choices Develop and maintain a product roadmap Structure and manage an organizations portfolio of product offerings Communicate persuasively and effectively with internal and external stakeholders", "key_topics": "Product Management, Product Development, Product Marketing, Pricing, Customer Discovery, Product Portfolio Management, Product Roadmaps", "prerequisite_knowledge": "There are no formal course prerequisites but the professor will assume that students have a basic understanding of core business concepts, comparable to what a Tepper undergraduate would acquire in the first year of the Tepper Business Administration program. Students from outside of the BA program are encouraged to join the class but they may need to do some self-study to fill in gaps in their business knowledge as the course progresses.", "assessment_structure": "Assessment of student learning will be conducted through homework assignments, a final project, and one or more exams.", "relevance": "The role of the Product Manager has become increasingly important in technology-driven firms. The Product Manager is typically responsible for shipping the right product, to the right set of customers, at the right price, through the right channels, in a way that generates value (profit) for the company and value for their customers. It's a challenging job, and one that requires a broad range of expertise.\n\nThis course introduces the primary decisions that a Product Manager needs to make, the tasks that they need to complete in order to make those decisions effectively, and the organizational dynamics that they need to be able to read and understand to drive their initiatives through to successful completion. In addition to understanding the milieu in which Product Managers operate, the course introduces tools and frameworks for evaluating alternatives and making effective product-related decisions.", "learning_resources": "Selected readings will be provided to support student learning. In addition to the provided readings, students will be expected to research topics and questions on their own to complete assignments and the final project.", "extra_time_commitment": "The time commitment for this course will be commensurate with the number of units offered. Time demands will vary from week to week, depending on how effectively the student makes progress on assignments and projects prior to the deadline."}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}