{"code": "70-433", "name": "Leading Innovation", "base_name": "Leading Innovation", "units": 3.0, "min_units": 3.0, "max_units": 3.0, "short_name": "LEADING INNOVATION", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [2], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "Organizations startups and mature businesses alike live in an age of constant change i.e., technology evolutionrevolution, globalization, deregulation. Over the past decades, breakthroughs such as artificial intelligence, machine learning, rapid computing, nano and biotechnology have significantly accelerated the rate of innovation. The internet and digital connectivity have transformed information dissemination and global collaboration. The development cycle for new products and services have shortened, consumer demands becoming more dynamic and volatile. Organizations must innovate faster to stay relevant as the future becoming furthermore intelligent and dynamics.Innovation is not merely about creating something entirely new. It can also involve incremental changes or adaptations that significantly improve existing products, processes, or services. It often requires creativity, critical thinking, problemsolving, and a willingness to challenge the status quo.People are the agents of innovation. Managers of an organization are responsible for diagnosing challenges, analyzing applications, formulating strategies, building innovative teams, leveraging innovation for competitive advantages and sustained success. It is therefore essential for managers to develop necessary leadership skills that will enable them to successfully manage innovation. These skills are manifested through a firm understanding of the dynamics of innovation process.Leading Innovation is an essential course for managers to develop the skills, knowledge, and strategic perspective required to foster innovation within their organizations, ensuring sustainable growth, competitiveness, and relevance in a rapidly changing business landscape.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 1}, {"name": "specific_sem", "type": "INFO", "sem": 2}, {"name": "specific_sem", "type": "INFO", "sem": 3}], "website": null, "instructors": [], "is_repeatable": true, "is_req_repeatable": true, "catalog_levels": [], "skills": [], "attributes": [], "custom_fields": {"goals": "In this course, we will take a survey of topics in innovation and look at how to best organize and operationalize innovation to achieve strategic advantages. We will take a deep dive into some of the most innovative businesses and study how they went about creating, managing, and leading innovation. We will discuss a spectrum of innovation concepts, theories, frameworks, and factors for managing and leading successful innovations. We will explore processes of production innovation, process innovation, business model innovation, marketing innovation and organizational innovation.", "key_topics": "Introduction to Innovation Creativity and Innovative Teams Innovation Leadership and AI Design Thinking Disruptive Innovation Managing the Innovation Process Leading Innovation and Change Upscale Innovation for Global Growth", "prerequisite_knowledge": null, "assessment_structure": "Assignments and Grading Overall, your final grade in this course will be based on four components as follows. The specific details of each component are described below. Participation/Class Contribution 20% Individual Case Write-Ups (2 x 20%) 40% Team Project 40% (including 5% peer assessment for group participation and contribution) 1. Class Participation and Contribution (20%) This is a discussion-based class. As such, coming prepared is an integral part of your success (this means you must read the required readings prior to the class).", "relevance": "\"Innovation is perhaps the most essential and perhaps, the most fragile, competency that a company can have\" (Peter Druker). Businesses that fail to innovate, invariably and inevitably, fail. Innovation is a great driver of an organization's long-term success and growth and as such, it must a core competency of any great organization and prevalent to the process and culture of the organization and its leadership. Innovation is crucial for companies seeking growth, staying competitive, adapting to change, and addressing evolving customer needs. Apple, L'Oréal, Microsoft, Starbucks, Unilever, Tesla, Tencent and Amazon occupy different industries and present different values to their markets, investors, and customers. Yet these companies all share two characteristics: (1) the ability to innovate, and (2) the ability to change, and the reason that they are on the Forbes' 2022 list of the world's most innovative companies https://www.forbes.com/special-features/innovative-companies-list.html Organizations (startups and mature businesses alike) live in an age of constant change (i.e., technology evolution/revolution, globalization, deregulation). Over the past decades, breakthroughs such as artificial intelligence, machine learning, rapid computing, nano- and biotechnology have significantly accelerated the rate of innovation. The internet and digital connectivity have transformed information dissemination and global collaboration. The development cycle for new products and services have shortened, consumer demands becoming more dynamic and volatile. Organizations must innovate faster to stay relevant as the future becoming furthermore intelligent and dynamics. Innovation is not merely about creating something entirely new. It can also involve incremental changes or adaptations that significantly improve existing products, processes, or services. It often requires creativity, critical thinking, problem-solving, and a willi", "learning_resources": "Course Packet, HBS Cases, HBP Simulations", "extra_time_commitment": null}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}