{"code": "70-485", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2017}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The course is organized around the basic process of conducting a brand audit, as the following graphic illustrates:\n\n\nTopics include the principles of branding, marketing research, how to analyze data, positioning strategies, marketing techniques and how to measure marketing return on investment.", "prerequisite_knowledge": "In addition to course prereqs, students should be familiar with Excel.", "assessment_structure": "The best way to learn about product and brand management is to do it. In this course, you will have two basic assignments and participation:\n\n1. Agency Shootout (35%): This semester, we will have three clients who have immediate branding challenges. Competitive teams will be assigned to one of these three clients and asked to deliver a formal presentation of your findings, strategy and recommendations to the client (who will have in-person representatives who will provide feedback and evaluate the presentations).\n¿ Background, data and other materials provided prior to the case (short overview)\n¿ Your team should do a research-based assessment and recommendations (PPT)\n¿ Client will listen to presentations and select \"winner\"\n2. Product and Brand Management Project (35%): You will also be asked to formulate a team to select and conduct your own brand assessment and recommendations. You should:\n¿ Teams of 2-6 members use research-based approach (survey, focus group(s), audit, etc.)\n¿ Preferably organization or product you have access to (might want to invite them to your final presentation vs. mega brand)\n¿ Proposal (1-2 page write up that outlines your approach, research, etc.)\n¿ Periodic project updates (report-outs in class)\n¿ Final session, formal presentation of results and recommendations\nSome of you may elect to complete these assessments on behalf of other groups and/or clients. If possible, please plan to include their input throughout the project and invite them to the final presentation. There are four assignments (check in or update points):\n¿ Project proposal (1-2 page summary of your research problem and plan)\n¿ Tool (questionnaire, survey, online form, etc. that you plan to use to conduct your brand assessment)\n¿ Progress report (an update on where you are, preliminary recommendations, etc.)\n¿ Final presentation/report\n\n3. Individual Participation (30%): You will be expected to be present & participate", "goals": "To improve your problem definition skills. You will discover why, when and how to use brand strategy tools and techniques. Complete a brand caserecommendations for a specific client and present it in an Agency Shootout. Conduct an actual brand strategy assessment and offer your recommendations. Understand the basic components of branding. Use marketing research and related skills to strengthen your brand analysis, recommendations and implementation.", "relevance": "It used to be enough simply to do marketing. Placing an ad, pitching a press release to a trade journal editor, sponsoring a booth at a trade show¿those actions showed that a business owner or marketing manager was doing the right stuff. And the more you did, the better. But no longer. Today's pressure-packed marketplace is very different. There's more competition, more informed consumers and customers and more at stake.\n\nTo give companies a competitive edge, marketers created branding and have started to figure out how, when and where to use assorted techniques that take relatively minor and sometimes insignificant differences between products, services or ideas and magnify those differences in such a way that someone else is willing to select and pay more for the branded item over the non-branded one.\n\nTo complicate matters even further, you used to be able to establish national and global brands relatively systematically through big media buys in traditional channels, like TV, radio and newspapers. Now, the media and marketing channels have become so fragmented that building a brand has become perhaps more of an \"art\" than a \"science.\"\n\nSince the best way to learn something is to actually do it, Product and Brand Management is a project class. Through real-world client cases (from organizations who will listen to your recommendations and presentations, we will hold three \"Agency Shootouts.\" These are mini-case competitions based off of information provided in class. Also, either by yourself or with a handful of teammates, you will be asked to conduct your own brand assessment (primary and secondary marketing research) and come up with a recommendation and plan for improving a real product, service or company brand (preferably one that you have a client connection to and is not necessarily an established, national brand that most everyone has already heard of). Some semesters, a client will be selected fo", "learning_resources": "All course materials are provided by your instructor and available on Canvas.", "extra_time_commitment": "Work on the Agency Shootouts and client projects may include working outside the class, completing site visits and participating in other meetings."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "Product managers are essentially the CEO of the product line. Brand and product management provides strategic vision and leadership for the product and service, both 1 understanding the market opportunity and what must be done for successfully delivering on the brand promise and 2 leading across the organization, often without authority, to achieve that success.  Productservice success in a dynamic market is subject to many factors, including marketplace needs, reactions and activities of competition, the strategy and change within ones own firm, operating and financial constraints, demand forecast uncertainty, and more.  By taking this course, you will learn the principles of product and brand management and understand what it is like and what it takes to be a successful marketing leader. This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.", "short_name": "PRODUCT & BRAND MGT", "co_reqs": [], "instructors": [{"username": "pbhb", "first_name": "Peter", "last_name": "Boatwright", "tags": [], "hours_per_week": 0, "id": 737, "semesters_taught": [{"semester": 1, "year": 2017}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "(70-381 at least D)", "raw_pre_req": "", "req_obj": {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 9.0, "code": "70-381", "id": 5717, "name": "Marketing I"}}, "type_string": "", "type": "course", "id": 5717}], "id": 5718, "screen_name": "70-381"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 16113}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 16114}], "id": 12651, "screen_name": "a5dis7a7d42ja03"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 16112}], "id": 12650, "screen_name": "ivxhuzpnowrqzrd"}}, "is_req_repeatable": false, "topic": null, "name": "Product and Brand Management", "base_name": "Product and Brand Management", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "for non-majors", "id": 6}]}