{"code": "70-483", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2018}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The course is designed to help students understand the integrated marketing communications model, the strategy and tools of the marketing mix and how to measure marketing communications' effectiveness. The course is designed in five sections: Part One focuses on the understanding of consumer behavior - one of the, if not the most, critical part of understanding marketing. Brands are built and defined in the minds of consumers. Part Two focuses on IMC and the framework used by brand management to develop strategy, and understand audience segmentation and brand positioning to drive IMC. Part Three focuses on understanding the IMC tactics available to marketers including advertising, social media and digital marketing, events and public relations. Part Four highlights what defines an Iconic Brand. Part five includes the development of a marketing plan.", "prerequisite_knowledge": "See course prerequisite", "assessment_structure": "Students will be assessed via numerous methods, including: case write-ups, group work, marketing plan development, peer grade and various papers.", "goals": "The specific objectives of this course are toUnderstand the basis of consumer behavior, brand loyalty and buying habits Understand the integrated marketing communications model and the role it plays in marketing management today Emphasize the importance and development of an integrated marketing communications strategy, with the end goal of understanding, generating and delivering value to the consumer Understand and apply strategic positioning to drive consumer marketing communications mix and execution Highlight significant and emerging changes in consumer marketing, including technology, branding, and globalization and, Learn what it takes to build and successfully manage an iconic brand Ultimately, how to apply class learnings to actual marketing communications activities.", "relevance": "Students will gain a better understanding of the consumer and the consumer journey, marketing tools, how to build a marketing plan, and what it means to be an iconic brand. This will help prepare students for marketing-related internships and career post graduation.", "learning_resources": "All materials will be included in a course packet that can be purchased at the bookstore.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "It is critical that marketers understand the limitations of marcom tactics as well as how to best leverage and integrate marcom tactics for the strongest, most consistent and authentic brand voice in the targeted marketplace.  The entire IMC process is driven by the customer, and in the case of our discussions in this class, the consumer. The course is designed to help students understand the integrated marketing communications model, the strategy and tools of the marketing mix and what makes an iconic brand. The course is designed in five sections Part One focuses on understanding brands  iconic brands, terminology and types of branding. Part Two focuses on the understanding of consumer behavior  one of the, if not the most critical part of understanding marketing. Brands are built and defined in the minds of consumers. Part Three focuses on IMC and the framework used by brand management to develop strategy, and understand audience segmentation and brand positioning to drive IMC. Part Four focuses on understanding the IMC tactics available to marketers including advertising, social media and digital marketing, events and public relations. Part five concludes with the deeper study of an iconic brand. This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.", "short_name": "ADVRTS & MARKET COMM", "co_reqs": [], "instructors": [{"username": "egenc", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 3746, "semesters_taught": [{"semester": 1, "year": 2018}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "(70-381 at least D)", "raw_pre_req": "", "req_obj": {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 9.0, "code": "70-381", "id": 5717, "name": "Marketing I"}}, "type_string": "", "type": "course", "id": 5717}], "id": 5718, "screen_name": "70-381"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 16136}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 16137}], "id": 12666, "screen_name": "60rvdwqw5nnmz7h"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 16135}], "id": 12665, "screen_name": "l3ocilog8tei2jj"}}, "is_req_repeatable": false, "topic": null, "name": "Advertising and Marketing Communications", "base_name": "Advertising and Marketing Communications", "skills": [{"id": 1429, "name": "Advertising", "slug": "advertising"}, {"id": 1553, "name": "Measuring As-Builts", "slug": "measuring-as-builts"}], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "team project", "id": 17}]}