{"code": "70-415", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Entrepreneurship, Start-ups, Business planning, Business Model Canvas, CPS-V Hypothesis, Customer Discovery, Basics of Business, Team Management, Minimum Viable Product, Pitching, Investment", "prerequisite_knowledge": "Students should be familiar with problem-solving within a good amount of uncertainty and ambiguity, and in working with teams of students with very diverse backgrounds.", "assessment_structure": "2 group projects, multiple Individual Assignments, Final exam", "goals": "The goal of this course is to teach the best practices and tools of the Lean Entrepreneurship technique of business assessment and planning. These techniques and tools may be applied to any venture idea regardless of discipline.", "relevance": "This course is designed to help the aspiring entrepreneur learn the lean entrepreneurial frameworks for comprehensive analysis, planning and execution of their new venture. Candidate students come from all disciplines from across the university including (but not limited to) engineering, business, computer science, drama, design, architecture, etc.", "learning_resources": "Zero to One by Peter Thiel, case studies, web pages", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "This course is an introductory course designed to provide an overview of entrepreneurship, develop an entrepreneurial frame of mind and learn the fundamentals of lean startup development. Students can expect to gain a basic understanding of functional areas such as customer discovery, sales, business planning, risk management, venture funding, and more. This class also features The Sprint An Entrepreneurship Competition, which affords the students the opportunity to gain experience selling their choice of product in a realworld and competitive environment. The class is a discussion and projectbased class. Class sections feature either a combination of lectures, class discussions, and activities or applied workshops in small groups. Students will be learning a mental framework for evaluating  developing any startup and then applying said framework and techniques to analyze and execute realworld business opportunities. Interdisciplinary teams will generate ideas and explore their potential as viable businesses. Numerous student teams have completed this class with realworld opportunities. Guest speakers, case studies, and exercises will also be integrated. This course may use thirdparty course material that is not available for individual purchase from the publisher. If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course. Students enrolled in the course will be required to pay the University the associated additional course materials fee for the thirdparty course material provided. The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided and typically ranges from 13 to 75.", "short_name": "INTRO ENTREPRENRSHIP", "co_reqs": [], "instructors": [{"username": "gmwhite", "first_name": "George", "last_name": "White", "tags": [], "hours_per_week": 0, "id": 803, "semesters_taught": [{"semester": 1, "year": 2015}, {"semester": 1, "year": 2016}, {"semester": 1, "year": 2017}, {"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}], "photo_url": null}, {"username": "mhakim", "first_name": "Maher", "last_name": "Hakim", "tags": [], "hours_per_week": 0, "id": 756, "semesters_taught": [{"semester": 1, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Introduction to Entrepreneurship", "base_name": "Introduction to Entrepreneurship", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "diversity", "id": 3}, {"type": "attribute", "name": "entrepreneurship", "id": 4}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "interdisciplinary", "id": 10}, {"type": "attribute", "name": "team project", "id": 17}]}