{"code": "70-437", "name": "Strategic Management and Innovation", "base_name": "Strategic Management and Innovation", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "STR MGMT & INNOV", "is_topic": false, "topic": null, "prereqs": {"text": "(70-311 [] at least D)", "req_obj": {"id": 5018046, "screen_name": "v83u46vrf6ffru3", "original_min_units": null, "min_units": null, "is_shared": false, "is_uni_req": false, "is_concentration": false, "default_concentration": false, "choices": [{"id": 5018047, "screen_name": "otm3p4d7cw5duic", "original_min_units": null, "min_units": null, "is_shared": false, "is_uni_req": false, "is_concentration": false, "default_concentration": false, "choices": [{"id": 6682, "screen_name": "70-311", "constraints": [{"type": "course", "type_string": "", "data": {"course": {"code": "70-311", "id": 6681, "name": "Organizational Behavior", "units": 9.0}}, "id": 6681, "is_hidden": false}], "course_parent_id": "50180470000000006682"}], "constraints": [{"type": "anyxof", "type_string": "Fulfill all of the following requirements", "data": {"x": 1, "is_and": true}, "id": 6125060, "is_hidden": false}, {"type": "mingrade", "type_string": "Minimum grade of D", "data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "id": 6125061, "is_hidden": false}]}], "constraints": [{"type": "anyxof", "type_string": "Fulfill all of the following requirements", "data": {"x": 1, "is_and": true}, "id": 6125059, "is_hidden": false}]}, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 2, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "This course focuses on how organizations deliver value in changing business environments, using analytical techniques to evaluate business situations and develop strategies that improve organizational performance. By focusing on the organizational perspective, you will develop practical skills in evaluating and designing ways for firms to achieve key strategic outcomes like growth and innovation, which determine the firms chances of success in dynamic environments. This course is particularly useful if you are interested in careers such as consulting, business development, investment banking, private equity, entrepreneurship, or simply want a better understanding of how their firm can develop a more innovative outlook. This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "catalog_levels": [], "skills": [], "attributes": [], "custom_fields": {"goals": "Introductory organizational behavior", "key_topics": "Organizations vary enormously in the rates at which they learn. Some organizations show remarkable performance improvements with experience whereas others evidence little or no learning. In the course, we examine why some organizations show rapid rates of learning and others fail to learn in order to provide you the knowledge and skills to manage learning effectively. Learning involves innovating or creating new knowledge, retaining that knowledge, and transferring the knowledge throughout the firm. We examine cognitive, social, motivational and technological factors that enable organizations to create, retain, and transfer knowledge. We also analyze how firms can promote the internal transfer of knowledge while minimizing its spillover to competitors. Thus, we examine how knowledge can be a source of competitive advantage for firms. Entrepreneurial firms are a particular focus of the course because learning is so critical in entrepreneurial firms, which often have few resources other than the capabilities of their founding members. Understanding learning and how to manage knowledge effectively can enable managers to improve firm performance. Thus, the main goal of the course is to enhance your ability to increase the rate of learning and performance gains at your firm. For example, you will learn approaches and techniques for increasing creativity in organizations, for learning from experience, for developing transactive memory systems and for promoting knowledge transfer. A mix of cases, readings exercises and projects will be used.", "prerequisite_knowledge": null, "assessment_structure": "Students will understand the psychological, network and technological factors that affect knowledge creation, retention and transfer in firms.", "relevance": "The course will analyze organizational learning and its processes of creating, retaining and transferring knowledge in firms.", "learning_resources": "Students will understand how to increase the rate of learning and performance gains in their firms.", "extra_time_commitment": "Students will be assessed on their performance on two exams, a team project, a final paper and participation."}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}