{"code": "73-102", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2019}, {"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}, {"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Individual Choice; Competitive Markets; Market Power; Game Theory; and Government Policy", "prerequisite_knowledge": "Comfort with basic algebra", "assessment_structure": "Homework assignments, quizzes, and exams", "goals": "By the end of the semester, students should be able to 1. Discuss human behavior in the context of rational decision making and cognitive biases for a broad set of human goals 2. Use the tools of demand, supply, and equilibrium to think about the outcomes of complex human interactions 3. Identify the role of externalities and possible interventions to reduce their impact 4. Use tools of game theory to analyze strategic interactions among agents in various economic situations 5. Apply these tools to thinking about everyday events and your own choices. 6. Support andor criticize policy proposals using mathematical models and graphical argumentation.", "relevance": "Dietrich GenEd prior to Fall 2021: Deciding\nDietrich GenEd after Fall 2021: Disciplinary Perspectives - Social Sciences\n\nIn a world where one is constantly confronted with choices and trade-offs (time, land, money, resources, etc.), we offer a course for anyone who expects to make a decision in their life. Students will learn how economists model the decision making processes of people, firms, institutions, and governments, and their eventual choices.", "learning_resources": "Weekly office hours, lecture slides, Piazza, textbook, SASC tutoring, and current events and news (made available on the course web).", "extra_time_commitment": null}, "equiv": [{"units": 9.0, "code": "73-014", "id": 11103, "name": "Course Credit (Principles of Microeconomics)"}], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "The course is an introduction to microeconomic principles and how to think like an economist. Market and policy outcomes are largely a function of individual decisions. These questions typically take the form how much and what combination of things should I buy When do we want businesses to go bust Should the government fund student tuition  Its my hope that youll also start to think about everyday questions from an economic lens why were bicycles so hard to find this past summer Is Uber surge pricing just a ripoff Is illegal streaming bad for consumers  Throughout the semester, we will build a toolkit to allow us to understand how these decisions interact and explain market successes, market failures, and the role of government in the marketplace. Toward the end of the semester, well change a few underlying assumptions and address a variety of questions related to strategic interaction. Some of the topics we will begin to introduce include credible threats, commitment problems, and the strategic use of information.  Not open to students who have received credit for 73100. While there are no calculus prerequisites for this course, students are encouraged to enroll in 73102 after theyve passed 21111.  Lecture, 2 hours Recitation, 1 hour.", "short_name": "PRINCPLES OF MICROEC", "co_reqs": [], "instructors": [{"username": "gasper", "first_name": "John", "last_name": "Gasper", "tags": [], "hours_per_week": 0, "id": 291, "semesters_taught": [{"semester": 2, "year": 2019}], "photo_url": null}, {"username": "aindaco", "first_name": "Agustin", "last_name": "Indaco", "tags": [], "hours_per_week": 0, "id": 4189, "semesters_taught": [{"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}, {"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}], "photo_url": null}, {"username": "serra", "first_name": "Serra", "last_name": "Boranbay Akan", "tags": [], "hours_per_week": 0, "id": 1528, "semesters_taught": [{"semester": 2, "year": 2018}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Principles of Microeconomics", "base_name": "Principles of Microeconomics", "skills": [{"id": 1343, "name": "Game Theory", "slug": "game-theory"}, {"id": 1864, "name": "Microeconomics", "slug": "microeconomics"}], "success": true, "attributes": [{"type": "attribute", "name": "for non-majors", "id": 6}]}