{"code": "76-245", "offered_in_campuses": [1], "offerings": [{"semesters": [], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Shakespeare, gender and sexuality, marriage, law, forgiveness, theater, history, dramaturgy, performance, comedy", "prerequisite_knowledge": "None - this is an introduction to Shakespeare", "assessment_structure": "There will be both graded and ungraded assignments in this course. Ungraded assignments are low-stakes, but required. They will occasionally be assessed informally on a check, check-plus, check-minus basis. Graded assignments are varied in order to focus on and build specific skills.", "goals": "Students at the end of the course should be able to a Discuss Shakespearean comedy and romance from a variety of perspectives, including historically, politically, aesthetically, and generically. b Frame and reframe fundamental questions who, what, where, when, why, and how in order to interpret Shakespearerelated issues, objects, and events. c Select and interpret materials that enrich inquiry, such as archival records, media sources, literary texts, letters, journals, official documents, images, etc. d Analyze passages from Shakespearean comedies and romances both as poetry to be read and drama to be performed. e Consider how thinking about Shakespeare has developed and situate their own way of thinking in relation to such traditions. f Write critical commentary on Shakespearean drama.", "relevance": "Dietrich GenEd Prior to Fall 2021: Creating\n\nDietrich GenEd After Fall 2021: Contextual Thinking\n\n\n\nStudying literature and going to the theater helps to underline the importance of ethical understanding.", "learning_resources": "All the plays and supplementary materials will be provided on Canvas. Students will also watch streaming video of productions available through the CMU libraries.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "In the closing decades of the sixteenth century, enterprising cultural producers in early modern London began to develop a new commercial venture called playing a business that offered ordinary people a few hours of dramatic entertainment for the price of one penny. In addition to watching the professional players onstage, spectators also participated in a form of play themselves in a sense because theatrical experience provided a unique opportunity to engage imaginatively with otherwise inaccessible people, worlds, and ideas. More than four hundred years later, the drama of the period now ranks among the most esteemed texts in all English literature, and the name Shakespeare has become a byword for literary genius. This course will offer an overview of Shakespeares tragedies and histories. As we read through these works, we will endeavor to understand what, and how, they meant in their original context, thereby developing a historically informed perspective on their influence over our own cultural landscape.", "short_name": "SHAKESPR TRGD & HIST", "co_reqs": [], "instructors": [], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Shakespeare: Tragedies & Histories", "base_name": "Shakespeare: Tragedies & Histories", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "ethics", "id": 5}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "reading intensive", "id": 13}, {"type": "attribute", "name": "writing intensive", "id": 18}]}