{"code": "76-239", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Film, History, Technology, Aesthetics, Criticism, Analysis, Visual Media Literacy", "prerequisite_knowledge": null, "assessment_structure": "Notes are collected weekly, participation, occasional quizzes, multiple essays and a final exam/project.", "goals": "The goals of this course are threefold. First, it will provide you with a solid grounding in the key issues and concepts of film studies. Second, it will expand your ability to knowledgeably critique individual cinematic works and their relationship to the larger culture. Lastly, it will provide you with experience in expressing your critiques in essay form.", "relevance": "GenEd Prior to Fall 2021: Reflecting\n\n\n\nGenEd After Fall 2021: The Arts\n\n\n\n\n\n\n\nThe acquisition of visual media literacy is crucial to our understanding of culture, society and history.", "learning_resources": "Readings will be distributed via Canvas, and all films are available in CMU's video collection or shown during class or scheduled screenings.", "extra_time_commitment": "Regularly assigned readings, as well as occasional films which must be viewed outside of class time."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "This course is an introduction to the history, technology, aesthetics, and ideology of film. Our main focus is the narrative fiction film, but we will also discuss documentaries, avantgarde work, and animation. The central organizing principle is historical, but there are a number of recurring thematic concerns. These include an examination of the basic principles of filmmaking, the development of film technology, the definition of film as both art and business, and the history of film as an object of critical and cultural study. The goals of this course are threefold. First, it will provide you with a solid grounding in the key issues and concepts of film studies. Second, it will expand your ability to knowledgeably critique individual cinematic works and their relationship to the larger culture. Lastly, it will provide you with experience in expressing your critiques in writing.", "short_name": "MEDIA/FILM STUDIES", "co_reqs": [], "instructors": [{"username": "jsquires", "first_name": "Jeffrey", "last_name": "Squires", "tags": [], "hours_per_week": 0, "id": 4134, "semesters_taught": [{"semester": 1, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Introduction to Film Studies", "base_name": "Introduction to Film Studies", "skills": [{"id": 1430, "name": "Cinema", "slug": "cinema"}], "success": true, "attributes": [{"type": "attribute", "name": "for non-majors", "id": 6}]}