{"code": "76-298", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2021}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Writing, science, technology", "prerequisite_knowledge": null, "assessment_structure": "One major essay and five minor writing assignments", "goals": "Acquire a vocabulary for discussing narrative and writing strategies relevant to science and technology Explore examples of science narratives that employ a wide range of structures and chronologies Draft new writing that employs narrative skills Learn how to write collaboratively when appropriate Devise a plan for expanding class assignments into larger, standalone documents Develop a plan for using these skills in your research and professional pursuits.", "relevance": "This course is relevant to students in all science and technology programs at CMU-Qatar, including both major and minor courses of study, so that those students can communicate their work in compelling ways to a variety of audiences, including potential employers. It is also valuable to those studying professional writing with an interest in science and technology fields.", "learning_resources": "All readings will be provided by the instructor", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "Storytellingusing narrative tools to engage and informis particularly critical to sharing research and innovation with nonexpert audiences. In both science and technology, the full value of the work can only be actualized when we use all the tools at our disposal to reach our intended audiences. Research supports the notion that stories and narratives increase interest in science and technology and are complementary to other forms of science communication. Storytelling can cut through information clutter, foreground key points, and collapse the distance between researchers and the communities they seek to benefit. This class will combine our inherent inclination toward story with the practical skills of organizing a narrative and shaping it through writing. Students will study effective examples of storytelling in science and technology, learn the writing vocabulary necessary to learn from those models, and practice these skills by writing about projects from their own academic and professional interests. Students will also learn how to adjust those skills across mediafrom writing to oral presentations to multimodal storytelling situations.", "short_name": "STORYTLNG IN SCI TEC", "co_reqs": [], "instructors": [{"username": "khaworth", "first_name": "Kevin", "last_name": "Haworth", "tags": [], "hours_per_week": 0, "id": 3731, "semesters_taught": [{"semester": 1, "year": 2021}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Storytelling in Science and Technology", "base_name": "Storytelling in Science and Technology", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "reading intensive", "id": 13}, {"type": "attribute", "name": "writing intensive", "id": 18}]}