{"code": "76-328", "name": "Introduction to Corpus Linguistics", "base_name": "Introduction to Corpus Linguistics", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "CORPUS LINGUISTICS", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1, 2], "offerings": [{"campus_id": 2, "semesters": [{"semester": 2, "year": 2023}], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "This is a handson, projectbased class that will help students build a methodological toolkit for computerbased textual analysis. That toolkit will include methods for the collection of data, its processing via offtheshelf software and some simple code, as well as its analysis using a variety of statistical techniques. In doing so, the class offers students the opportunity to engage in scientifically oriented inquiry, giving priority to the use of corpus evidence to answer research questions. The first part of the term will be devoted to introducing fundamental concepts and taking a birds eye view of the potential application of corpus methods in domains like academic writing, technical communication, and social media. From there, students will initiate projects of their own choosing and develop them over the course of the semester. The goal is to acquaint students with the strengths and limitations of computer based textual analysis and to provide them with the necessary foundational skills to design projects, to apply appropriate quantitative methods, and to report their results clearly and ethically to a variety of audiences. This class requires neither an advanced knowledge of statistics nor any previous coding experience, just a curiosity about language and the ways in which identifying patterns in language can help us solve problems and understand our world.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [{"first_name": "Maria", "last_name": "Gomez Laich", "username": "mgomezla", "photo_url": null, "hours_per_week": 0, "tags": [], "semesters_taught": [{"semester": 2, "year": 2023}], "id": 3146}], "is_repeatable": false, "is_req_repeatable": false, "catalog_levels": [], "skills": [], "attributes": [{"name": "discussion intensive", "id": 2, "type": "attribute"}, {"name": "for non-majors", "id": 6, "type": "attribute"}, {"name": "research", "id": 14, "type": "attribute"}, {"name": "team project", "id": 17, "type": "attribute"}], "custom_fields": {"goals": "In this class, you will learnto develop hypotheses that predict or explain patterns of language use i.e., spoken conversation vs. academic articles, or research articles in one discipline vs. other disciplines, and test these hypotheses using appropriate corpus methods,to read research papers and distinguish between evidencebased conclusions and data cherrypicking,to apply corpus linguistic techniques such as concordancing, collocation and keywords to the analysis of different types of data,to perform corpus analysis using a range of corpus tools such as LancsBox,to interpret corpus data using corpus linguistic techniques,to design research studies that effectively pair corpus methods with research questions i.e., to know whenwhy a particular method willwill not work based on research goals andor data type, how to deal with small data sets common in the humanities,to collect your own corpora,to report the results of your study clearly and rigorously for a variety of audiences, andto recognize the benefits and limitations of corpus linguistics i.e., when corpus analysis is useful for answering a question and when an alternative might be better.", "key_topics": "This is a hands-on, project-based class that will help students build a methodological toolkit for\ncomputer-based textual analysis. That toolkit will include methods for the collection of data, its\nprocessing via off-the-shelf software and some simple code, as well as its analysis using a variety of\nstatistical techniques. In doing so, the class offers students the opportunity to engage in scientifically\noriented inquiry, giving priority to the use of corpus evidence to answer research questions. The first part\nof the term will be devoted to introducing fundamental concepts and taking a bird's eye view of the\npotential application of corpus methods in domains like academic writing, technical communication, and\nsocial media. From there, students will initiate projects of their own choosing and develop them over the\ncourse of the semester. The goal is to acquaint students with the strengths and limitations of computer-\nbased textual analysis and to provide them with the necessary foundational skills to design projects, to\napply appropriate quantitative methods, and to report their results clearly and ethically to a variety of\naudiences. This class requires neither an advanced knowledge of statistics nor any previous coding\nexperience, just a curiosity about language and the ways in which identifying patterns in language can\nhelp us solve problems and understand our world.", "prerequisite_knowledge": null, "assessment_structure": "Students will be assessed through: homework assignments, in-class assignments/labs, oral presentations (discussion leading), and a final project", "relevance": "This course offers students the opportunity to engage in scientifically oriented inquiry, giving priority to\nthe use of corpus evidence to answer research questions.", "learning_resources": "The following learning resources will be available for students: research papers, web pages, course-specific textbook, custom designed code, weekly support meetings for project development", "extra_time_commitment": null}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}