{"code": "79-223", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2019}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This course provides a survey of Mexican history and culture over a variety of periods, from the rise of the Aztec empire, to Spanish conquest and colonization, to national independence, to the Mexican Revolution and contemporary Mexico. A wide range of topics will be addressed, such as: race, ethnicity, and indigeneity; state formation and politics; national identity and the politics of memory; the border, migration, and the deportation regime; and the drug war.", "prerequisite_knowledge": "No prior knowledge necessary", "assessment_structure": "Mid-term exam and map quiz; two short interpretive essays; one 5-7 final essay.", "goals": "By the end of this course, students should understand diverse aspects of Mexican culture history and politics. Through readings, written assignments and classroom discussion, students should gain a deeper understanding of the historical, political, and cultural dimensions of some contemporary policy issues facing Mexico and the United States migration, deportation and racism in the United States, the drug war, rural and urban development, etc..", "relevance": "Students will discuss historical and anthropological scholarship on Mexico, but will also consider cultural documents of various kinds, like Mexican music, art, and food.", "learning_resources": "Texts, films.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This course provides a survey of Mexican history and culture over a variety of periods, from the rise of the Aztec empire, to Spanish conquest and colonization, to national independence, to the Mexican Revolution and contemporary Mexico.  A wide range of topics will be addressed, such as race, ethnicity, and indigeneity state formation and politics national identity and the politics of memory migration and the border and the drug war.  Students will discuss historical and anthropological scholarship on Mexico, but will also consider cultural documents of various kinds, like Mexican music, art, and food.", "short_name": "MEXCO:AZTEC EMP-DRUG", "co_reqs": [], "instructors": [{"username": "aaronmij", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 117, "semesters_taught": [{"semester": 2, "year": 2019}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Mexico: From the Aztec Empire to the Drug War", "base_name": "Mexico: From the Aztec Empire to the Drug War", "skills": [{"id": 1259, "name": "Anthropology", "slug": "anthropology"}], "success": true, "attributes": [{"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "diversity", "id": 3}, {"type": "attribute", "name": "global", "id": 7}, {"type": "attribute", "name": "interdisciplinary", "id": 10}, {"type": "attribute", "name": "reading intensive", "id": 13}, {"type": "attribute", "name": "writing intensive", "id": 18}]}