{"code": "79-268", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 3, "year": 2019}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The course will cover the military, political, social, and economic history of World War I, focusing on the war in Europe.", "prerequisite_knowledge": null, "assessment_structure": "Students will write four 2-3 essays and an 8- page take home final exam. They will participate in two debates. All assignments will be based on assigned class readings. See below.", "goals": "Students will learn about the causes of the war the life and death of soldiers during the war the incredible art and literature produced by soldiers military technological developments medical advances to treat soldiers the major battles that killed millions of men the wars destructive economic effects political opposition to the war.", "relevance": "The consequences of the First World War are still with us today. It destroyed Old Europe, contributed to Europe's economic decline and to the rise of the US as a world economic power, and led to the Russian Revolution, Fascist Italy and, less directly, Nazi Germany.", "learning_resources": "Primary source readings and articles will be posted on Canvas. Students will also read four books, including a memoir and a novel, which they will purchase.", "extra_time_commitment": "Reading and writing and debate preparation."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This course offers a comprehensive retrospective of the First World War in Europe.  Guiding questions will be How did a containable crisis between AustriaHungary and Serbia become the most murderous war Europe had ever experienced How did the war spill over into the Middle East  Why did the US enter the war Why did every General Staff follow unimaginative military strategies that turned the war into a bloody horror for soldiers  How did the war affect womens situation and rights  How did the war become a Total War that fomented social and political revolution and led to the downfall of four Empires", "short_name": "WWI:20TH C CATSTROPH", "co_reqs": [], "instructors": [{"username": "mhauser", "first_name": "Mark", "last_name": "Hauser", "tags": [], "hours_per_week": 0, "id": 3133, "semesters_taught": [{"semester": 3, "year": 2019}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "World War I: The Twentieth Century's First Catastrophe", "base_name": "World War I: The Twentieth Century's First Catastrophe", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "ethics", "id": 5}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "global", "id": 7}, {"type": "attribute", "name": "interdisciplinary", "id": 10}]}