{"code": "79-284", "name": "Muslim Representation in the Media and Popular Culture", "base_name": "Muslim Representation in the Media and Popular Culture", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "MUSLIM REPRESENTATIO", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1, 2], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 2, "year": 2017}, {"semester": 2, "year": 2020}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "This interdisciplinary course explores portrayals of Muslims across various media forms,including traditional oral and print media and contemporary outlets like music,television, news, art, and the Internet. This course examines the current creativeendeavors of Muslim writers, actors, musicians, and comedians. In this course, we willpair films, television shows, music, and comics with scholarship on Islam and religion inthe media, analyzing Muslim representation and storytelling in contemporary popularculture. A critical lens is applied to assess how gender and racial structures influenceMuslim portrayal, exploring both the perpetuation and the challenge to the perceptionof Muslims as religious and political outsiders. This course encourages students tocritically engage with modern media portrayals of Muslims, using examples such as theTV shows quotRamyquot and quotMan Like Mobeenquot that attempt to counter antiMuslim tropes.Through the use of survey data, quotes, and speeches like Riz Ahmed39s address to theU.K. House of Commons, this course explores the significance of media representationand its impact on the lived experiences of marginalized groups. Through collaborativeand individual learning activities, students will integrate diverse information sources,reflecting on the detrimental impact of stereotypes versus the empowering effect ofaccurate representation. The course aims to foster an understanding of the evolvingmedia landscape and the importance of inclusive narratives that challenge thehomogenization of Muslim identities.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "catalog_levels": [], "skills": [], "attributes": [{"name": "discussion intensive", "id": 2, "type": "attribute"}, {"name": "for non-majors", "id": 6, "type": "attribute"}, {"name": "interdisciplinary", "id": 10, "type": "attribute"}, {"name": "writing intensive", "id": 18, "type": "attribute"}, {"name": "intercultural & global lrng", "id": 22, "type": "attribute"}], "custom_fields": {"goals": "his course allows students to explore portrayals of Muslims in recent media. One of thegoals of this course is to expose students to unexpected media portrayals that don39talways receive widespread attention, such as stories about American Muslim womenwho are savvy entrepreneurs, fashion designers, musicians, and magazine editors, orthe history of the first Ford Motor plant in the U.S., which employed Muslims fromLebanon. Students will engage in independent and group learning to synthesizedifferent types of information from various sources to understand the harmful effects ofstereotypes and tropes in popular media juxtaposed with the humanizing effects ofrepresentation. They will learn about how the media landscape is changing and shouldcontinue to change to reflect narratives and storylines that accurately reflect the lives ofMuslims, challenging the notion that Muslims are a monolithic group. Students willcritically examine current media and popular culture and refine their analytical writingabilities.", "key_topics": "The course will use a geographic and historical toolkit to understand various types of conflict (e.g. ethnic and socio-environmental conflicts), and apply the geo-historical concepts to case studies of specific conflicts.", "prerequisite_knowledge": null, "assessment_structure": "Group Presentations, Class participation in discussions and weekly reflection journals,\nQuizzes, Final Research Paper - 50%", "relevance": "Students reading this course will be able to:\n1. Learn to analyze various media platforms, including literature, news clips/articles,\nmonuments and memorials, social media, and film and television series for portrayals of\nMuslims.\n2. Learn and practice performing interdisciplinary research using published and non-\npublished sources.\n3. Learn to become critical consumers of the news, asking questions such as who is\nfunding misinformation campaigns and how individuals who may or may not have\ncredentials are presented as &quot;experts,&quot; especially in the U.S. news media.\n4. Students will have access to platforms for collaboration and learn how to work\ntogether as a team.", "learning_resources": "Articles will be uploaded to canvas every week.", "extra_time_commitment": "For doing research for their presentations and final research paper , students will be\nrequired to spend extra time outside of the regularly scheduled course meeting times."}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}