{"code": "79-221", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2017}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This course examines the political, social, and cultural history of the United States after 1945, seeking to answer the question: How did we get from there to here, and what did the momentous post-World War II years mean for the ordinary Americans who experienced them? Readings and class discussion will examine political and economic transformation, civil rights, social movements, and intellectual debates over American identity and purpose within the context of new technologies, influential popular culture, shifting demographics, and international context. Primary sources, oral histories, scholarly secondary readings, and period films and media will provide lenses into the broad forces, institutional structures, and lived experiences of recent American history.", "prerequisite_knowledge": "No prior knowledge is required.", "assessment_structure": "There will be weekly readings. Students will be assessed on participation, take home (open book) examinations, and a series of short writing assignments and in-class group exercises.", "goals": "Students will gain skills in contextualization of sources and historical analysis that enable them to examine historical inflection points for resonances with the present day.", "relevance": "Students will encounter the history of a recent decades of U.S. history that shaped the present, exploring a recent past not-disimilar to the social and political context of 2021. Students interested in understanding the political, economic, cultural, and social movements from the 1940s to the 1990s that influenced the present, or who are more broadly desirous of learning more about deep histories of American society, identity, and the transformation of both will find the course of interest.", "learning_resources": "Course readings and assignments will be coordinated through a dedicated Canvas site. Students will access primary and secondary source readings, archival materials, oral histories, internet resources, and media clips.", "extra_time_commitment": "Students will be responsible for completing associated readings before each class session. Some class collaborative assignments may require communication and work among students outside of class hours."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This course examines the political, social, and cultural history of the United States after 1945, seeking to answer the question How did we get from there to here, and what did the momentous postWorld War II years mean for the ordinary Americans who experienced them Readings and class discussion will examine political and economic transformation, civil rights, social movements, and intellectual debates over American identity and purpose within the context of new technologies, influential popular culture, shifting demographics, and international context. Primary sources, oral histories, scholarly secondary readings, and period films and media will provide lenses into the broad forces, institutional structures, and lived experiences of recent American history.", "short_name": "ATOM BOMB TO 9/11", "co_reqs": [], "instructors": [{"username": "aaronmij", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 117, "semesters_taught": [{"semester": 1, "year": 2017}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "From the Atom Bomb to 9/11: United States History 1945-2001", "base_name": "From the Atom Bomb to 9/11: United States History 1945-2001", "skills": [{"id": 1825, "name": "Modern/Contemporary", "slug": "moderncontemporary"}, {"id": 1862, "name": "Economic Development", "slug": "economic-development"}], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "diversity", "id": 3}, {"type": "attribute", "name": "ethics", "id": 5}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "interdisciplinary", "id": 10}, {"type": "attribute", "name": "sustainability/environment", "id": 16}]}