{"code": "79-203", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2018}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This course is a survey of the history of modern Central and Eastern Europe, from late 18th to late 20th century. It begins with a focus on modern Habsburg empire, the rise of nationalism in mid 19th century, and the demise of the Austro-Hungarian empire following the First World War. It continues with an examination of the rise of illiberal politics during the interwar era, the Second World War, and the establishment of the communist regimes and the Soviet sphere of influence during the Cold War.", "prerequisite_knowledge": "Some knowledge of European history will help, but there is no official pre-requisite.", "assessment_structure": "*\tAttendance and participation (30%)\n*\tHistorical diaries of two avatars (55%)\no\tThe first diary (four entries, covering week 3-week 6) (10%)\no\tThe second diary (eight entries, covering week 7-week 14) (20%)\no\tTwo in-class presentations of your avatars (5% x 2 =10%)\n*\tTake-home final exam (30%)\n\nWeekly diary entries\n\nStarting with the third week of classes, you will impersonate two fictional historical characters (one at the time) who had lived in one or more locations in Central and Eastern Europe between 1848 and 1989. They will represent two generations of historical actors, whose long lives spanned a century and a half of radical political and social change.\n\nThe point of this exercise is for you to place this individual in the context of his/her own historical time. That is, you will constantly aim to link his or her life story (\"your\" story) to important events, historical actors, and social and political phenomena that had characterized the history of the interwar Central and Eastern Europe. In order to do so, you will use the class readings, as well as your discussion and lecture notes.\n\nThe assignment is also an exercise in historical imagination. You should feel free to describe your character's life (\"your life\") as creatively as you may wish. At the same time, you should aim for historical accuracy. That is, you should use this individual's story as a window onto broader historical events, by showing how they may have impacted specific groups of social actors (in this case, represented by your character and the other people in his or her own life).", "goals": "Students willIdentify key figures, events, and ideas informing the historical developments in modern and contemporary Central and Eastern Europe, and learn about their global impact.Analyze a variety of readings, including literary texts and visual materials, as historical sources by situating them in the historical and cultural context of their productionDevelop their historical imagination, by using the knowledge gained via lectures and readings and integrate it in the form of historical fiction they will write lengthy individual narratives in the form of historical diaries, fictional accounts of two historical characters that lived during these times.", "relevance": "Students will gain in-depth knowledge about the histories, cultures, and societies of a region that played a key role in global politics during the modern era, but whose importance is rather underestimated. Course materials include not only historical and anthropological readings, but also historical documents, memoirs, and documentaries. The main purpose of this wide selection is to encourage students to critically engage not only with the ideas and concepts explored in the readings, but also with the ways in which the citizens of these countries related to, rejected or embraced these ideologies and, willingly or forcefully, incorporated them into the subjective experience of their everyday lives.", "learning_resources": "Lectures, excerpts from textbooks, book chapters, and articles available as pdf-s on Canvas, two movies and one documentary to be watched in class (instead of lecture).", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "During the last two centuries, Central and Eastern Europe has been a political laboratorya region in which various political actors had attempted to launch and develop radical political and social experiments, from imperial reforms meant to strengthen and modernize the Habsburg empire, to the ethnic cleansing promoted by Nazi Germany and their acolytes in the region, to the attempts at establishing of a new social order under the postWWII communist regimes. An understanding of the profound and rapid political and social changes that have occurred in this region will enable you to see global politics in a new light, and better understand the modern era.     This course is a survey of the history of modern Central and Eastern Europe, from late 18th to late 20th century. It begins with a focus on modern Habsburg empire, the rise of nationalism in mid 19th century, and the demise of the AustroHungarian empire following the First World War. It continues with an examination of the rise of illiberal politics during the interwar era, the Second World War, and the establishment of the communist regimes and the Soviet sphere of influence during the Cold War.    Course materials include secondary historical analyses, primary sources, memoirs, and documentaries. The course will rely heavily on the format of interactive lecturesa combination of lecture and discussion, which will productively challenge the students to engage with the material in a critical manner, and will help them contextualize and enrich the knowledge they gain from the course readings.", "short_name": "CENTRAL & EAST EUROP", "co_reqs": [], "instructors": [{"username": "aaronmij", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 117, "semesters_taught": [{"semester": 1, "year": 2018}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "The Other Europe: The Habsburgs, Communism, & Central/Eastern Europe, 1740-1990", "base_name": "The Other Europe: The Habsburgs, Communism, & Central/Eastern Europe, 1740-1990", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "diversity", "id": 3}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "global", "id": 7}, {"type": "attribute", "name": "reading intensive", "id": 13}, {"type": "attribute", "name": "research", "id": 14}]}