{"code": "79-253", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2020}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": true, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The course covers major themes in South Asian history, such as colonialism, nationalism, decolonization, and nation-building.", "prerequisite_knowledge": "No prior knowledge needed", "assessment_structure": "Participation in recitations, research paper, quizzes, final essay.", "goals": "Students will improve their skills in several areas including historiographical knowledge, critical thinking, and analytical writing.", "relevance": "Students will get an understanding of the legacy of imperialism in contemporary South Asia and the process of decolonization and nation-building in South Asia.", "learning_resources": null, "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "Home to a diversity of cultures, languages, and histories, the population of South Asia is linked through a common experience of European colonialism in the nineteenth and early twentieth centuries. Virtually all of the contemporary nationstates of South Asia achieved independence from European colonial powers in the middle of the twentieth century, most between the 1940s and 1960s.  With a focus on South Asian history, this course will include introductory sessions on precolonial interaction and the early modern world. The bulk of the course will focus on colonialism, nationalism, and decolonization from the early nineteenth century to the midtwentieth century. In addition to assessing the legacies of colonialism in the present day, the course will interrogate the differences between colonial and postcolonial experiences across the South Asian world. It will further examine the challenges and trials confronting the new states after decolonization, in particular, their search not only for new political frameworks to replace the colonial structures they had discarded, but also for solutions to mitigate the issues of social integration, interstate conflict and regional cooperation.", "short_name": "IMPRL DECOL ASIA", "co_reqs": [], "instructors": [{"username": "deepanai", "first_name": "Deepa", "last_name": "Nair", "tags": [], "hours_per_week": 0, "id": 4190, "semesters_taught": [{"semester": 2, "year": 2020}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": true, "topic": null, "name": "Imperialism and Decolonization in South Asia", "base_name": "Imperialism and Decolonization in South Asia", "skills": [], "success": true, "attributes": []}