{"code": "79-240", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2018}, {"semester": 3, "year": 2019}, {"semester": 3, "year": 2020}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This course will cover the development of American culture, particularly the evolving concept of freedom. Key topics will include slavery and emancipation, the ongoing struggle for civil rights for Americans of varied backgrounds, technological and social developments, and popular culture.", "prerequisite_knowledge": "As an introductory survey, little prior knowledge of American history is assumed. Studets should be proficient with basic technology assumed of any college student (Word, email, etc).", "assessment_structure": "This course will require reading portions of selected books, the completion of three short blog posts (and discussion comments), the completion of three short essays, one final essay, and participation in class discussions.", "goals": "Students will understand the development of American culture across over four centuries of history. Students will understand that key concepts centrally freedom, are not static but rather undergo change relative to social needs and goals of their respective eras.", "relevance": "This course will pay careful attention to the valuable contributions Americans from diverse backgrounds (spanning racial, class, gender, and ethnic groups) made to the country's evolving notion of freedom.", "learning_resources": "Certain readings and relevant primary source material will be distributed to students through a Canvas site. The course will also rely on books and reading material available through the campus bookstore or library. Lectures will be offered to the class via PowerPoint presentations.", "extra_time_commitment": "No extra time will be expected beyond the time required to complete course assignments."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This is an introductory survey of American history from colonial times to the present. The course focuses on cultural history instead of the more traditional emphasis on presidents, wars, and memorizing facts or timelines. The major theme of the course is the changing meaning of freedom over three centuries. Required readings include several short books and historical documents, which will be paired with class lectures to provide students with context needed to think about and understand Americas cultural history. Assignments will include three short essays and a final research project on a form of popular culture of the students choosing, developed over the course of the semester through three short blog posts.", "short_name": "DVLP AMERICAN CLTR", "co_reqs": [], "instructors": [{"username": "aaronmij", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 117, "semesters_taught": [{"semester": 2, "year": 2018}], "photo_url": null}, {"username": "alkatz", "first_name": "Amanda", "last_name": "Katz", "tags": [], "hours_per_week": 0, "id": 2631, "semesters_taught": [{"semester": 3, "year": 2020}], "photo_url": null}, {"username": "mhauser", "first_name": "Mark", "last_name": "Hauser", "tags": [], "hours_per_week": 0, "id": 3133, "semesters_taught": [{"semester": 3, "year": 2019}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Development of American Culture", "base_name": "Development of American Culture", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "for non-majors", "id": 6}]}