{"code": "79-323", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 3, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The course examines urban environments in the global context, tracing ways in which cities have modernized.", "prerequisite_knowledge": null, "assessment_structure": "Students will read extensively, write a few short papers, and give an oral presentation on one urban case study.", "goals": "Students will learn that cities are everchanging environments and that urban experiences differ vastly around the world based on race, class, gender, economy, and politics.", "relevance": "Students will understand how humans live in urban environments and the impacts of such lifestyles on a global scale.", "learning_resources": "Students will read course textbooks (no more than four) and additional readings will be uploaded to the course Canvas site.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "Cities have been a feature in the landscapes of human settlement for nearly 6000 years.  This course will examine the origins and evolution of cities by examining the role of urban areas in the economic, cultural, political, and environmental history of the world. The main line of inquiry for this course emphasizes the culture of cities and the processes of urbanization that give rise to them. Students will explore why and how cities form, the functions they serve, the ways of life they support, and the problems and opportunities to which they give rise. Cities are socially and politically contested spaces, and observers of urban life have longsought to understand the process of urbanization and the consequences of living in cities. Some argue that cities represent the crowning achievement of modernity others suggest that cities are isolating and alienating, fostering discord, rather than social cohesion. The course integrates work by historians, urban planners, architects, political scientists, geographers, and sociologists to provide a comprehensive set of tools to understand and analyze modern urban life.", "short_name": "MKG MOD CITIES", "co_reqs": [], "instructors": [{"username": "alkatz", "first_name": "Amanda", "last_name": "Katz", "tags": [], "hours_per_week": 0, "id": 2631, "semesters_taught": [{"semester": 3, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Making Modern Cities", "base_name": "Making Modern Cities", "skills": [{"id": 1148, "name": "Historical European", "slug": "historical-european"}, {"id": 1265, "name": "Medieval History", "slug": "medieval-history"}, {"id": 1266, "name": "Modern History", "slug": "modern-history"}], "success": true, "attributes": [{"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "diversity", "id": 3}, {"type": "attribute", "name": "global", "id": 7}, {"type": "attribute", "name": "interdisciplinary", "id": 10}, {"type": "attribute", "name": "reading intensive", "id": 13}]}