{"code": "79-389", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 3, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The course examines the intersections of nature and technology as they shape the environments in which humans live and work.", "prerequisite_knowledge": null, "assessment_structure": "Students will read extensively, write a few short papers, and will take turns presenting their assessments of course readings", "goals": "Students will learn the ways in which humans are impacted by environmental factors, and how human progress alters those same landscapes.", "relevance": "Students will understand the interconnectivity and reciprocity between our environment and technological innovations.", "learning_resources": "Students will read course textbooks (no more than four) and additional readings will be uploaded to the course Canvas site.", "extra_time_commitment": "No extra time commitments outside the usual for reading and other course-related assignments."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This course explores the intersection of history of technology and environmental history, more specifically, it provides a historical overview of the interactions between people and their environment. Focusing primarily on the postColumbian Exchange, this course offers a global history of the material world, both natural and artificial, and interrogates the influence of nature climate, topography, plants, animals, and microorganisms on human history and the reciprocal influence of people on nature artificial intelligence, industry, consumption, the built environment. Topics may include largescale technological systems invasive species in history commodification of nature and technology the environmental impact of technology artificial life nature and bureaucracy war and nature pollution and the roots of the current environmental crisis. Readings may include those such as Medieval Robots, Greyhound Nation, Gathering Moss, Desert Passages, and Floating Coast, among other selected articles.", "short_name": "NATURE TECH ENVIRON", "co_reqs": [], "instructors": [{"username": "alkatz", "first_name": "Amanda", "last_name": "Katz", "tags": [], "hours_per_week": 0, "id": 2631, "semesters_taught": [{"semester": 3, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Nature, Technology, and the Environment", "base_name": "Nature, Technology, and the Environment", "skills": [{"id": 1266, "name": "Modern History", "slug": "modern-history"}], "success": true, "attributes": [{"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "diversity", "id": 3}, {"type": "attribute", "name": "global", "id": 7}, {"type": "attribute", "name": "interdisciplinary", "id": 10}, {"type": "attribute", "name": "reading intensive", "id": 13}, {"type": "attribute", "name": "sustainability/environment", "id": 16}]}