{"code": "79-300", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 3, "year": 2018}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This course will describe and analyze aspects of the development of public policy in the United States from the colonial era to the present, with a focus on the post-Civil War era. Specific topics to be covered are immigration and health care and health insurance.", "prerequisite_knowledge": "Students should have a basic introductory-level understanding of American History.", "assessment_structure": "Students' Final Grade will be based on:\nPolicy Brief on Healthcare and Health Insurance\nPolicy Brief on Comprehensive Immigration Reform\nParticipation in Debates (students participate in one of two scheduled debates)\nParticipation and Attendance", "goals": "1 Describe past domestic public policy debates in the United States that exemplify a broad range of historical and contemporary concerns.2 Describe some aspects of the expansion and contraction of federal intervention in social and economic life over the past 200plus years, and evaluate arguments for and against these actions.3 Critically apply the lessons learned in this class to other courses you take at Carnegie Mellon.4 Advocate for particular policy choices using the knowledge gained in this course.", "relevance": "Immigration and healthcare are at the forefront of public policy conversations today, particularly in the context of Donald Trump's efforts to \"build the wall\" at the border of the United States and Mexico and debates within the Democratic Party about single payer health insurance, often described as \"Medicare for All.\". This course will put these debates in historical perspective and also provide the knowledge students need to imagine and enact policies that can make the public safer, healthier, and more tolerant, while recognizing America's long-standing ambivalence about immigration and government intervention in medicine.", "learning_resources": "Students will be required to do assigned readings, listen to podcasts/media broadcasts, and watch documentaries that involve immigration and healthcare/health insurance. We will also likely follow debates surrounding the 2020 election that are relevant to the class.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This course will describe and analyze aspects of the development of public policy in the United States from the colonial era to the present, with a focus on the postCivil War era. For the purposes of this course, public policy will be defined as the making of rules and laws and their implementation by government 1 in response to the failure of private actors i.e., markets to reach desirable outcomes 2 to regulate markets to influence their outcomes or 3 in an attempt to achieve a particular normative vision of what society ought to be like. This course assumes that the public policy landscape is complex but still comprehensible given the proper set of analytical frameworks and appropriate historical background. Particular emphasis will be placed on changing views about the authority of the government to intervene in economic and social issues the best way to balance individual and collective interests and the variability within society of the life courses of individuals. Topics to be covered include immigration and health carehealth insurance, among others.", "short_name": "HSTRY AMERCN PUB POL", "co_reqs": [], "instructors": [{"username": "dbusch", "first_name": "David", "last_name": "Busch", "tags": [], "hours_per_week": 0, "id": 2952, "semesters_taught": [{"semester": 3, "year": 2018}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "History of American Public Policy", "base_name": "History of American Public Policy", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "diversity", "id": 3}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "interdisciplinary", "id": 10}, {"type": "attribute", "name": "reading intensive", "id": 13}, {"type": "attribute", "name": "writing intensive", "id": 18}]}