{"code": "79-393", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2018}, {"semester": 2, "year": 2019}, {"semester": 2, "year": 2020}, {"semester": 2, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The course will examine the development of the Roman Catholic Church as well as its impact on European and World history. Main topics will include the transition between pagan antiquity and Medieval Christianity, church infrastructure, church/state conflict, the Crusades, the papal court, Protestantism, the Counter-Reformation, and the role of the church in the modern era.", "prerequisite_knowledge": null, "assessment_structure": "Students will be assessed on their analytical writing (both short and long papers), on lecture content, and on classroom engagement.", "goals": "Students will hone their historical analysis and writing skills, and will gain greater knowledge about an institution that is still relevant to modern political and social life", "relevance": "Students will improve their history-related skills as well as gain greater understanding of the context that informs modern events, especially those in the religious and political sphere.", "learning_resources": "There is one assigned course book, Bettenson and Maunder's Documents of the Christian Church. All other readings will be hosted on canvas", "extra_time_commitment": "Students are expected to spend about six hours a week, exclusive of classroom hours, reading assigned texts, studying for the quizzes, and writing short and long essays."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This course is only offered at Carnegie Mellons campus in Qatar. This course will explore the history of the Catholic Church, with a particular focus on the church as an evolving European institution. Although we will have to deal with theological arguments at times, abstract theology will not be the focus of the course. Instead, the course will be centered on two main questions. First, how did the Catholic Church manage to persist, for nearly two millennium, as a stable institutional entity within an everchanging European milieu Secondly, to what degree did the Catholic Church influence andor reflect developments within Western European culture", "short_name": "INST OF ROMAN CHURCH", "co_reqs": [], "instructors": [{"username": "breilly2", "first_name": "Benjamin", "last_name": "Reilly", "tags": [], "hours_per_week": 0, "id": 1713, "semesters_taught": [{"semester": 2, "year": 2018}, {"semester": 2, "year": 2019}, {"semester": 2, "year": 2020}, {"semester": 2, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Institutions of the Roman Church", "base_name": "Institutions of the Roman Church", "skills": [{"id": 1004, "name": "Western", "slug": "western"}], "success": true, "attributes": [{"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "reading intensive", "id": 13}, {"type": "attribute", "name": "research", "id": 14}, {"type": "attribute", "name": "writing intensive", "id": 18}]}