{"code": "79-395", "offered_in_campuses": [1], "offerings": [{"semesters": [], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The course will examine the arts in Pittsburgh, both historically and in the present.", "prerequisite_knowledge": "No prior knowledge required.", "assessment_structure": "Active reading, book reports, a research paper, and a journal of cultural events and experiences.", "goals": "To make students active citizens who participate in the cultural life of their community.", "relevance": "Students will learn about and experience several key components of modern-day cultural life in Pittsburgh.", "learning_resources": "The \"curriculum\" will derive from the artistic presentations themselves, which will provide a springboard for reading assignments and research papers in the history of music and art.", "extra_time_commitment": "Availability to attend musical events and art exhibits on several Thursday, Friday and Saturday evenings."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This course will examine the arts in Pittsburgh, both historically and in the present. We will focus especially on musical events and art exhibits scheduled by the citys museums and concert halls during the current semester. The curriculum in other words will derive from the artistic presentations themselves, which will provide a springboard for reading assignments, seminar discussions, and research papers in the history of music and art. We will also examine the historical development of cultural institutions in Pittsburgh. The History Department will pay for students admission to all museums. However, students will be charged a supplemental fee at significantly discounted prices to help subsidize the considerable expense of purchasing tickets for concerts and performances by the Pittsburgh Symphony, Pittsburgh Opera, Chamber Music Society, and Renaissance and Baroque Society. Attendance at all musical events and art exhibits is required. Prerequisite Please check your overall course schedule you must be available for twothree hours to attend art exhibits on several Saturday afternoons, and to attend musical events on several Monday, Friday andor Saturday evenings.", "short_name": "ARTS IN PITTSBURGH", "co_reqs": [], "instructors": [], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "The Arts in Pittsburgh", "base_name": "The Arts in Pittsburgh", "skills": [{"id": 1001, "name": "Eventing", "slug": "eventing"}, {"id": 1353, "name": "Performing Arts", "slug": "performing-arts"}], "success": true, "attributes": [{"type": "attribute", "name": "interdisciplinary", "id": 10}]}