{"code": "79-378", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}, {"semester": 2, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The course covers themes in history of South Asia, such as gender, politics, culture.", "prerequisite_knowledge": null, "assessment_structure": "Participation in recitations, research paper, quizzes, final essay.", "goals": "Students will learn to think critically, analyze primary source documents, and see compare womens position and gender relations in South Asia with the corresponding situations in their societies.", "relevance": "Students will get an understanding of women's position and gender relations in South Asia from a historical perspective.", "learning_resources": null, "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This course introduces students to womens position and gender relations in South Asia from a historical perspective.  Using gender as a lens of examining the past, we will examine how politics of race, class, caste and religion affected and continue to impact women in South Asian countries, primarily in India, Pakistan, Bangladesh and Sri Lanka. Attention is drawn to the processes by which gender is socially constructed, the prevalent forms of gender disparity and discrimination, as well as the factors of change to which these are subject. These themes are situated in the broader context of the regions history, society, and culture. We will reflect upon current debates within South Asian womens history in order to examine some of the issues and problems that arise in rewriting the past from a gendered perspective. The chronological focus of this course is on the condition of women in the subcontinent from the ancient times till the present day. Students are encouraged to make comparisons between womens position and gender relations in South Asia with the corresponding situations in their societies. Analysis and appreciation of the crosscultural aspects of womens position and gender disparity constitute integral elements of the envisaged learning outcomes of this course. It would be of general interest to all students concerned about womens position and gender issues, as well those interested in South Asia. To help us evaluate the different historical and temporal experiences of South Asian women, this course will extensively use primary documents, secondary readings, films, and contemporary newspaper and Internet articles. Students will be required to actively engage and participate in class discussions and group debates, which will form a substantial part of individual evaluations.", "short_name": "GENDER SOUTH ASIA", "co_reqs": [], "instructors": [{"username": "deepanai", "first_name": "Deepa", "last_name": "Nair", "tags": [], "hours_per_week": 0, "id": 4190, "semesters_taught": [{"semester": 2, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}, {"semester": 2, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Gender in South Asia", "base_name": "Gender in South Asia", "skills": [], "success": true, "attributes": []}