{"code": "79-453", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The research field of water & development is concerned with social and economic inequality in water access, delivery, and supply", "prerequisite_knowledge": null, "assessment_structure": "Complete all course readings as assigned; take an open-notes reading quiz or complete short written assignments before the beginning of each class; participate in class discussion; participate in small group activities during class time; complete a short group project with individual component", "goals": "By the end of this course, students should be able to give their own answers to these questions What are some important social, cultural, and political aspects of drinking water, sanitation, dams, development, irrigation, and scarcity What are some common problems for public conversations and barriers to communication about water How can we interpret historical primary sources to understand more about social and political aspects of water What are some global and regional trends in water resource development", "relevance": "Clean water is necessary for all life; this course examines theories, debates, and controversies about supplying water for each person", "learning_resources": "Ebooks available through CMU Libraries and pdfs linked through Canvas.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "Water is necessary for all forms of life on Earth. An estimated 1 billion humans do not have satisfactory drinking water an estimated 2 billion do not have access to adequate sanitation facilities for human health, safety, and dignity.  For more than a hundred years, to address social inequalities in access to water, international organizations and scholars have created their own theories and ideas about providing water. This international community points out the social and cultural implications of technical provision of water resources. These debates about development showcase diverse theories, recommendations, and contradictions. The purpose of this course is to introduce students to critical studies of water and development. We will consider complex stories of social change, including unintended consequences human and environmental impacts and debates among experts.", "short_name": "GLOBAL WATER AND DEV", "co_reqs": [], "instructors": [{"username": "aeowen", "first_name": "Abigail", "last_name": "Owen", "tags": [], "hours_per_week": 0, "id": 448, "semesters_taught": [{"semester": 2, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Global Water and Development", "base_name": "Global Water and Development", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "global", "id": 7}, {"type": "attribute", "name": "reading intensive", "id": 13}, {"type": "attribute", "name": "sustainability/environment", "id": 16}]}