{"code": "80-100", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 3, "year": 2018}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This problems-based course tackles a number of issues in several subfields of philosophy, including (for instance) questions of what knowledge is and whether and to what extent we can achieve it (epistemology); how (if it all) we can access what the world really is rather than simply how it appears (metaphysics); whether morality is objective and, if it is, what it requires of us (ethics); and why and when we might be obligated to obey the law (political philosophy).", "prerequisite_knowledge": "No prior knowledge required.", "assessment_structure": "Past classes have used a combination of three kinds of assignments: low-stakes short writing assignments due on a regular basis, the occasional essay-based exam, and one or two argumentative philosophy papers", "goals": "In addition to giving students a general overview of some important philosophical topics and diverse methods of philosophical research and analysis, the course is also designed to help students to recognize and evaluate arguments, and to develop convincing arguments of their own.", "relevance": "Dietrich GenEd prior to Fall 2021: Reflecting\nDietrich GenEd after Fall 2021: Disciplinary Perspectives - Humanities\n\nIn addition to giving students a general overview of some important philosophical topics, the course is also designed to help students to recognize and evaluate arguments, and to develop convincing arguments of their own.", "learning_resources": "A textbook may or may not be required. Many readings will be available as PDFs on the course Canvas page.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}, {"sem": 3, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "Even philosophers have a hard time explaining what exactly philosophy is. Instead of attempting a definition, one might instead list some of the questions philosophers try to answer. Like most other academic fields, philosophy has its own subdisciplines, and each of these has its own questions it tries to answer. In this course, we will be looking at questions from several of these areas of philosophy, including What is the mind Do we have free will What does the answer to that question mean for practices of reward and punishment Is morality relative What, if anything, is its connection to religion How can I know the right thing to do How can I know anything This class isnt a historical introduction to philosophy, and we will be jumping around through history and subjects as we please, concerned only with interesting questions and good answers. As a whole, the course will strongly emphasize some of the basic skills of doing just about any kind of philosophy how to recognize and understand arguments, how to evaluate them, and how to construct your own. As it turns out, these are skills you need to successfully navigate your way through just about any field of study and any career. This course will include a fair amount of writing, but youll be getting lots of help from me, from your TA, and even from your peers.", "short_name": "INTRO TO PHILOSOPHY", "co_reqs": [], "instructors": [{"username": "connorr", "first_name": "Connor", "last_name": "Robinson-Arnull", "tags": [], "hours_per_week": 0, "id": 2795, "semesters_taught": [{"semester": 3, "year": 2018}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Introduction to Philosophy", "base_name": "Introduction to Philosophy", "skills": [{"id": 1263, "name": "Philosophy", "slug": "philosophy"}], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "ethics", "id": 5}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "reading intensive", "id": 13}, {"type": "attribute", "name": "writing intensive", "id": 18}]}