{"code": "80-130", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2019}, {"semester": 1, "year": 2021}, {"semester": 2, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Ethics, Moral Philosophy", "prerequisite_knowledge": "No prior knowledge necessary", "assessment_structure": "Exams (largely essay in format), papers, regularly assigned small writing assignments, and participation", "goals": "Explaining, and critiquing, the philosophical foundations of different sides taken on a number of pressing ethical issues. Applying moral theories not only to moral controversies discussed in class, but to other morally charged issues as well. Recognizing, reproducing, and critiquing arguments, as well as creating your own philosophical arguments. Producing a good philosophical paper engaging with the theorists, issues, and positions we discuss, thus preparing you to write good papers in other philosophical subjects.", "relevance": "Dietrich GenEd prior to 2021: Deciding\n\nStudents will learn the basics of philosophical ethics.", "learning_resources": "A textbook will likely be assigned.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "Philosophical ethics, or moral philosophy, covers a lot of ground. It asks and tries to answer questions like Whats good in life What matters What should I and others do How should I and others act What kinds of things out there must be treated ethically Do we have moral duties to at least some nonhuman animals Is morality subjective Are there actually any objective moral truths Morally speaking, what if anything is the difference between killing someone, and simply letting them die In trying to answer these questions and others, well engage in some wonderfully weird thought experiments, class discussions, smaller group discussions, debates, etc. Well study and critique several moral theories which try to explain and help guide our moral judgments, and well try to apply these theories to reallife moral controversies. Past classes covered topics including drug prohibition, abortion, euthanasia, and physicianassisted suicide. This is an introductory philosophy class, so youll be learning how to read, critique, do, and write philosophy generally, not just ethics. Considerable time and effort, both in lectures and in recitations, will be spent helping you learn to recognize and evaluate philosophical arguments, as well as empowering you to create, improve, and defend your own arguments in class assignments.", "short_name": "INTRO TO ETHICS", "co_reqs": [], "instructors": [{"username": "pwalsh", "first_name": "Patrick", "last_name": "Walsh", "tags": [], "hours_per_week": 0, "id": 2568, "semesters_taught": [{"semester": 1, "year": 2019}, {"semester": 1, "year": 2021}], "photo_url": null}, {"username": "cdimitri", "first_name": "Cristian", "last_name": "Dimitriu", "tags": [], "hours_per_week": 0, "id": 5479, "semesters_taught": [{"semester": 2, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Introduction to Ethics", "base_name": "Introduction to Ethics", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "ethics", "id": 5}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "writing intensive", "id": 18}]}