{"code": "80-244", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2021}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Obligations to other people, animals, species and ecosystems; the scope and nature of individual responsibility to address climate change.", "prerequisite_knowledge": "No prior knowledge necessary", "assessment_structure": "Exams (largely essay in nature), group work, regular small writing assignments", "goals": "Learn some important moral theories, as well as some important objections they face. Thoughtfully consider what these theories can tell us about how we should use natural resources, live alongside other people both inside and outside political borders in a just manner, live alongside other nonhuman living things, and leave the world for future generations. Develop wellreasoned views about policies societies should implement to solve important environmental issues and what part the student, as an individual, should play in resolving these issues. More generally, hone her critical reasoning skills, learn about important environmental concerns and philosophical issues.", "relevance": "Dietrich GenEd prior to 2021: Deciding\n\nStudents will discuss philosophical ethics and its application to various environmental questions (e.g. animal agriculture, climate change).", "learning_resources": "All readings will be made available via Canvas", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "In this class, well try to figure out what obligations we might have to the natural environment and the nonhuman living beings within it, as well as what justice requires of us in our use of natural resources given the needs of other human beings. Among other things, well spend considerable time on animal ethics What moral obligations do we have to nonhuman animals Is it morally OK to eat them Does a dog count morally speaking as much as a human Does a factoryfarm chicken count as much as a wild endangered tiger Then, given that many of the most pressing environmental problemslike climate changeare collective action problems, well consider why these problems are so sticky, what obligations we have as individuals in dealing with these problems, and what a just collective solution might look like. To that end, well examine the processes fueling climate change, well look at who is responsible for these processes, and well try to determine whether any current proposal to deal with climate change is an effective, just response to the problem.", "short_name": "ENVIRONMENTAL ETHICS", "co_reqs": [], "instructors": [{"username": "pwalsh", "first_name": "Patrick", "last_name": "Walsh", "tags": [], "hours_per_week": 0, "id": 2568, "semesters_taught": [{"semester": 2, "year": 2021}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Environmental Ethics", "base_name": "Environmental Ethics", "skills": [{"id": 20, "name": "Natural Sciences", "slug": "natural-sciences"}, {"id": 160, "name": "Environmental Science", "slug": "environmental-science"}], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "ethics", "id": 5}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "sustainability/environment", "id": 16}, {"type": "attribute", "name": "writing intensive", "id": 18}]}