{"code": "80-208", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2017}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This course is an introduction to practical reasoning. The course will contain an elementary introduction to concepts important for reasoning and decision making, such as validity, probability, and utilities. In addition, students will learn about a wide variety of statistical, logical, psychological, and causal fallacies that are used to mislead people.", "prerequisite_knowledge": "No prior knowledge required.", "assessment_structure": "There will readings and homework assignments.", "goals": "Students will learn how to evaluate real world arguments from a variety of resources, and to detect fallacies designed to mislead them.", "relevance": "Students will learn about practical reasoning, and various kinds of fallacies used to mislead people.", "learning_resources": "Students will extensively practice critically analyzing and evaluating a wide variety of arguments found in newspapers, magazines, and elementary accounts of scientific reasoning. In order to help students develop the skills to analyze and evaluate arguments, the course will introduce several software packages recently developed at CMU that help students diagram arguments and causal reasoning; these packages have been shown to improve students critical reasoning skills.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This course is an introduction to practical reasoning. The course will contain an elementary introduction to concepts important for reasoning and decision making, such as validity, probability, and utilities. Students will extensively practice critically analyzing and evaluating a wide variety of arguments found in newspapers, magazines, and elementary accounts of scientific reasoning. In order to help students develop the skills to analyze and evaluate arguments, the course will introduce several software packages recently developed at CMU that help students diagram arguments and causal reasoning these packages have been shown to improve students critical reasoning skills. In addition, students will learn about a wide variety of statistical, logical, psychological, and causal fallacies that are used to mislead people.", "short_name": "CRITICAL THINKING", "co_reqs": [], "instructors": [{"username": "degray", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 932, "semesters_taught": [{"semester": 1, "year": 2017}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Critical Thinking", "base_name": "Critical Thinking", "skills": [{"id": 63, "name": "Critical Thinking", "slug": "critical-thinking"}], "success": true, "attributes": [{"type": "attribute", "name": "reading intensive", "id": 13}]}