{"code": "80-210", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Introduction to modern logic and its uses for the analysis of arguments.", "prerequisite_knowledge": "No prior knowledge necessary.", "assessment_structure": "Weekly homework assignments in a web-based system, two midterms and a final (also on the web), presentations during discussion sessions.", "goals": "By the end of this course, students will be able toAnalyze informal arguments.Construct correct arguments and refute invalid ones.Use the learned techniques to structure arguments and present them.Apply logical techniques that are used in mathematics and recognize that many can be shown to be derived rules in the logical system.Understand the significance of logic in philosophy, mathematics, and computer science.", "relevance": "Dietrich GenEd Prior to Fall 2021: Modeling - Math\nDietrich GenEd After Fall 2021: Logic / Mathematical Reasoning\n\n\"Preparing for life\", students can use the skills from this course to improve their thinking, and also be well prepared for more advanced courses in philosophy, mathematics, and computer science.", "learning_resources": "The material is presented in a highly interactive OLI course. It provides rich resources for individual learning. The latter is complemented by weekly discussion sections in small groups of no more than 15 students. Additional reading material is made available on Canvas.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}, {"sem": 3, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": "https://oli.cmu.edu/courses/logic-proofs/", "long_desc": "Logic  Proofs is a webbased course and introduces students to central issues in modern logic.  It is designed for individual learning with rich interactive environments and dynamic intelligent tutoring. The material is presented online, and most exercises are done online as well. Readings of historical and philosophical character complement the core content. This online course is supplemented, indeed given additional grounding, by weekly meetings in very small groups. There, we have collaborative reviews, substantive discussions and critical reflections.  The central question of the course is this  How can we analyze the structure of rational discourse or, more specifically, the logical structure of argumentation  An answer to this question requires i uncovering the logical form of statements ii defining the correctness of logical steps iii formulating inference rules for the logical forms iv designing strategies for argumentation with the inference rules. The course takes these steps for both sentential and quantificational logic.", "short_name": "LOGIC AND PROOFS", "co_reqs": [], "instructors": [{"username": "pwalsh", "first_name": "Patrick", "last_name": "Walsh", "tags": [], "hours_per_week": 0, "id": 2568, "semesters_taught": [{"semester": 1, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Logic and Proofs", "base_name": "Logic and Proofs", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "for non-majors", "id": 6}]}