{"code": "80-251", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 3, "year": 2018}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This is a course in the history of (mostly) Western philosophy, focusing mainly (but not entirely) on the years 1500-1800, and paying special attention to issues in the theory of knowledge (what it is, how (if it all) we can attain it) and metaphysics (how we can tell reality from mere appearance). But we'll cover other questions as well, and we'll also look at some more recent theorizing on these and related issues.", "prerequisite_knowledge": "No prior knowledge required.", "assessment_structure": "Past classes have used a combination of three kinds of assignments: low-stakes short writing assignments due on a regular basis, the occasional essay-based exam, and one or two argumentative philosophy papers.", "goals": "1 Describe some of the issues and debates engaged in within this period, and articulate a reasoned defense of your own view on each issue or debate. 2 Identify arguments made within these debates, and charitably and accurately express the content and logical structure of these arguments in your own words. 3 Identify how these arguments are supposed to work, and evaluate them on the basis of the quality of the arguments given, i.e. by evaluating a the truth values of an arguments premises, and b the actual strength of its inferences. 4 Building on previous Construct and critique various counterexamples and thought experiments for and against a position. 5 Critique the arguments of others, and present your own, within wellcrafted, wellreasoned essays.", "relevance": "This class covers important topics as considered by some of the most discussed philosophers in the Western philosophical tradition. Familiarity with their theories is important for a full appreciation of this tradition, but it's also of interest for folks new to philosophy.", "learning_resources": "Readings will be available as PDFs or links available via the course Canvas page.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "This class will focus on the history of Western philosophy in the modern period, with special emphasis on the early modern era of roughly 16001800. Massive upheavals and conflicts in science, politics, and religion fueled attempts to find new ways of making sense of the world, and we will try to situate our philosophers within this rapidly evolving intellectual context. In particular, we will examine the impact of these changes on two subfields of philosophy metaphysics the study of the nature of reality, distinguishing it from mere appearance, and epistemology roughly, the study of knowledge itself. We will ask, and attempt answers for, questions like What is knowledge, can we achieve it, and if so, to what extent To what extent, if any, can our most basic scientific instruments, the human senses, lead us to the true nature of the world These questions will unavoidably send us down paths into other subfields, like philosophies of mind, of free will, of ethics, and of religion. After reading early modern philosophers like Ren Descartes, Princess Elizabeth of Bohemia, John Locke, David Hume, and Immanuel Kant, we will turn to some more recent work in the modern and contemporary eras to see what lessons if any were learned, and what new approaches if any have been taken in the quest for knowledge and reality.", "short_name": "MODERN PHILOS", "co_reqs": [], "instructors": [{"username": "connorr", "first_name": "Connor", "last_name": "Robinson-Arnull", "tags": [], "hours_per_week": 0, "id": 2795, "semesters_taught": [{"semester": 3, "year": 2018}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Modern Philosophy", "base_name": "Modern Philosophy", "skills": [{"id": 322, "name": "Scientific Methods", "slug": "scientific-methods"}, {"id": 1004, "name": "Western", "slug": "western"}, {"id": 1263, "name": "Philosophy", "slug": "philosophy"}], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "reading intensive", "id": 13}, {"type": "attribute", "name": "writing intensive", "id": 18}]}