{"code": "80-201", "offered_in_campuses": [1], "offerings": [{"semesters": [], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This is the university's basic course on Epistemology, the central branch of philosophy concerned with the nature of belief, knowledge, truth, and justification. Topics include Bayesian rationality, the analysis of knowledge, and the over-arching debate between coherentist and foundationalist accounts justification.", "prerequisite_knowledge": "The course is introductory. No prior knowledge is assumed.", "assessment_structure": "There will be reading comprehension questions on each reading assignment and two short papers (4 pages and 5 pages).", "goals": "The main goal is to provide a balanced introduction to philosophical analyses of knowledge and justified belief. More generally, the class will provide an introduction to the essential skill of testing and correcting conceptual analyses. It will also provide crucial practice in the vital professional skill of succinct, informative technical writing.", "relevance": "The course fulfills the DC Gen Ed requirement \"Reflecting\". Many fields, including artificial intelligence, economics, statistics, and risk analysis assume rudimentary models of knowledge and justified belief. This course will provide a deeper understanding of those central topics, with the potential for widespread applications in other course work.", "learning_resources": "Readings will be journal articles downloaded from an online drop-box account. There is no text to purchase.", "extra_time_commitment": "Aside from reading the assigned articles and completing the written assignments, there are no further demands on student time outside of class."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "Knowledge acquisition is central to the universitys mission.  The sciences seek  knowledge of nature.  Statistics concerns methods for finding and establishing scientific knowledge. Machine learning concerns the automated generation of knowledge.  Database theory concerns the maintenance of knowledge.  But  then what are knowledge, justified belief, truth, and evidence, and how do all of those concepts fit together   The branch of philosophy that studies those questions is called epistemology, which just means study of knowledge.   This class confronts the central epistemological questions.  Topics include the analysis of knowledge and justification what are they, skepticism the justifiability of beliefs that goes beyond the data available, and the relationship between knowledge and deductive logic are the consequences of knowledge knowable.  The proposed answers involve a subtle interplay of logic, probability, causation, and counterfactual reasoning.  The course is selfcontained, so there are no prerequisites.", "short_name": "KNOWL JUSTF BELIEF", "co_reqs": [], "instructors": [], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Knowledge and Justified Belief", "base_name": "Knowledge and Justified Belief", "skills": [], "success": true, "attributes": []}