{"code": "82-103", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}, {"semester": 2, "year": 2022}, {"semester": 1, "year": 2022}, {"semester": 2, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 12.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Language, communication, pragmatic skill development in speaking, reading, writing, and listening, and cultural knowledge.", "prerequisite_knowledge": "No prerequisite although taking the placement test is required for anyone with prior knowledge of the language.", "assessment_structure": "Class participation, homework, quizzes, unit/chapter exams, presentations, oral exams/meetings; meetings with a speaking or writing peer assistant. Final exams are course dependent.", "goals": "To communicate, learn moderate control of grammar, vocabulary, and pronunciation to understand the importance of cultural information in language and pragmatics. They do so primarily through the use of isolated words, phrases, and sentences that have been encountered, memorized, and recalled. They will also be able to build their knowledge of French language and culture.", "relevance": "This elementary level course introduces and extends students' abilities to communicate in the target language. Students can achieve up to Intermediate Low (ACTFL) or the A2 level (CEFR: European framework).", "learning_resources": "Depending on the course, textbooks, online resources, materials provided by instructors. For the online courses, all course material is provided through the Open Learning Initiative (oli.cmu.edu).", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 12.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 12.0, "website": null, "long_desc": "This course is designed for students with no prior experience with French and who need a more flexible approach to language learning than that offered in a standard classroom course. Beginning language learners will develop communicative competence in the four basic skills of listening, speaking, reading and writing. Basic vocabulary and sentence structures for use in essential dailylife situations, as well as cultural information, are taught through the course materials and assignments. Materials are webbased, with extensive use of Internet technologies for listening, reading, and communication. During regular semesters, this course is offered in a hybrid mode requiring one 80minute class per week in addition to weekly 20minute individual meetings with the instructor or a peer speaking  assistant. There is a materials fee for taking this course which is paid by credit card on first login to the course website. A student with prior experience in French must take the placement exam.", "short_name": "ELEM FRENCH I ONLINE", "co_reqs": [], "instructors": [{"username": "emoufid", "first_name": "Ezzohra", "last_name": "Moufid", "tags": [], "hours_per_week": 0, "id": 3907, "semesters_taught": [{"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}, {"semester": 2, "year": 2022}, {"semester": 1, "year": 2022}, {"semester": 2, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Elementary French I Online", "base_name": "Elementary French I Online", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "global", "id": 7}]}