{"code": "82-141", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 12.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Development of communicative language and cultural competence. Students will work towards improving their writing, reading, listening and speaking abilities in Spanish.", "prerequisite_knowledge": "No prerequisite although taking the placement test is required for anyone with prior knowledge of the language.", "assessment_structure": "Class participation, homework, quizzes, unit/chapter exams, presentations, oral exams/meetings; meetings with a speaking or writing peer assistant. Final exams are course dependent.", "goals": "To communicate, learn moderate control of grammar, vocabulary, and pronunciation to understand the importance of cultural information in language and pragmatics. They do so primarily through the use of isolated words, phrases, and sentences that have been encountered, memorized, and recalled. They will also be able to build their knowledge of Spanish language and culture.", "relevance": "This elementary level course introduces and extends students' abilities to communicate in the target language. Students can achieve up to Intermediate Low (ACTFL) or the A2 level (CEFR: European framework).", "learning_resources": "Depending on the course, textbooks, online resources, materials provided by instructors. For the online courses, all course material is provided through the Open Learning Initiative (oli.cmu.edu).", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 12.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 12.0, "website": null, "long_desc": "Elementary Spanish I is for beginning students, emphasizing the development of communicative language and cultural competence. Students will work towards improving their writing, reading, listening and speaking abilities in Spanish, such that they become comfortable working with a variety of topics from Spanishspeaking cultural areas. Students will develop basic interactional and routine public communication patterns, frequently working in groups and pairs, and utilizing technologies that enhance learning opportunities and promote skill development. This course also provides extracurricular opportunities to interact with members of the Spanishspeaking community. Four hours of inclass instruction per week are required. A student with prior experience in Spanish must take the placement exam.", "short_name": "ELEMENTARY SPANISH I", "co_reqs": [], "instructors": [{"username": "ehelin", "first_name": "Erik", "last_name": "Helin", "tags": [], "hours_per_week": 0, "id": 905, "semesters_taught": [{"semester": 1, "year": 2015}, {"semester": 1, "year": 2016}, {"semester": 1, "year": 2017}, {"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Elementary Spanish I", "base_name": "Elementary Spanish I", "skills": [{"id": 1213, "name": "Public Speaking", "slug": "public-speaking"}], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "global", "id": 7}]}