{"code": "82-287", "offered_in_campuses": [2, 1], "offerings": [{"semesters": [{"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}], "sub_semesters": [], "campus_id": 2}], "max_units": 6.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "VR, Virtual Reality, Intercultural Competency, Culture, Language, Digital Media", "prerequisite_knowledge": null, "assessment_structure": "A short 90 second to 3 minute - 360 VR Video loaded as an unlisted video to YouTube\n\n- Reflective essay", "goals": "Working individually you will suggest a short personal project that tells a story of an aspect of identity, language and culture. What would you like to tell people about your experience, what assumptions could you challenge about the way you live and work During the course you will learn how to use the technology provided to create short 360 video pieces that can be viewed using a VR headset. You will learn a process for writing, designing and producing your piece. Your film should address themes of culture and identity, and you will be asked to reflect on both your understanding of these themes and the process of creating a piece that deals with them.", "relevance": "(see description)", "learning_resources": "This is a blended course, taught online and face to face, technical resources such as cameras will be provided.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 6.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}], "units": 6.0, "website": null, "long_desc": "In this unique course, taught across two campuses in Pittsburgh and CMUQ, Doha we will explore the ways cultures and identities often intersect, relate and contradict one another. Using Virtual Reality VR, a technology that provides a type of immersion, we can see the world through other peoples points of view. But can we really harness this technology to tell stories about languages and cultures, can we really empathize and understand another culture using VR To discover the affordances of VR, we will use this immersive technology to tell stories and relate our understanding of the world for others to see, thus exploring cultural understandings. Learning through telecollaboration, in online, virtual and inperson workshops, this will be an opportunity to collaborate, blend ideas, gain valuable skills and build on new experiences. During the course, students will create 360 video outcomes that others will view and experience through headsets and immersive spaces. No technology knowledge is required.", "short_name": "MLTCRL IMRSN VR", "co_reqs": [], "instructors": [{"username": "scaspar", "first_name": "Stephan", "last_name": "Caspar", "tags": [], "hours_per_week": 0, "id": 3896, "semesters_taught": [{"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}], "photo_url": null}, {"username": "dudleyr", "first_name": "Dudley", "last_name": "Reynolds", "tags": [], "hours_per_week": 0, "id": 742, "semesters_taught": [{"semester": 1, "year": 2021}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Multicultural Immersion - Relating Your World in Virtual Reality", "base_name": "Multicultural Immersion - Relating Your World in Virtual Reality", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "diversity", "id": 3}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "global", "id": 7}, {"type": "attribute", "name": "interdisciplinary", "id": 10}, {"type": "attribute", "name": "maker", "id": 12}]}