{"code": "82-269", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Virtual Reality, Immersive Technologies, Culture, Language, Digital Storytelling", "prerequisite_knowledge": null, "assessment_structure": "Students will be asked to create a reflective portfolio, capturing the creation of their own short immersive film and reflecting on the wider use of the technology for digital storytelling.", "goals": "Students will be able to create immersive stories using accessible tools and technologies for Virtual and Augmented Reality. Students will be able to analyze the effectiveness of different forms of digital storytelling using a critical approach to media.", "relevance": "This course is an abridged version of *Multicultural Immersion - Relating your world in VR*, which has been running for since 2020 for CMU students in Doha and Pittsburgh as a single cohort. Taught jointly between Prof. Stephan Caspar and Prof. Dudley Reynolds students explore themes in language and culture through the use of immersive technologies such as Virtual Reality and Augmented Reality, and completing a final digital outcome that speaks to these technologies and subject themes.", "learning_resources": "Learning resources and Activities Students will need a smart-phone with some storage capacity and a built-in camera. The phone will be used to create and capture content, and used to view 360 virtual reality content when used with a cardboard headset kit provided by the instructor. Students may also have access to specialist cameras and headsets as provided for their use", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "In this course you will enjoy a series of remote and then inperson workshops, setting the groundwork for their own practical projects. Often perceived as a technology of tomorrow, students will be introduced to storytellers and content creators currently working with Virtual and Augmented Reality and other Immersive media m to tell stories about people, communities, cultures, and histories in compelling and engaging ways.  Using readily available smartphone apps and consumerready cameras and headmounted displays, students will be able to create their own short immersive films and gain a better understanding of this important and emerging field.  You will produce your own short digital story using the technologies that we explore through this class. Your story will explore themes of identity, language, and culture, asking you to relate experiences and reflect on ways that you connect and interact with cultures around you. We will ask questions about the affordances of immersive technologies, how we can use them to tell stories of culture and how creators and artists are different themes through their work.", "short_name": "IMSV DGTL STRYTLG", "co_reqs": [], "instructors": [{"username": "scaspar", "first_name": "Stephan", "last_name": "Caspar", "tags": [], "hours_per_week": 0, "id": 3896, "semesters_taught": [{"semester": 1, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Immersive Digital Storytelling:Using VR/AR to Explore, Language Culture Identity", "base_name": "Immersive Digital Storytelling:Using VR/AR to Explore, Language Culture Identity", "skills": [], "success": true, "attributes": []}