{"code": "82-286", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2019}, {"semester": 3, "year": 2019}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": true, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Specific topics will vary by semester. Click the course URL to read more about each section.", "prerequisite_knowledge": null, "assessment_structure": "The course assignments will invite collaboration and learning from all students in the class, and methods will be accessible to different learning abilities and preferences. Examples of these assignments include: daily preparedness and participation in class activities; participation and discussion both in-class and in an on-line discussion forum; nightly/weekly reading and HW with questions; independent and collaborative research and writing assignments; pair/group work; oral presentations/final project presentations; a creative and/or research-oriented final project.", "goals": "1. Examine how cultural contexts, including recognition of our identities and possible biases, impact our worldviews.2. Evaluate how worldviews influence the interpretation of historical and contemporary events, and the perception of cultures and communities.3. Analyze the role of cultural norms and institutions in creating and perpetuating structural inequalities and discriminatory attitudes.", "relevance": "Dietrich GenEd prior to Fall 2021: Reflecting\nDietrich GenEd after Fall 2021: Foundations - Intercultural and Global Inquiry", "learning_resources": "Materials will be provided by the instructor. Books may be required as well.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": "https://drive.google.com/file/d/1RU2iXs7Vyc-6F-HRozPu7_YdV7oYuOGn/view", "long_desc": "FALL 2022  Section A This course will explore ethnic and cultural diversity in contemporary Europe, especially Germany. All of these countries have become increasingly diverse ethnically and culturally over the last few decades, and there have been significant debates about immigration and willingness or lack thereof to accept refugees from other parts of the world.  Some have celebrated Europes increasing multiculturalism and diversity, whereas others have criticized it. The goal of the course is to look at both multiculturalism and diversity and also the critics of multiculturalism and diversity.  Section C In this course, students will gain an understanding of the linguistics of various East Asian languages. Students will learn how ones own experiences, worldviews, society, and culture can be shaped by language. Understanding these principles is essential in creating more global and intercultural citizens. Section D Students will examine multicultural situations in Japan, where foreign migrants, indigenous peoples, and hafu live and work with Japanese people, from historical, political, economic, social, and cultural perspectives. They will also be asked to reflect on their own cultural contexts for understanding the cultural diversity of their own society. Section E In the days when threats were constant, human beings needed to assess possible danger quickly. Today, before even speaking, our brain assesses and categorizes others. Needless to say, these quick judgements are inaccurate and based on what is visible or perceivable clothing, health, etc, and even on where we encounter each other in a bar, a library, or a laundromat. We dont realize the influence of our own culturesidentities on our assessments. Through data, students will uncover themes leading to feelings of a lack of inclusivity and create plans to help us develop deeper understanding and acceptance in the CMU community.", "short_name": "INTRCL GLBL INQ ML", "co_reqs": [], "instructors": [{"username": "byoungs", "first_name": "Bonnie", "last_name": "Youngs", "tags": [], "hours_per_week": 0, "id": 25, "semesters_taught": [{"semester": 2, "year": 2019}, {"semester": 3, "year": 2019}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": true, "topic": null, "name": "Cultural Complexities", "base_name": "Cultural Complexities", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "global", "id": 7}]}