{"code": "82-202", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Contemporary France, current events in France, French history, French literature, online French media, social and ethnic identities, language and gender, universalism & anti-racism in the French republic.", "prerequisite_knowledge": "82-201, placement test, or permission of the instructor.", "assessment_structure": "Continuous homework assignments requiring listening, reading, speaking, and writing exercises, class participation, varied projects for each module - often integrating multimedia elements", "goals": "Cultural knowledge1. recognize links between the past and present France, between France and francophone peoples through text, film, and current events.2. identify culturally specific artifacts and beliefs to understand French and francophone peoples.3. compare and contrast your own and others cultural values and beliefs as represented in culturally specific texts practices, products, and perspectives.4. evaluate how the past continues to shape the present and how the language continues to evolve as a result.5. analyze how the French language both discriminates against and liberates individuals from structural inequalities and attitudes. Linguistic skills6. increase linguistic control in writing and speaking, including accuracy in grammar and pronunciation and expansion of vocabulary7. cultivate listening skills.8. develop argumentation skills in writing and speaking.9. make progress in comprehension and critical analysis of texts literary, media, and oral.", "relevance": "Dietrich GenEd prior to Fall 2021: Communicating\nDietrich GenEd after Fall 2021: Intercultural and Global Inquiry\n\nThis course is necessary for students to make the transition from the Intermediate (Second-year) to Advanced (Third-year) levels. Students can achieve up to Intermediate High (ACTFL) or the B2 level (CEFR: European framework).", "learning_resources": "Web pages, online dictionaries, online videos, podcasts, electronic texts; books may be required based on the instructor.", "extra_time_commitment": "Voluntary participation in local events related to French language and culture."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "This course is a onesemester intermediate language course intended to give students exciting and fastpaced instruction in French language and culture. Introducing vocabulary sets, core grammatical concepts through cultural texts and strategic interaction, this class will focus on developing academic literacy as well as sociopragmatic competence that is to say, what to say to whom, and how in an interculturally responsive way. To this end, we will incorporate a broad range of learning activities that emphasize a students active participation. Emphasis will be placed on developing stronger listening and oral communication skills as well as reinforcing reading ability and acquiring greater facility in written proficiency. Consequently, this syllabus is constructed to permit a fair amount of selfinstruction through the accompanying grammar reference book and selfguided exploration.  F22 The course is an exploration of French language and culture through a nesting of two experiences 1 playing and analyzing games together as a class and 2 designing games with the objectives of them being used or usable by French studentsteachers in the classroom complete with rules and pedagogical guides.   This semester, we are trying a new thing, which is to have both advanced students such as yourself and intermediatelevel students in the same class to try and form a true Community of Practice in which the students will be socialized into a mostly Frenchspeaking community of gamers and game designers. This is why the meeting times are 6 hours, more handson work, with less independent homework.", "short_name": "INTERMED FRENCH II", "co_reqs": [], "instructors": [], "anti_reqs": [], "prereqs": {"text": "(82-201 at least D)", "raw_pre_req": "", "req_obj": {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 9.0, "code": "82-201", "id": 4341, "name": "Intermediate French I"}}, "is_hidden": false, "type_string": "", "type": "course", "id": 4341}], "id": 4342, "screen_name": "82-201"}], "constraints": [{"data": {"x": 1, "is_and": true}, "is_hidden": false, "type": "anyxof", "id": 13387}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "is_hidden": false, "type_string": "Minimum grade of D", "type": "mingrade", "id": 13388}], "id": 10993, "screen_name": "da7qd3ljksxcgej"}], "constraints": [{"data": {"x": 1, "is_and": true}, "is_hidden": false, "type": "anyxof", "id": 13386}], "id": 10992, "screen_name": "mcfsfad3zuo5thc"}}, "is_req_repeatable": false, "topic": null, "name": "Intermediate French II", "base_name": "Intermediate French II", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "global", "id": 7}]}