{"code": "82-283", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 3, "year": 2021}, {"semester": 3, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "In this course, we will explore a variety of questions, advantages, and challenges related to language diversity and cultural identity in the United States and across the globe. Our main focus will be on contexts of multilingualism¿that is, contexts in which two or more languages may be used. We will explore the following themes: (i) The historical underpinnings of language diversity and its consequences for cultural identity today (e.g., migration, colonization, conquest); (ii) How language diversity and cultural identity shapes, and is shaped by, local, regional, national, and international politics; (iii) The relationship between language diversity and language use and visibility in public spaces (i.e., the linguistic landscape); (iv) Relations between linguistic communities (e.g., majority and minority language users) and the sense of \"belonging\" to a culture.", "prerequisite_knowledge": null, "assessment_structure": "Continuous assessment through homework, in-class participation and assignments, and hands-on projects as well as a final project (e.g., paper, portfolio, technological innovation)", "goals": "Specifically, the course is aligned with the CMU core competency for Intercultural and Global Inquiry with the following objectivesStudents will examine how diverse linguistic and sociocultural contexts impact worldviews at intrapersonal, interpersonal, and macrocultural levels.Students will evaluate how socioculturally and linguistically mediated worldviews shape the interpretation of historical and contemporary events and the perception of cultures and communities.Students will analyze the role of linguistic, discursive, communicative, and cultural norms and institutions in causing and perpetuating systemic inequalities.Students will cultivate multilingual and multicultural awareness and develop the ability to act to promote equity and global justice.", "relevance": "Dietrich GenEd prior to Fall 2021: Reflecting\nDietrich GenEd after Fall 2021: Foundations - Intercultural and Global Inquiry\n\nThis course introduces students to core concepts in multilingualism research, education, and policy. It is applicable to students who wish to gain greater intercultural awareness, knowledge of the way language and language use can shape cultural identities and worldviews, and familiarity with common research methods in multilingualism.", "learning_resources": "Canvas, with all readings and assignments posted, linked to multimedia resources\n\nStudents will also have access to the Modern Language Resource Center; Askwith Kenner Global Languages & Cultures Room.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": "https://drive.google.com/file/d/1RU2iXs7Vyc-6F-HRozPu7_YdV7oYuOGn/view", "long_desc": "Culture, language, and identity are intimately tied together. Individuals, families, communities, and nations identify themselves in relation to the language or languages they speak. Local, national, and international governmental organizations make choices about the language or languages they recognize and use for political and economic affairs. The United Nations even recognizes language as integral to maintaining the cultural heritage of communities and peoples around the world, and the freedom to choose ones language of expression as a universal human right.   In this course, we will explore a variety of questions, advantages, and challenges related to language diversity and cultural identity across the globe. Our main focus will be on contexts of multilingualism that is, contexts in which two or more languages may be used. Adopting a comparative case study approach, we will explore the following themes i The historical underpinnings of language diversity and its consequences for cultural identity today e.g., migration, colonization, conquest ii How language diversity and cultural identity shapes, and is shaped by, local, regional, national, and international politics iii The relationship between language diversity and language use and visibility in public spaces i.e., the linguistic landscape iv Relations between linguistic communities e.g., majority and minority language users and the sense of belonging to a culture.   The course is taught in English. Students who wish to take the course as a Modern Languages major or minor elective will need to complete their final project on a topic relevant to the language they study.", "short_name": "LANG DIV CLTRL IDTY", "co_reqs": [], "instructors": [{"username": "masaeed", "first_name": "Khaled", "last_name": "Al Masaeed", "tags": [], "hours_per_week": 0, "id": 381, "semesters_taught": [{"semester": 3, "year": 2021}, {"semester": 3, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Language Diversity & Cultural Identity", "base_name": "Language Diversity & Cultural Identity", "skills": [{"id": 1207, "name": "Languages", "slug": "languages"}, {"id": 1213, "name": "Public Speaking", "slug": "public-speaking"}], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "diversity", "id": 3}, {"type": "attribute", "name": "global", "id": 7}]}