{"code": "82-303", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2020}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Current and/or historic interactions between France and francophone communities/countries/peoples.", "prerequisite_knowledge": "82-202, placement test, or permission of the instructor. Ability to express oneself in French writing and speaking at the Advanced (Third-year) level: Description, Comparison, Narration in present, past, and future tenses; Ability to understand written and spoken French at the Advanced (Third-year) level.", "assessment_structure": "Continuous homework assignments requiring listening, reading, speaking, and listening exercises, class participation, quizzes, oral presentations, final project that could be in the form of written research, a presentation, etc.", "goals": "Understanding how French current and historical events have shaped how France interacts with the modern francophone world based on this history Raising student proficiency in French in four skills listening, speaking, reading, and writing.", "relevance": "Ability to express oneself in French writing and speaking at the Advanced (Third-year) level, by placement test or previous coursework : Description, Comparison, Narration in present, past, and future tenses. Students should have a knowledge of French that is commensurate with taking an advanced French course. No particular content knowledge will serve as a prerequisite but some basic understanding of French culture and any additional knowledge base students bring to the course will be brought to bear.", "learning_resources": "Web pages, online dictionaries, online videos, electronic texts; books may be required based on the instructor.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "FALL 2022 HEALTH, ILLNESS AND THE BODY IN THE FRENCHSPEAKING WORLD This projectbased course will explore the evolving representations of health, illness and the body, as well as their use in the design of modern France and the idea of Frenchness. In the first part of the semester, students will uncover some of the roots of Frenchness in relation to areas formerly colonized by France, and the ways in which health became bounded with civilization, citizenship and rights. We will particularly analyze the contemporary effects of these practices on the integration and identity of French citizens from former colonies How did public health supported the French imperial project from the 16thcentury onwards What are the relations between 19thcentury hygienisme  the battle against filth, germs and poor Parisians and the French Third republic intimate reading of France as a body in need of a special health regimen How do these visions affect the management of entities perceived as posing a threat to the integrity of the national body women, criminals, the poor, as well as the colonized subjects of the French empire What are their contemporary remnants in the lives of French citizens of immigrant or colonial originsIn the second part of the course, students will collaboratively design games and pedagogical materials that can be used to engage with our topic in a more diverse and inclusive way. The coursework will develop students skills in writing, reading, speaking, and listening, and improve their control of grammar through indepth conversation, presentations and collaborative work.", "short_name": "FRNCH FRANCO CLTRS", "co_reqs": [], "instructors": [{"username": "byoungs", "first_name": "Bonnie", "last_name": "Youngs", "tags": [], "hours_per_week": 0, "id": 25, "semesters_taught": [{"semester": 1, "year": 2020}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "(82-204 at least D) or (82-202 at least D)", "raw_pre_req": "", "req_obj": {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 0.0, "code": "82-204", "id": 7338, "name": "82-204"}}, "type_string": "", "type": "course", "id": 16575}], "id": 12934, "screen_name": "82-204"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 16574}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 16576}], "id": 12933, "screen_name": "bmlsj3e7x02hvvc"}, {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 9.0, "code": "82-202", "id": 4342, "name": "Intermediate French II"}}, "type_string": "", "type": "course", "id": 4342}], "id": 4343, "screen_name": "82-202"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 16577}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 16578}], "id": 12935, "screen_name": "j34d6akx4yv0898"}], "constraints": [{"data": {"x": 1, "is_and": false}, "type": "anyxof", "id": 16573}], "id": 12932, "screen_name": "5oggj4vzabmta6k"}}, "is_req_repeatable": false, "topic": null, "name": "French & Francophone Cultures", "base_name": "French & Francophone Cultures", "skills": [{"id": 1001, "name": "Eventing", "slug": "eventing"}], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "global", "id": 7}]}