{"code": "82-355", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2016}, {"semester": 2, "year": 2020}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The course will expose the students to a range of topics and social realities of the Spanish-speaking world. In the course, we will view and analyze a selected group of films portraying four main issues in Hispanic history and society: memory and oblivion, immigration and exile, marginalized identities throughout history, and the Hispanic world in globalization.", "prerequisite_knowledge": "Intermediate Spanish II", "assessment_structure": "Students will be assessed by the students´ film discussions, brief film comments in writing, film critiques, creative writing pieces related to the film content, and finally a take-home midterm exam.", "goals": "Introduce students to different historic events and sociopolitical issues in the Hispanic world as represented in selected films and texts Expose students to a variety of films and texts that portrait different historic events and sociopolitical issues in the Hispanic world Encourage critical and analytical thinking and Help students continue to develop their oral and written language competencies.", "relevance": "Introduce students to different historic events and socio-political issues in the Hispanic world as represented in selected films and texts; Expose students to a variety of films and texts that portrait different historic events and socio-political issues in the Hispanic world; Encourage critical and analytical thinking; and Help students continue to develop their oral and written language competencies.", "learning_resources": "The students will be required to view and analyze all the films outlined in the course syllabus (Butterfly, The Official Story, Camila, Real Women Have Curves, Even the Rain, Sin Nombre, Strawberry and Chocolate, Things I left in Havanna, and All About my Mother) and also the following readings: Melva, Currículum Vitae, Los nadie, Second Generation Mexicans, and La cara que se veía en todas partes.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This course is offered only at Carnegie Mellons campus in Qatar.    The purpose of this course is to explore Hispanic culture and history through contemporary films in Spanish. Undoubtedly, films are a rich source of meaningful cultural information that can provide the audience with an understanding of a countrys culture history, politics, social problems, etc. through their discussion and analysis. Movies not only represent reality, but they do it from a particular position. The images produced in films are charged with political interests that reproduce or challenge established beliefs and views. Films offer different representations of reality as well as different ways of relating to it Achugar, 2008. We will view and analyze a selected group of films portraying four main issues in Hispanic history and society memory and oblivion, immigration and exile, marginalized identities throughout history, and the Hispanic world in globalization. An understanding of the sociopolitical context that these films aim to portray through indepth reading, analysis, discussion, and investigation will provide a thorough understanding of the complexities of various historic events, and opportunities and challenges faced by the Hispanic world. Throughout the semester, we will practice the four language skills listening, speaking, reading, and writing as we continue to build on vocabulary and review grammar points based on the films viewed, the texts read, and the topics discussed.", "short_name": "TPCS HISPANIC STDIES", "co_reqs": [], "instructors": [{"username": "ehelin", "first_name": "Erik", "last_name": "Helin", "tags": [], "hours_per_week": 0, "id": 905, "semesters_taught": [{"semester": 2, "year": 2016}, {"semester": 2, "year": 2020}, {"semester": 1, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "(82-242 at least D)", "raw_pre_req": "", "req_obj": {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 9.0, "code": "82-242", "id": 4855, "name": "Intermediate Spanish II"}}, "type_string": "", "type": "course", "id": 4855}], "id": 4856, "screen_name": "82-242"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 11275}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "type_string": "Minimum grade of D", "type": "mingrade", "id": 11276}], "id": 9700, "screen_name": "ssekhupa64vc6ek"}], "constraints": [{"data": {"x": 1, "is_and": true}, "type": "anyxof", "id": 11274}], "id": 9699, "screen_name": "aun1ghwby1uoc5l"}}, "is_req_repeatable": false, "topic": null, "name": "Tpcs in Hispanic Std: Beyond the Film Screen: The Hispanic World Through Film", "base_name": "Tpcs in Hispanic Std: Beyond the Film Screen: The Hispanic World Through Film", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "writing intensive", "id": 18}]}