{"code": "84-291", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2020}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Paradigms in Comparative Politics; Varieties of Democracies and Autocracies; The Importance of the Middle East in World Politics; Political Systems in the Middle East; Political Mobilization and Political Conflict; Arab Spring; The Political Economy of the Middle East; Military Forces and Politics in the Middle East; Religion and Politics in the Middle East", "prerequisite_knowledge": null, "assessment_structure": "15% Attendance. Students will be rewarded for attending classes and penalized for missing them. 55% Exam. The exam will cover my lectures and readings. 30% Research Paper. Students will write a research paper on a topic previously discussed with the instructor. Before submitting their final manuscript, students will share an outline of their proposed research paper.", "goals": "At the end of the course, students will be able to 1. Understand the main theories, concepts, and methods of Comparative Politics 2. Identify how the comparative politics literature has contributed to our understanding of domestic politics in the Middle East and 3. Explain how political systems work and vary across Middle East countries.", "relevance": "Political decisions affect everyone's everyday life. Understanding what political decisions are made, how they are made, and who makes or influences them is necessary to become an informed citizen. Therefore, this course is relevant for all students who want to have a better understanding of the most important political institutions in their countries and how political regimes work and vary across countries. Furthermore, this course will improve the student's ability to logically compare different things.", "learning_resources": null, "extra_time_commitment": "No."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "This is one of three micro courses under the umbrella title of Geopolitical Challenges of a Changing Middle East Politics, Security, and Law.  This course examines the domestic politics in the contemporary Middle East. It reviews the types of political systems present in the region and the developments that have taken place in the last decades, especially since the Arab Spring. The course is divided into two sections. The first part provides an introduction to the subfield of Political Science called Comparative Politics. Scholars in this subfield use comparative methods to study and compare domestic politics across countries. Here we will discuss how political regimes differ, discuss why they differ and explore the consequences of such variation. In the second section, we will examine the political systems that exist in the Middle East, and do a general review of the recent political trajectories of the countries of the region.", "short_name": "GEOPOL MIDEAST I-POL", "co_reqs": [], "instructors": [{"username": "iarana", "first_name": "Ignacio", "last_name": "Arana", "tags": [], "hours_per_week": 0, "id": 232, "semesters_taught": [{"semester": 1, "year": 2020}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Geopolitical Challenges of a Changing Middle East I: Politics, Security, & Law", "base_name": "Geopolitical Challenges of a Changing Middle East I: Politics, Security, & Law", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "diversity", "id": 3}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "global", "id": 7}, {"type": "attribute", "name": "writing intensive", "id": 18}]}