{"code": "84-292", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2020}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "We will discuss the following topics:\n\n-Shifting Geopolitics in a Complex Region\n-Terrorism and Counter-Terrorism in the Gulf\n-Oil, Natural Gas, and Energy Security in the Middle East\n-Impact of the Syrian Civil War\n-Arab Spring\n-The Saudi-Iranian Rivalry\n-Dynamics of the Illegal Blockade\n-Israeli-Palestinian Conflict\n-Examining Sunni-Shia Sectarian Dynamics", "prerequisite_knowledge": null, "assessment_structure": "The evaluation will be as follows:\n\n20% Attendance. Students will be rewarded for attending classes and penalized for missing them.\n\n40% Policy Papers. There will be two policy papers, each worth 20% of the final grade. The policy papers will be approximately 5 pages in length and focus on an issue decided upon in consultation with the instructor, derived from course readings or discussions.\n\n40% Final Exam. Students will take a final exam consisting of multiple choice, short answer essays and long answer essays. The exam will be comprehensive and take place at the end of the term.", "goals": "At the end of the course, students will be able to 1. Understand the tectonic shifts that have taken place in regional security configuration since the end of the Cold War and amidst larger realignments following the Arab Spring. 2. Identify the primary issues driving security policy in the Middle East, including terrorism and political violence energy and natural resources sectarianism and state failure and civil wars. 3. Explain how countries view their own security and be able to discern the contours of how countries craft and implement a range of foreign and security policies and how they approach the region.", "relevance": "The Middle East is a region in constant flux. Only by questioning our assumptions and pursuing new lines of inquiry can students truly begin to grasp the intricacies and nuances of geopolitics in the Middle East and Persian Gulf.", "learning_resources": "Required reading:\n\nMarc Lynch, The New Arab Wars: Uprisings and Anarchy in the Middle East, New York: Public Affairs, 2016, https://www.amazon.com/New-Arab-Wars-Uprisings-Anarchy/dp/161039772X/ref=sr_1_1?keywords=Marc+Lynch+New+Arab+Wars&qid=1572435087&s=books&sr=1-1\n\nScott Anderson, \"Fractured Lands: How the Arab World Came Apart,\" New York Times Magazine, August 10, 2016, https://www.nytimes.com/interactive/2016/08/11/magazine/isis-middle-east-arab-spring-fractured-lands.html\n\nAdditional readings from academic journals and book chapters will be assigned throughout the semester and will be available through Canvas: https://www.cmu.edu/canvas/", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "This is one of three course proposals under the umbrella of Geopolitical Challenges of a Changing Middle East.  This course examines the security dimensions of the contemporary Middle East. The region has undergone a significant transformation over the past decade alone, with new configurations of power and a realignment of geopolitical interests, alliances, and rivalries taking shape. The course is broken down into three primary sections. The first part examines the shifting geopolitics in the region in order to provide a broad overview of the primary areas affecting various Middle Eastern countries foreign and security policies. This section looks at two of the defining issues of the region, including terrorism and counterterrorism, as well as the impact of natural resources and energy security.  The second part of the course analyzes major events in the Middle East, including the Syrian civil war, the Arab Spring, and the rivalry between Saudi Arabia and Iran, and the security implications of each of these themes. Finally, the third section concludes with an examination of the illegal blockade against Qatar, the IsraeliPalestinian conflict, and a review of sectarianism throughout the region, assessing the significance of each of these topics and measured against other topics explored earlier in the semester. The Middle East is a region in constant flux. Only by questioning our assumptions and pursuing new lines of inquiry can students truly begin to grasp the intricacies and nuances of geopolitics in the Middle East and Persian Gulf.", "short_name": "GEOPL MIDEAST II SEC", "co_reqs": [], "instructors": [{"username": "cclarke", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 2411, "semesters_taught": [{"semester": 1, "year": 2020}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Geopolitical Challenges of a Changing Middle East II: Politics, Security, & Law", "base_name": "Geopolitical Challenges of a Changing Middle East II: Politics, Security, & Law", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "diversity", "id": 3}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "global", "id": 7}, {"type": "attribute", "name": "writing intensive", "id": 18}]}