{"code": "85-120", "name": "Demystifying Freud and the Discipline of Psychology", "base_name": "Demystifying Freud and the Discipline of Psychology", "units": 3.0, "min_units": 3.0, "max_units": 3.0, "short_name": "DMSTFY FREUD AND PSY", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [2], "offerings": [{"campus_id": 2, "semesters": [{"semester": 2, "year": 2023}], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "Regardless of discipline, an understanding of human thought and behavior is essential in navigating ones environment and work. Psychology, the science that can guide this understanding, is often misunderstood by the general public. Throughout the world, when psychology is mentioned, the name that often comes to mind is Sigmund Freud. Many of the misconceptions regarding psychology started with misinterpretations of Freuds work and concepts. Using Freuds most wellknown concepts, this course will introduce students to what psychology is, and what it isnt  in hopes of illustrating what use psychological principles can be in a plethora of academic disciplines. In particular, students will learn how to apply these principles to modern day research settings with a specific focus on health and wellbeing research. Students will not only gain insight into their own academic and career paths, but into their own personality and health as well. Course work will consist of class attendance, weekly course readings and online discussions, one exam, and a final paper.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [{"first_name": "Crista", "last_name": "Crittenden", "username": "ccritten", "photo_url": null, "hours_per_week": 0, "tags": [], "semesters_taught": [{"semester": 2, "year": 2023}], "id": 2824}], "is_repeatable": true, "is_req_repeatable": true, "catalog_levels": [], "skills": [{"name": "Assessment", "slug": "assessment", "id": 61}, {"name": "Primary", "slug": "primary", "id": 1246}, {"name": "Alcohol", "slug": "alcohol", "id": 1560}], "attributes": [{"name": "discussion intensive", "id": 2, "type": "attribute"}, {"name": "reading intensive", "id": 13, "type": "attribute"}, {"name": "writing intensive", "id": 18, "type": "attribute"}], "custom_fields": {"goals": "Understand the basic principles of what modern day psychology is and what it isnt, using the ideas of Sigmund Freud as a frame of reference. Students will learn how popular views of psychology are often incorrect, and how the misinterpretation of the works of Freud have played into these common misconceptions. Discuss the correct meanings of common psychoanalytic concepts such as the unconscious, the id, ego, and superego, as well as catharsis, defense mechanisms, and Freudian slips Describe how these psychoanalytic concepts are assessed in both a clinical and research setting. Explain how these concepts have been interpreted in modern psychology research, with a particular focus on health psychology. Students will be able to recognize the connections between Freudian concepts and health and wellbeing outcomes. Apply these concepts in a realword scenario. Students will learn to analyze human behavior from a psychoanalytic viewpoint in the form of a case conceptualization written assignment. Demonstrate knew knowledge through weekly discussions, which will allow them to practice critical thinking and dissemination skills.", "key_topics": "¿ What Psychology Is and What it Isn't ¿ Personality ¿ Psychoanalytic Approaches to Psychology ¿ Who exactly was Sigmund Freud? ¿ Conscious, Preconscious, Unconscious o Includes \"Freudian Slips\" ¿ Id, Ego, Superego ¿ Drives and Instincts ¿ Catharsis ¿ Defense Mechanisms (e.g., repression, suppression, rationalization, intellectualization, projection, reaction formation, sublimation) ¿ Dreams ¿ Research and Assessment (e.g., Rorschach tests) ¿ How Freudian Concepts Relate to Health and Well-being", "prerequisite_knowledge": null, "assessment_structure": "¿ Attendance ¿ Exam (1) - Multiple choice/short answer ¿ Writing Assignment (1) - Applying Freudian Concepts to Modern Day Research o Detailed rubric will be provided ¿ Weekly Online Class Discussions (4) - based on assigned readings o Detailed rubric will be provided", "relevance": "Regardless of discipline, an understanding of human thought and behavior is essential in navigating one's environment and work. Psychology, the science that can guide this understanding, is often misunderstood by the general public. Throughout the world, when psychology is mentioned, the name that often comes to mind is Sigmund Freud. Many of the misconceptions regarding psychology started with misinterpretations of Freud's work and concepts. Using Freud's most well-known concepts, this course will introduce students to what psychology is, and what it isn't - in hopes of illustrating what use psychological principles can be in a plethora of academic disciplines. In particular, students will learn how to apply these principles to modern day research settings with a specific focus on health and well-being research. Students will not only gain insight into their own academic and career paths, but into their own personality and health as well.", "learning_resources": "¿ Selected readings from Freud: o Excerpts from \"The Interpretation of Dreams\" o Excerpts from \"The Psychopathology of Everyday Life\" ¿ Selected readings from science journalism/peer-reviewed journals, e.g.: o NYTimes: The Curious Conundrum of Freud's Persistence Influence o NYTimes: Tell It About Your Mother: Can brain-scanning help save Freudian psychoanalysis? o Recent research looking at ego-regulation and health, e.g.: ¿ Robinson, M. D., Irvin, R. L., & Persich, M. R. (2021). Ego effectiveness: A novel individual difference approach to health behavior and coping. Journal of Health Psychology, 13591053211001412. ¿ Ziadni, M. S., Jasinski, M. J., Labouvie-Vief, G., & Lumley, M. A. (2017). Alexithymia, defenses, and ego strength: Cross-sectional and longitudinal relationships with psychological well-being and depression. Journal of happiness studies, 18(6), 1799-1813. o Research from James Pennebaker regarding the \"cathartic\" health benefits of expressive writing, e.g.: ¿ Pennebaker, J. W., & Susman, J. R. (1988). Disclosure of traumas and psychosomatic processes. Social science & medicine, 26(3), 327-332. ¿ Lepore, S. J., & Smyth, J. M. (2002). The writing cure: An overview. ¿ Selected readings from \"Perspectives on Personality\" textbook (Chapter 8: The Psychoanalytic Perspective) o Carver, C. S., & Scheier, M. F. (2017). Perspectives on personality. Pearson education. ¿ Textbook co-written by CMU Psychology Professor Emeritus Michael Scheier", "extra_time_commitment": null}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}