{"code": "85-104", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 3, "year": 2021}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This course provides an introduction to the science and practice of psychopathology.", "prerequisite_knowledge": null, "assessment_structure": "Exams, quizzes, assignments, paper", "goals": "1.Discuss difficulties concerning the definition of psychopathology, including historical and cultural conceptualizations of abnormality and present day challenges.2.Define issues related to the diagnosis and classification of psychological disorders, including the current DSM5 classification system and alternative approaches. Discuss the implications of assuming a continuum between normal and pathological behavior vs. discrete diagnostic categories.3.Gain an understanding of the symptoms, prevalence rates, risk factors, and clinical courses for major adult psychological disorders.4.Describe the basic assumptions behind different theoretical perspectives on psychopathology. For each psychological disorder covered, identify the proposed causes and treatments offered by each perspective.5.Comprehend and critically examine research regarding psychological disorders. Because psychology is science definition the scientific study of the mind and behavior we will make frequent use of research findings and the scientific method to understand concepts in psychopathology.6.\nFinally, a major objective of this course is to progressively raise your awareness of psychological disorders and the implications of stigma associated with these illnesses. This course is intended to enrich your knowledge of mental illness, beginning with developing a knowledge base of the origins of psychopathology and moving towards independently applying this knowledge to understanding clinical phenomena. Thus, critical thinking is an important element of this course, and you will be encouraged to explore and question definitions and portrayals of psychopathology, research methods and findings, and personal views about psychopathology. In the process, it is my hope that you develop a deeper respect and compassion for individuals experiencing various psychological disorders.", "relevance": "Students will learn about mental health conditions that affect many college students.", "learning_resources": "textbook, lecture slides, memoir, case studies, short video clips", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "This course provides an introduction to the science and practice of psychopathology. Students will examine definitions of psychopathology in a historical and contemporary context, explore issues relevant to diagnosis and patient care, and be introduced to various diagnostic categories for psychological disorders. Students will also learn about potential determinants of and treatments for psychological disorders in the context of major theories and empirical findings in the field. Emphasis will be placed on three major paradigms in psychopathology genetics, neuroscience, and cognitive behavioral. An assigned memoir, case studies, and short video clips will be used to illustrate the human side of mental illness.", "short_name": "PSYCHOPATHOLOGY", "co_reqs": [], "instructors": [{"username": "kasey", "first_name": "Kasey", "last_name": "Creswell", "tags": [], "hours_per_week": 0, "id": 843, "semesters_taught": [{"semester": 3, "year": 2021}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Psychopathology", "base_name": "Psychopathology", "skills": [], "success": true, "attributes": []}