{"code": "85-221", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 1, "year": 2019}, {"semester": 3, "year": 2020}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "1) What develops when? To understand biological, cognitive, social and emotional MILESTONES at different points in children's lives.\n\n\n2) How? To identify general factors that contribute to development and the specific MECHANISMS by which they cause change.\n\n\n3) Says who? To consider how answers to each of the above questions depend on one's PERSPECTIVE and one's sources and\nmethods of data collection, all of which depend on theoretical stance, culture, and historical period.\n\n\n4) Then what? To explore specific APPLICATIONS of the What/When and How of development to everyday professional and personal life.", "prerequisite_knowledge": null, "assessment_structure": "There are four exams (we use the highest three scores), there are two mandatory papers that involve observing children at the Children's School (and an optional paper to replace a score from one of the mandatory papers), as well as pop quizzes.", "goals": "By the end of this course, students should be able to\nIdentify key milestones in childrens biological, cognitive, and social development from conception through adolescence. Compare, contrast, and critique theories alternate perspectives relevant to research methods, ethical considerations for studying development, and how development works i.e., hypothesized mechanisms. Relate the facts, theories and methods of developmental psychology to everyday problems, social issues and real world concerns across a variety of cultural contexts and generations i.e., possible applications. Describe evolutionary and historical changes in childhood and the science of child development. Demonstrate curiosity about child development in general, and how it applies to your own development.", "relevance": "Dietrich GenEd Prior to Fall 2021: Deciding\nDietrich GenEd After Fall 2021: Contextual Thinking\n\nStudents will learn about development in a way that can help them understand how they became the person they are today and help plan ways to maximize the positive when it comes to raising their own children. The class is also highly informative to students who wish to have careers in education or healthcare.", "learning_resources": "One textbook to be purchased. Additional readings, other materials, and information about the library are available on Canvas.", "extra_time_commitment": "¿ Four observations (45 mins each) at the Children's School.\n¿ Optional review classes and\n¿ If you have not taken two survey courses in psychology already, you will need to complete 3 credits of research participation or do a research paper that will take 3 hours."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "This course is about normal development from conception through adolescence. Topics include physical, perceptual, cognitive, emotional and social development. Students will learn facts about children at various points in development, theories about how development works, and research methods for studying development in infants and children. Students will be encouraged to relate the facts, theories and methods of developmental psychology to everyday problems, social issues and real world concerns.", "short_name": "PRINC CHILD DVLPMNT", "co_reqs": [], "instructors": [{"username": "eklepous", "first_name": "Ekaterini", "last_name": "Klepousniotou", "tags": [], "hours_per_week": 0, "id": 5079, "semesters_taught": [{"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}], "photo_url": null}, {"username": "thiessen", "first_name": "Erik", "last_name": "Thiessen", "tags": [], "hours_per_week": 0, "id": 962, "semesters_taught": [{"semester": 3, "year": 2020}], "photo_url": null}, {"username": "lburakow", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 3712, "semesters_taught": [{"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}], "photo_url": null}, {"username": "kmanke", "first_name": "Kody", "last_name": "Manke", "tags": [], "hours_per_week": 0, "id": 1583, "semesters_taught": [{"semester": 3, "year": 2020}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Principles of Child Development", "base_name": "Principles of Child Development", "skills": [{"id": 1189, "name": "Social Work", "slug": "social-work"}, {"id": 1193, "name": "Social Psychology", "slug": "social-psychology"}, {"id": 1194, "name": "Cognitive Psychology", "slug": "cognitive-psychology"}], "success": true, "attributes": [{"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "research", "id": 14}]}