{"code": "85-258", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "What is stigma; Why do we stigmatize; Stigma and Health: An Overview; Psychological and Cognitive-Affective Impacts of Stigma; Physiological Impacts of Stigma; Behavioral Impacts of Stigma; Impact of Stigma on Social Interactions; Internalized Stigma; Vicarious Stigma Experiences", "prerequisite_knowledge": null, "assessment_structure": "Attendance; In-class activities; Weekly online class discussions based on readings; writing assignment (application of concepts as they related to health); exam", "goals": "By the end of this course, students will be able to Define stigma and its many definitions and associated identities Identify and discuss the affective, behavioral, physiological, psychology and health consequences of stigma Critically examine some of theoretical and empirical approaches taken to study stigma Explain how stigma might be used to reduce unhealthy behaviors through social policies Communicate effectively about the rationale, methodology, findings, and interpretations of empirical and scholarly work", "relevance": "The influence of stigma is far-reaching and can have a debilitating effect on those directly and indirectly impacted by it. Stigma can manifest at multiple levels, for instance, through policies that overtly reject or fail to protect marginalized groups, individual acts of threat or harm, and self-devaluation based on negative group stereotypes. These, and other, manifestations can impact health and social functioning through physiological, affective, behavioral, and cognitive responses to stigma.", "learning_resources": "Dynamic classes including lecture and in-class activities; Course readings from multiple sources (science journalism and peer-reviewed; specific readings will be provided to students); diverse forms of media (videos, podcasts, music)", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}, {"sem": 3, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "This course will introduce students to theoretical and empirical psychological research on prejudice and social stigma. The topics covered will include examinations of why individuals stigmatize exploring cognitive, evolutionary, self, and system justification explanations. The course will examine the consequences of stigmatization for lowstatus groups e.g., stereotype threat, disidentification, internalization, health outcomes. We will explore the role of stigma in intergroup interactions and variation in the experience of stigma. Specific course topics will include the meaning of stigma, why people stigmatize, the physiological, cognitiveaffective and social behavioral processes linking stigma and health outcomes, and moderators of stigma.", "short_name": "INTRO TO HEALTH PSYC", "co_reqs": [], "instructors": [{"username": "mtrujill", "first_name": "Michael", "last_name": "Trujillo", "tags": [], "hours_per_week": 0, "id": 5218, "semesters_taught": [{"semester": 1, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Intro to Health Psychology: Stigma and Its Consequences", "base_name": "Intro to Health Psychology: Stigma and Its Consequences", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "communication", "id": 1}, {"type": "attribute", "name": "discussion intensive", "id": 2}, {"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "global", "id": 7}, {"type": "attribute", "name": "reading intensive", "id": 13}]}