{"code": "85-241", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2019}, {"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}, {"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The course focuses on how the situation -- the people around us, our experiences, our identities, our cultures, our immediate situations, the groups to which we belong -- affects basic psychological functions.", "prerequisite_knowledge": null, "assessment_structure": "Grades will be determined by performance on several written assignments and in-class and/or take-home exams.", "goals": "By the end of this courseStudents will learn, comparecontrast, and apply the foundational theories, concepts, themes, and history of social psychology to make sense of the complicated array of human behavior they observe in their own lives in the real world.Students will be familiar with landmark studies in social psychology as well as the research questions asked by contemporary social psychologists.Students will understand the scientific methods used by social psychologists to address these questions, and apply evidence from social psychological science to evaluate and explain how humans work.Students will describe and distinguish how different social psychological processes are at play in many different domains of everyday life. Students will be able to explain why they feel, think, and behave as they do in terms of the social contexts. Students will analyze their own experiences, the current situation, and world events in terms of varied social psychological theories, taking into account how social psychological theories have changed over time to better explain human behavior.Students will learn how social psychological theories have expanded to address human behavior across a wide variety of cultural contexts.", "relevance": "Dietrich GenEd Prior to Fall 2021: Deciding\nDietrich GenEd After Fall 2021: Contextual Thinking\n\nSocial psychology is the study of how the situation -- the people around us, our experiences, our identities, our cultures, our immediate situations, the groups to which we belong -- affects basic psychological functions, such as attitudes, decision making, communication, emotions, stress, performance, and health.", "learning_resources": "There is a textbook that will be used for classes. Assignments will be posted and submitted on Canvas. Study guides for all exams will be posted on Canvas as well.", "extra_time_commitment": "If you have not taken two survey courses in psychology already, you will need to complete 3 credits of research participation or do a research paper that will take 3 hours. Otherwise, the only time commitments outside of class will be time spent working on assignments."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "The focus of this course will be on how peoples behavior, feelings and thoughts are influenced or determined by their social environment. The course will begin with lectures and readings on how social psychologists go about studying social behavior. Next, various topics on which social psychologists have done research will be covered. These topics will include person perception, prejudice and discrimination, the nature of attitudes and how attitudes are formed and changed, interpersonal attraction, conformity, compliance, altruism, aggression, group behavior, and applications of psychology to problems in health care, law, politics, and the environment. Through readings and lectures on these topics, students will also be exposed to social psychological theories.", "short_name": "SOCIAL PSYCHOLOGY", "co_reqs": [], "instructors": [{"username": "lburakow", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 3712, "semesters_taught": [{"semester": 2, "year": 2019}, {"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}], "photo_url": null}, {"username": "eklepous", "first_name": "Ekaterini", "last_name": "Klepousniotou", "tags": [], "hours_per_week": 0, "id": 5079, "semesters_taught": [{"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}], "photo_url": null}, {"username": "ccritten", "first_name": "Crista", "last_name": "Crittenden", "tags": [], "hours_per_week": 0, "id": 2824, "semesters_taught": [{"semester": 1, "year": 2015}, {"semester": 1, "year": 2016}], "photo_url": null}, {"username": "oates", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 580, "semesters_taught": [{"semester": 1, "year": 2016}], "photo_url": null}, {"username": "dmallory", "first_name": "", "last_name": "", "tags": [], "hours_per_week": 0, "id": 1283, "semesters_taught": [{"semester": 1, "year": 2017}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Social Psychology", "base_name": "Social Psychology", "skills": [{"id": 1193, "name": "Social Psychology", "slug": "social-psychology"}], "success": true, "attributes": [{"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "reading intensive", "id": 13}, {"type": "attribute", "name": "research", "id": 14}]}