{"code": "85-252", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Relationship between Income level , educational status, social mobility , job status and strain and Housing disparities on mental and physical health outcomes", "prerequisite_knowledge": null, "assessment_structure": "(1) Class participation (2) Presentation leader for the day (3) Discussion Posts on the Class Discussion Board based on Weekly readings (4) 2 Essay exams based on course reading and materials. (5) Job Analysis Paper", "goals": "After taking this course students will be able to 1. Learn how socioeconomic factors can influence mental and physical health 2. Explore the mechanism by which socioeconomic factors can influence health 3. Understand the complexities of Health Inequalities and how such issues such as where you work, live, and go to school can help determine how long you will live. 4. Understand the link between Stress and some of the major health conditions", "relevance": "Throughout the world, research has found that the higher one's socioeconomic status, the longer one is likely to live. In this course we will examine the factors that make up SES and explore how these factors can impact one's quality of life. We will focus on income level, educational attainment and job status and prestige to determine what specific mechanisms can lead to health inequalities and what approaches have been taken or should be taken to decrease the disparities.", "learning_resources": "(1) All readings for this course will be posted on Canvas. (2) We will watch the film: \"Unnatural Causes: In Sickness and in Wealth\" that highlights health disparities by income level. This film is available on the CMU library streaming service. (3) Select chapters from the text: Social Epidemiology will be posted on Canvas.", "extra_time_commitment": "Extra time outside of class will be spent reading course materials and prepping for student led discussions. The two response essays will be completed outside of class. There will be one asynchronous class assignment where students will watch a film on their own and respond to questions based on its content."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}, {"sem": 3, "type": "INFO", "name": "specific_sem"}], "units": 9.0, "website": null, "long_desc": "Health Disparities exist in many countries around the world. For years researchers have sought to determine the root cause of these disparities and to explain why some people live significantly longer, healthier lives than others. Both mortality and morbidity rates can be related to ones place in society and ones interactions with others. This course is designed to critically examine the social factors research has found to impact individual and population health experiences. We will focus specifically on those factors that comprise ones socioeconomic status. Students in the course will learn how money and access to health services are not the only factors that matters when it comes to ones health.", "short_name": "INTRO TO HEALTH PSYC", "co_reqs": [], "instructors": [{"username": "coxboyd", "first_name": "Chante", "last_name": "Cox-Boyd", "tags": [], "hours_per_week": 0, "id": 225, "semesters_taught": [{"semester": 1, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Intro to Health Psychology: SES and Health Inequalities", "base_name": "Intro to Health Psychology: SES and Health Inequalities", "skills": [], "success": true, "attributes": []}