{"code": "85-377", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [], "sub_semesters": [], "campus_id": 2}], "max_units": 9.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "attitude change, human response, influence", "prerequisite_knowledge": "Students should have a basic understanding of Social psychology as it pertains to Attitude theory, Persuasion and Social Influence. In addition students should be familiar with research methodology and reading empirical journal articles.", "assessment_structure": "Class will involve 3 essay style exams along with a few other projects, including a research paper on a cult, an advertisement portfolio and the creation of an attitude survey.", "goals": "The primary goals of the course are to 1 understand the dynamics of attitude change 2 explore the mechanism by which attitude change techniques operate and 3 examine relevant theories and research in persuasion. By the end of the course students should be able to1.Critically analyze persuasive messages and communication and gain the ability to analyze and interpret their underlying purposes.2.Understand the history and the development of the field of attitude change. 3.Evaluate the application of empirical investigations on persuasion, social influence, and compliancegaining techniques. 4.Identify key theories, principles, and strategies of social influence and persuasion.5.Apply knowledge of research methodology in the creation of valid survey instruments.", "relevance": "This course should teach students about the tactics that are used each day to influence behavior and attitudes as well as the theories that underlie these tactics.", "learning_resources": "All journal articles and book chapters used for the course readings will be posted on Canvas. There is a text that is required and will need to be purchased separately.", "extra_time_commitment": "Beyond class time students will have to do independent research for the required research paper and work on collecting the advertisements needed for the portfolio project. In addition all students will need to read articles for class and prepare discussion material for their scheduled presentation dates."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 9.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 9.0, "website": null, "long_desc": "This advanced undergraduate course will focus on the topic of attitude change and how various persuasive techniques are used to shape human response. The dynamics of propaganda and what makes the techniques effective on social and consumer decisions will be addressed.  The primary goals of the course are to 1 understand the dynamics of attitude change 2 explore the mechanism by which attitude change techniques operate and 3 examine relevant theories and research in persuasion.  Examples of topics covered include the origins of attitudes, how attitudes influence judgments, social power and attitude change, and how individual decisions are influenced by the mass media.   Classic and contemporary research in the area of persuasion will be examined in the form of course readings and assignments.", "short_name": "ATTITUDES PERSUASION", "co_reqs": [], "instructors": [], "anti_reqs": [], "prereqs": {"text": "(85-241 at least D)", "raw_pre_req": "", "req_obj": {"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"default_concentration": false, "is_concentration": false, "is_uni_req": false, "is_shared": false, "choices": [{"constraints": [{"data": {"course": {"units": 9.0, "code": "85-241", "id": 6991, "name": "Social Psychology"}}, "is_hidden": false, "type_string": "", "type": "course", "id": 6991}], "id": 6992, "screen_name": "85-241"}], "constraints": [{"data": {"x": 1, "is_and": true}, "is_hidden": false, "type": "anyxof", "id": 13772}, {"data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "is_hidden": false, "type_string": "Minimum grade of D", "type": "mingrade", "id": 13773}], "id": 11228, "screen_name": "a9w0fpeheg1ffy6"}], "constraints": [{"data": {"x": 1, "is_and": true}, "is_hidden": false, "type": "anyxof", "id": 13771}], "id": 11227, "screen_name": "ine365nu6sg6lyt"}}, "is_req_repeatable": false, "topic": null, "name": "Attitudes and Persuasion", "base_name": "Attitudes and Persuasion", "skills": [], "success": true, "attributes": []}