{"code": "94-410", "name": "Telling Stories with Data", "base_name": "Telling Stories with Data", "units": 3.0, "min_units": 3.0, "max_units": 3.0, "short_name": "TELLING STORIES WITH", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [2], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [{"semester": 1, "year": 2024}], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "Data are everywhere. For policy makers, the ability to tell the right story using data can make the difference between a successful initiative and one that fails. Part art, part science, visualizing data is a process that is both well established in existing disciplines and experimental and rapidly changing in others. In this course well explore both ends of the spectrum as we deconstruct and reconstruct data visualizations behind some of the worlds most powerful brands, dig into our own data in compelling ways to help our readers understand complex issues, and finally experiment with new ways to represent data about our work, our community, and even ourselves. This course will provide handson training and experimentation with a number of tools, and students will have some flexibility to concentrate on mediums that best match their desired outcomes for a final project deliverable print, digital, interactive or immersive. By the end of this course, students will have an introduction to a number of different tools and techniques that will allow them to immediately start applying what theyve learned to both other coursework as well as onthejob needs.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [], "is_repeatable": true, "is_req_repeatable": true, "catalog_levels": [], "skills": [], "attributes": [], "custom_fields": {"goals": "Create data visualizations following good design practices color, text, layout, choice of visualization, etc in a digital format. Critique data visualizations by applying various critique methodologies, and be able to justify your own design decisions and recommendations. Apply methods for explaining and presenting data, constructing and telling a story using that data.", "key_topics": "data visualization, narrative building and storytelling, design, critique, chart types, presenting data", "prerequisite_knowledge": "Basic computer proficiency and comfortable working with datasets. Students should feel somewhat comfortable writing narrative-driven stories, reports, sharing and presenting data. Students should understand how to cite source material, avoid plagiarism concerns, and have a basic grasp of copyrights.", "assessment_structure": "Homework assignments including data visualization critiques, workshops. Depending on course structure, the development of an online portfolio and small final project may be incorporated.", "relevance": "Communicating effectively using data is an essential skill for many future workers, regardless of their specific role. This course also helps students become better evaluators of data visualizations and various methods.", "learning_resources": "There are two required texts for this course. Berinato, S. (2016). Good charts¿: the HBR guide to making smarter, more persuasive data visualizations. Boston, Massachusetts: Harvard Business Review Press. Berinato, S. (2019). Good Charts Workbook: Tips, Tools, and Exercises for Making Better Data Visualizations. Boston, Massachusetts: Harvard Business Review Press. Other materials as assigned through Canvas.", "extra_time_commitment": null}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}