{"code": "95-411", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2021}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": true, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "cryptography, BitCoin, Ethereum, decentralized peer to peer systems, Merkle Trees, distributed hash tables, smart contracts, distributed consensus, Solidity, ERC-20 Tokens, distributed ledger use cases and CMU Coin, self-sovereign identity", "prerequisite_knowledge": "None. There is programming involved but the necessary knowledge will be covered in the course.", "assessment_structure": "There are three lab exercises: Lab 1: Set up and deploy smart contracts to Ethereum using the Ganache test blockchain (10 Points) Lab 2: Develop, deploy, and interact with ERC-20 Token contracts (30 Points) Lab 3: Develop, deploy, interact with and debug a crowd sale token contract CMU-Coin (10 Points) Canvas based final exam covering lectures and labs (50 Points)", "goals": "The goals of the course are to introduce the student to peer to peer systems and the architecture of Bitcoin and Ethereum. In addition, the course provides the student with a deeper understanding of currencies and crypto currencies. Another goal is to provide handson experience programming smart contracts on the Ethereum blockchain. The course introduces the student to fundamental concepts in cryptography and the course explores potential business use cases of distributed ledger technologies, e.g., CMU Coin.", "relevance": "Blockchains, or distributed ledger and consensus technologies, hold tremendous promise for improving markets and organically handling private, secure data. And their use extends beyond cryptocurrencies. For two examples, distributed ledger technologies may be used in the future to provide self-sovereign identity management and asset tracking.", "learning_resources": "The primary tools we will use include: Javascript, MetaMask, Node.js, Truffle, Remix, and Ganache All of these tools are free for students to download.", "extra_time_commitment": "There will be 15 hours of in class instruction. The students is expected to work another 30 hours outside of class."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "This is a handson course covering blockchain technologies. We will discuss cryptography, BitCoin, Ethereum, decentralized peer to peer systems, Merkle Trees, distributed hash tables, smart contracts, distributed consensus, Solidity, ERC20 Tokens, distributed ledger use cases and CMU Coin, and selfsovereign identity. The course includes hands on lab exercises building smart contracts.", "short_name": "BLOCKCHAIN TECHNLG", "co_reqs": [], "instructors": [{"username": "mm6", "first_name": "Michael", "last_name": "Mccarthy", "tags": [], "hours_per_week": 0, "id": 1069, "semesters_taught": [{"semester": 2, "year": 2021}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": true, "topic": null, "name": "Blockchain Technologies", "base_name": "Blockchain Technologies", "skills": [], "success": true, "attributes": []}