{"code": "95-414", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Web of Things, REST, MQTT, HTTP, COAP, BLE, Node-Red, Node.js, Microcontrollers", "prerequisite_knowledge": "The student should be comfortable with some programming language.", "assessment_structure": "There will be two programming projects (40%) , a final presentation (20%), quizzes (10%), final exam (30%)", "goals": "At the end of this course, the student will be able to 1. understand the architectural principles that were used to design the World Wide Web. 2. design IoT systems using RESTful principles. 3. appreciate the differences in message formats, such as binary and textual, and be able to select which is appropriate in different settings. 4. will understand several important IoT protocols. We will study MQTT, XMPP, CoAP, HTTP, and BLE. 5. build firmware applications for a microcontroller. 6. build NodeRED flows. 7. build firmware applications that interact with digital twins on the cloud. 8. develop web applications that are usable in real time IoT environments. 9. appreciate the privacy and security issues associated with the IoT landscape. 10. appreciate the importance of identity and identity management in the internet of things.", "relevance": "The internet of things has countless applications and so should be of interest to a wide variety of students. Anyone interested in such topics as internet technologies, product design, city planning, sensor networks or software design, should find the course to be of interest.", "learning_resources": "The student will be provided with an Argon microcontroller. The student will install Node.js, Node-RED, and an MQTT broker.", "extra_time_commitment": "There will be programming outside of class. It is not an extensive amount but will normally require about 4 hours per week."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "units": 3.0, "website": null, "long_desc": "Traditional products are becoming smart products and smart products are becoming connected. From smart homes to smart cities, this trend in product development and design is likely to have a profound impact on our future.  This course takes the view that the internet of things is best viewed as an extension of the World Wide Web. So, throughout this course, we will consider how the Web was designed and how its principles can be used to design the internet of things.  The course combines weekly readings from journal articles with handson exercises and programming. The student will work with modern IOT technologies, standards, and platforms. We will connect sensors and actuators to the cloud but we will do so in a way that is based on sound architectural principles.", "short_name": "INTERNET OF THINGS", "co_reqs": [], "instructors": [{"username": "mm6", "first_name": "Michael", "last_name": "Mccarthy", "tags": [], "hours_per_week": 0, "id": 1069, "semesters_taught": [{"semester": 2, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Internet of Things", "base_name": "Internet of Things", "skills": [], "success": true, "attributes": []}