{"code": "98-023", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Binary and ternary search and their applications; -Stacks, queues, deques and techniques involving them; Prime sieves; -Greedy method of solving problems; Disjoint set union and small-to-large; Segment tree and prefix sum method; Mo's algorithm; Binary jumping and its application in different settings; Various utilities of the C++ standard template library, including IO, various template algorithms, and data structures.", "prerequisite_knowledge": "The course is designed with the assumption that students have some exposure to algorithms and data structures - more specifically, have a fundamental understanding of the content of 15-122.", "assessment_structure": "Homework and Exams", "goals": "By the end of the course, students will be able to Use the C programming language to implement their solutions for problems Understand topics and techniques widely used in competitive programming that are within the scope of the course Apply introduced topics and techniques to develop solutions for problems during competitions", "relevance": "The purpose of this course is to introduce in a practical and contextual manner topics of CP that both appear frequently in programming competitions and are based on familiar concepts that students (especially Computer Science majors) are exposed to during university courses. We will achieve this by revisiting some course content and extending the discussion towards applications in programming competitions. There are some overlapping topics with other courses but in this course, we will discuss in a more competition-oriented lens.", "learning_resources": "A computer that is enough to run Code::Blocks IDE, G++ compiler, and GDB debugger. Installation details will be mentioned in the course.", "extra_time_commitment": "Besides lectures, students are expected to spend 1 hour a week on homework assignments"}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"sem": 2, "type": "INFO", "name": "specific_sem"}], "grade_option": {"is_audit": false, "name": "Pass/Fail", "short_name": "P", "never_graded": false, "is_pass_fail": true, "id": 4}, "units": 3.0, "website": null, "long_desc": "Competitive programming CP is commonly referred to as a mind sport like chess, puzzles, etc. that requires participants to give solutions to specific problems under certain constraints and allotted time. It is useful because it not only helps players improve their problem solving ability and coding skills but also opens many career opportunities as big companies such as Google, Microsoft, etc. pay close attention to the CP community and recruit top players. Amazing as it is, however, getting started with the field can be difficult. Although Carnegie Mellon University currently offers two courses to introduce students to CP  15195 and 15295, These courses concentrate intensively on the most common algorithms and introducing theoretical concepts but overlook more practical aspects  useful tricks, good implementation style, etc. Therefore, we propose a StuCo course to fill in this gap.", "short_name": "STUCO COMPETITIV PRG", "co_reqs": [], "instructors": [{"username": "tnbui", "first_name": "Thang", "last_name": "Bui", "tags": [], "hours_per_week": 0, "id": 5374, "semesters_taught": [{"semester": 1, "year": 2022}], "photo_url": null}, {"username": "agenze", "first_name": "Andrey", "last_name": "Genze", "tags": [], "hours_per_week": 0, "id": 5375, "semesters_taught": [{"semester": 1, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Student Taught Courses (StuCo):Start Playing with Competitive Programming Gently", "base_name": "Student Taught Courses (StuCo):Start Playing with Competitive Programming Gently", "skills": [], "success": true, "attributes": []}