{"code": "98-175", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This course is designed to help students understand computational biology by developing computational models and algorithms that look at biological systems. The course will be divided into three parts. The first part covers the history of computational biology and the current developments in this field. The second part covers genomics and computational problems. Here, we will examine the different tools and databases utilized to understand computational biology. The tools will include, but not restricted to, simple statistics; mathematics; computer science knowledge (python); and molecular genomics. The third and last part covers genome sequence and real-life examples. Here, we will be modeling population dynamics, cell pathways, and neuron behaviors in organisms.", "prerequisite_knowledge": null, "assessment_structure": "Case Studies", "goals": "Genomics, Algorithms Python, Ancestry, DNA Sequencing, Forensics, Genetics, Genotyping, Molecular Biology, Protein Folding", "relevance": "Computational Biology is the future of medicine as it harnesses the computational power of technology and invests in saving people's lives.", "learning_resources": "Use of some online courses from Coursera, Brilliant, CMUP Bioinformatics Algorithms: An Active Learning Approach - Stepik https://brilliant.org/courses/computational-biology/#chapter-introduction-13", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "grade_option": {"is_audit": false, "name": "Pass/Fail", "short_name": "P", "never_graded": false, "is_pass_fail": true, "id": 4}, "units": 3.0, "website": null, "long_desc": "This course is designed to help students understand computational biology by developing computational models and algorithms that look at biological systems. The course will be divided into three parts. The first part covers the history of computational biology and the current developments in this field. The second part covers genomics and computational problems. Here, we will examine the different tools and databases utilized to understand computational biology. The tools will include, but not restricted to, simple statistics mathematics computer science knowledge python and molecular genomics. The third and last part covers genome sequence and reallife examples. Here, we will be modeling population dynamics, cell pathways, and neuron behaviors in organisms.", "short_name": "STUCO: CB SCN INV", "co_reqs": [], "instructors": [{"username": "ashaar", "first_name": "Abdullah", "last_name": "Shaar", "tags": [], "hours_per_week": 0, "id": 5071, "semesters_taught": [{"semester": 2, "year": 2022}], "photo_url": null}, {"username": "ntali", "first_name": "Nour", "last_name": "Ali", "tags": [], "hours_per_week": 0, "id": 5072, "semesters_taught": [{"semester": 2, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "StuCo:CBSI: Comp Bio Scene Investigation", "base_name": "StuCo:CBSI: Comp Bio Scene Investigation", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "research", "id": 14}]}