{"code": "98-160", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This course will allow students with interest in art to delve deep into different art techniques and challenge their 'artsy' identity through various workshops, art experiments and hands-on projects in every class. We will also discuss the hidden ecological impact of different types of artworks, develop a pathline to becoming an artsy in an academic setting, introduce some new art projects for students' further personal growth and develop an artistic community among the student enthusiasts.", "prerequisite_knowledge": null, "assessment_structure": "Mini homeworks, art submissions, group project and attendance", "goals": "Recognize their artistic abilities and be aware of the possible ways to explore and experiment with their art interests Recognize the impact of artworks to our environment Have amazing mini art projects", "relevance": "This course will allow students to apply their artistic skills in everyday life and develop their sense of art for further interests", "learning_resources": "Art supplies, class presentations and external source materials", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "grade_option": {"is_audit": false, "name": "Pass/Fail", "short_name": "P", "never_graded": false, "is_pass_fail": true, "id": 4}, "units": 3.0, "website": null, "long_desc": "This course will allow students with interest in art to delve deep into different art techniques and challenge their artsy identity through various workshops, art experiments and handson projects in every class.  We will also discuss the hidden ecological impact of different types of artworks, develop a pathline to becoming an artsy in an academic setting, introduce some new art projects for students further personal growth and develop an artistic community among the student enthusiasts.", "short_name": "STUCO: AFT SCH ART", "co_reqs": [], "instructors": [{"username": "gserikba", "first_name": "Gulnaz", "last_name": "Serikbay", "tags": [], "hours_per_week": 0, "id": 5211, "semesters_taught": [{"semester": 2, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Student Taught Courses (STUCO): After School Art", "base_name": "Student Taught Courses (STUCO): After School Art", "skills": [], "success": true, "attributes": []}