{"code": "98-193", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 1, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Quantum computing, qubits, quantum gates, quantum algorithms, quantum applications.", "prerequisite_knowledge": "A little exposure to probabilities and python programing", "assessment_structure": "Short canvas quizzes every 2 weeks. And a Midterm exam.", "goals": "The primary goal of the quotIntro to Quantum Computingquot course is to provide students with acomprehensive understanding of the basics of quantum computing. By the end of the course,students will be able to Describe the fundamental concepts of quantum mechanics andquantum computing, including qubits, quantum gates, quantum circuits, and quantumalgorithms. Explain the key differences between classical computing and quantum computingand the unique features of quantum computing that make it different from classical computing.", "relevance": "This course is highly relevant for its cutting-edge technology, growing demand for professionals in the field, interdisciplinary approach, real-world applications, & hands-on learning opportunities. Students gain a practical understanding of how\nquantum computing solves real-world problems.", "learning_resources": "Qiskit Textbook", "extra_time_commitment": "Final Project"}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "grade_option": {"is_audit": false, "name": "Pass/Fail", "short_name": "P", "never_graded": false, "is_pass_fail": true, "id": 4}, "units": 3.0, "website": null, "long_desc": "Introduction to Quantum Computing is a course designed to provide an accessible introduction to the rapidly evolving field of quantum computing, REGARDLESS of the participants academic background or experience. The course begins by introducing the basic principles of quantum computing and the fundamental concepts of qubits, quantum gates, superposition, entanglement, and quantum algorithms. It covers topics such as quantum circuits and quantum applications. The course is structured to accommodate learners with diverse backgrounds, including those with little or no prior knowledge of computer science. It is designed to provide a solid foundation in quantum computing, with a focus on practical applications that are currently being developed and explored. Throughout the course, participants will be exposed to a range of quantum computing tools and techniques, including quantum simulators and programming languages. They will also be introduced to some of the key players in the field and the latest research and developments.", "short_name": "INTRO TO QUANTUM COM", "co_reqs": [], "instructors": [{"username": "useitkal", "first_name": "Ulan", "last_name": "Seitkaliyev", "tags": [], "hours_per_week": 0, "id": 5876, "semesters_taught": [{"semester": 1, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Student Taught Courses (StuCo): Intro to Quantum Computing", "base_name": "Student Taught Courses (StuCo): Intro to Quantum Computing", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "for non-majors", "id": 6}, {"type": "attribute", "name": "lab component", "id": 11}]}