{"code": "98-138", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2020}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": true, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Leading and Following; Listening to Rhythm; Foxtrot; Waltz; Tango; Chacha; Rumba; Swing", "prerequisite_knowledge": null, "assessment_structure": "Most of the homework would involve practicing specific moves taught in class at home so that students are ready to put them into practice by the next class and learn new moves each class. Other outside classwork may involve encouragement to perform in CMU events.\nMid-term:\nMidterm will involve finding a video of a ballroom performance on any dances we have learned so far. The assignment will involve identifying three moves that we practiced in class in the video and stating which ones they are. They will have to submit the link for the video and a short description of the dance moves they recognized.\nFinal Exam:\nThere is no final exam in this class.\nGrading Policy:\nYou will receive either a Pass or No-credit at the end of this course. Students are expected to attend all classes and two absences are allowed at most throughout the semester. Participation is all that is required", "goals": "The goal of this course is to introduce the basic concepts of ballroom dancing to students and to make them comfortable in taking part in social dances.Successful students will learn1. Leading and following principles2. Basic patterns in each of the dances3. Timings for each of the patterns4. Unique characteristics for each of the dances", "relevance": "This course is useful for anyone interested in becoming confident at social dancing", "learning_resources": "https://www.ballroomdancers.com/Learning_Center/", "extra_time_commitment": "Students will be encouraged to perform at CMU-Q events"}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"sem": 2, "type": "INFO", "name": "specific_sem"}], "grade_option": {"is_audit": false, "name": "Pass/Fail", "short_name": "P", "never_graded": false, "is_pass_fail": true, "id": 4}, "units": 3.0, "website": null, "long_desc": "Ballroom dancing is a set of partner dances that are enjoyed worldwide both socially and competitively. The goal of this course is to introduce the basic concepts of ballroom dancing to students and to make them comfortable in taking part in social dances.  The dances that are taught in this course include American or International forms of foxtrot, waltz, tango, chacha, rumba, and swing. Depending on the learning pace of students, we may further cover salsa and jive. Students will learn three to four basic patterns in each of the dances, the timings for each of the patterns, as well as the unique characteristics for each dance. Furthermore, students will learn the central leading and following principles of ballroom dancing. No past experience in dancing is expected just the energy and spirit for dancing", "short_name": "STUCO BLLRM  DANCE", "co_reqs": [], "instructors": [{"username": "fshiyap", "first_name": "Fariza", "last_name": "Shiyap", "tags": [], "hours_per_week": 0, "id": 4385, "semesters_taught": [{"semester": 2, "year": 2020}], "photo_url": null}, {"username": "mnk1", "first_name": "Nahin", "last_name": "Khan", "tags": [], "hours_per_week": 0, "id": 4386, "semesters_taught": [{"semester": 2, "year": 2020}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": true, "topic": null, "name": "Student Taught Courses: Introduction to Ballroom Dancing", "base_name": "Student Taught Courses: Introduction to Ballroom Dancing", "skills": [], "success": true, "attributes": []}