{"code": "98-240", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "This course will focus on the motivations that drive serial killers as well as the recurring trends throughout their childhood and young-adult life that can influence their behaviors and bad decisions. The motivations that will be discussed in this course will be attention-seeking, financial benefits, aggression, thrill-seeking, pleasure and power. Analytical approaches will be used to explore trends contributing to the development of a serial killer such as childhood trauma, social isolation, maternal relationship, unresolved mental illness and neurological disorders among others. Biological trait theories and psychodynamic theory will also be explored and applied throughout the course. Critical thinking and problem solving skills will be implemented to analyze the mentioned motives, trends and traits, in order to predict possible outcomes of the events being explained. Lectures and Reading materials will provide students with the required knowledge to analyze intricate details in events revolving serial killers.", "prerequisite_knowledge": null, "assessment_structure": "Students will be assessed on Discussion boards, one paper, and presentation.", "goals": "Demonstrate understanding of major theories, concepts and trends in the field of Criminology, Understand and apply social psychological concepts and theories to examples presented in class, Apply and utilize skills of basic investigative research to cases discussed in class as well as cases discussed in papers and presentations, Understand ethical issues when dealing with studies in the field of criminology", "relevance": "The course helps students understand the manner in which a human can develop into a serial killer, that can be achieved through understanding their earlier interactions (childhood) and how the trend in their behavior can be witnessed in many other killers. Such trends can then be studied by criminologists so the behaviors are recognized in the early stages of a person's life and thus prevent the development of more serial killers. Anyone who desires to have a basic knowledge of how serial killers develop and operate in addition to understanding the psychological aspects that betters our understanding of this type of behavior. This course also exposes students to analytical and critical thinking skills that detectives and officers adopt in their jobs to catch such criminals.", "learning_resources": "Videos, readings and powerpoints provided by the instructors on Canvas. Videos and Readings may include: https://www.youtube.com/watch?v=MImP3wMWjIs https://www.youtube.com/watch?v=j7yMSgPYF2k https://www.youtube.com/watch?v=1EUfxrtFGzA&t=5375shttps://www.youtube.com/watch?v=ptVjXHgsal4&t=10s https://www.youtube.com/watch?v=fhfI_9cvfUQ https://www.youtube.com/watch?v=orsxuAjBaY0http://web.lemoyne.edu/~Freemams/index_files/psych_serial.htm This is most of the information we have gathered so far, and we plane to include other readings and resources.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}, {"sem": 2, "type": "INFO", "name": "specific_sem"}], "grade_option": {"is_audit": false, "name": "Pass/Fail", "short_name": "P", "never_graded": false, "is_pass_fail": true, "id": 4}, "units": 3.0, "website": null, "long_desc": "Weve all wondered what goes on inside the mind of someone who would resort to killing others. This course aims to satisfy your curiosity by going inside the mind of a serial killer, analyzing the recurring trends or traumas throughout their childhood and young adult life, their motivations, and biological aspects that can influence their behaviors. In this course, students will gain critical thinking and problemsolving skills by analyzing intricate details in events revolving around serial killings, and be able to speculate what would have been going on inside the mind of the serial killer.", "short_name": "STUCO:MIND SRL KILL", "co_reqs": [], "instructors": [{"username": "selnatsh", "first_name": "Shahrazad", "last_name": "El Natsheh", "tags": [], "hours_per_week": 0, "id": 5680, "semesters_taught": [{"semester": 2, "year": 2023}], "photo_url": null}, {"username": "aalkhanj", "first_name": "Alreem", "last_name": "Alkhanji", "tags": [], "hours_per_week": 0, "id": 5205, "semesters_taught": [{"semester": 2, "year": 2022}], "photo_url": null}, {"username": "asalameh", "first_name": "Ayah", "last_name": "Salameh", "tags": [], "hours_per_week": 0, "id": 5208, "semesters_taught": [{"semester": 2, "year": 2022}], "photo_url": null}, {"username": "aamohame", "first_name": "Abubakr", "last_name": "Mohamed", "tags": [], "hours_per_week": 0, "id": 5679, "semesters_taught": [{"semester": 2, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Student Taught Courses (StuCo): Inside the Mind of a Serial Killer", "base_name": "Student Taught Courses (StuCo): Inside the Mind of a Serial Killer", "skills": [], "success": true, "attributes": [{"type": "attribute", "name": "discussion intensive", "id": 2}]}