{"code": "98-318", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 2, "year": 2019}, {"semester": 2, "year": 2023}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": true, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "In this course, we will take a very brief look at the world of Arabic calligraphy, with a strong emphasis on the practical aspect of it. We will focus mainly on the two most frequently used fonts in modern Arabic media, Req'a and Naskh, and learn how to apply these fonts to some common words and phrases", "prerequisite_knowledge": null, "assessment_structure": "weekly practice reflection for students to identify their weakness points and work on them. Assignments that aim to solidify the skills of the students by writing a subset of chosen words. Midterm quiz to assess the students' understanding of the historical and artistic significance of arabic calligraphy. Final project for students to put everything they learnt in one piece of art and talk about it.", "goals": "Identify and differentiate between different Arabic letters . Recognize the differences and similarities between Reqa and Naskh fonts. Learn to properly handle and use calligraphers tools and pens . Write simple phrases and words in both the Reqa and Naskh fonts. Appreciate the significance of Arabic calligraphy in the context of Islamic design", "relevance": "For students who prefer to explore before they commit to learning Arabic, this course is an excellent opportunity to do just that. The course introduces the writing system in an artistic context that allows for the discovery of cultural connections. This course is an opportunity to see Arabic in a broader context and from a rarely explored perspective: Visual Expression. This course also targets people who already know Arabic and would like to improve their own calligraphy skills", "learning_resources": "Chapters of textbooks and video recordings to be provided by the instructor", "extra_time_commitment": "3 hours of weekly practice outside class. Students who cannot demonstrate their handling of calligraphy pens might opt to record a video instead."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "grade_option": {"is_audit": false, "name": "Pass/Fail", "short_name": "P", "never_graded": false, "is_pass_fail": true, "id": 4}, "units": 3.0, "website": null, "long_desc": "Arabic language is a beautiful language that inherits a heritage of Islamic prosperity across millennia. Of particular importance to the field of Arabic language is the craft of writing its words and letters, which on itself is a vast field with plentiful of contributions from calligraphers throughout the past 1400 years. In this course, we will take a very brief look at the world of Arabic calligraphy, with a strong emphasis on the practical aspect of it. We will focus mainly on the two most frequently used fonts in modern Arabic media, Reqa and Naskh, and learn how to apply these fonts to some common words and phrases.", "short_name": "STUCO: ARABIC CALLIG", "co_reqs": [], "instructors": [{"username": "iib", "first_name": "Iram Baqri", "last_name": "Iram Irshad Baqri", "tags": [], "hours_per_week": 0, "id": 3943, "semesters_taught": [{"semester": 2, "year": 2019}], "photo_url": null}, {"username": "efatima", "first_name": "Eman Fatima", "last_name": "Fatima", "tags": [], "hours_per_week": 0, "id": 3942, "semesters_taught": [{"semester": 2, "year": 2019}], "photo_url": null}, {"username": "dtabaa", "first_name": "Diram", "last_name": "Tabaa", "tags": [], "hours_per_week": 0, "id": 5676, "semesters_taught": [{"semester": 2, "year": 2023}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": true, "topic": null, "name": "Student Taught Courses (StuCo): A Practical Inroduction to Arabic Calligraphy", "base_name": "Student Taught Courses (StuCo): A Practical Inroduction to Arabic Calligraphy", "skills": [{"id": 1426, "name": "Painting", "slug": "painting"}], "success": true, "attributes": []}