{"code": "98-336", "offered_in_campuses": [2, 1], "offerings": [{"semesters": [{"semester": 1, "year": 2018}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "The Big Twelve\nCreationism in GM\nFamous Heroes & Monsters Part 1\nFamous Heroes & Monsters Part 2\nDeath, Afterlife, & Underworld\nMinor Gods\nStories and Lore of the Sea\nWorld Building\nI Can't Believe It's Not Science\nLife Lessons\nWars in GM\nDrama and Theatre\nMythology's influence on Religion & History\nMythology in the Media & Art", "prerequisite_knowledge": null, "assessment_structure": "Students will be given an open-note midterm exam testing them on the Greek Mythology content discussed in class so far, and will be graded on effort in answering the questions. Students will complete a final project in the class of their choosing, and projects will be presented the last week of class. Students will be graded on completion of the project and their presentation.", "goals": "We will dive into the world of Mount Olympus and try to answer why the power of storytelling in Ancient Greece had such a lasting impact on future generations, and how we can see manifestations of these stories and the lessons they teach in modern media.", "relevance": "Mythology came about as early as the twelfth century BCE in Ancient Greece, and was a vital part of Ancient GrecoRoman society. Even today, in the 21st century, the stories and lessons of Greek mythology influence and shape modern society. In this class, we will explore every aspect of Greek Mythology, from its stories of creation, to the major gods and goddesses and what they represent, and how it has influenced its successors, such as other religions of the world and the arts and theatre.", "learning_resources": "Lecture slides and video clips, articles, and story excerpts that we use in class will be made available.", "extra_time_commitment": "There will be a final project to be completed out of class."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"type": "INFO", "name": "intermittent"}], "grade_option": {"is_audit": false, "name": "Pass/Fail", "short_name": "P", "never_graded": false, "is_pass_fail": true, "id": 4}, "units": 3.0, "website": null, "long_desc": "Greek myths have continued to inspire and capture the imagination for thousands of years. This course presents a basic introduction to Greek mythology and the concepts that are essential to understanding mythology. Students in this course will gain an understanding of Greek mythology and the Olympian gods and goddesses through readings, movies and discussions of these ancient stories.", "short_name": "STUCO: GREEK MYTHS", "co_reqs": [], "instructors": [{"username": "iih", "first_name": "Ismail", "last_name": "Hassan", "tags": [], "hours_per_week": 0, "id": 3597, "semesters_taught": [{"semester": 1, "year": 2018}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Student Taught Courses (StuCo): Introduction to Greek Mythology", "base_name": "Student Taught Courses (StuCo): Introduction to Greek Mythology", "skills": [], "success": true, "attributes": []}