{"code": "99-231", "offered_in_campuses": [2], "offerings": [{"semesters": [{"semester": 2, "year": 2020}], "sub_semesters": [], "campus_id": 2}], "max_units": 3.0, "is_topic": false, "is_repeatable": true, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "- Interdisciplinary humanistic, social, and science perspectives for the study of Environment and Sustainability\n- Concepts about Population from the scientific discipline of Ecology (populations of trees, fish, endangered species), and the history of common traps and misguided attempts to apply human-environment models across disciplines (racism and eugenics, \"tragedy of the commons,\" \"population bomb\")\n- Environmental Justice: the application of social justice for environmental problems, typically for urban residents near a pollution source", "prerequisite_knowledge": null, "assessment_structure": "Course requirements\n- complete all course readings as assigned\n- participate in class discussion\n- participate in small group activities during class time\n- take an open-notes reading quizzes or complete short written assignments for the beginning of each class\n- complete a short group project with individual essay component, to be submitted on Canvas", "goals": "Upon successful completion of this course, students should be able to Apply social and scientific perspectives to environmental problems Distinguish among methods for evaluating environmental problems Identify environmental justice issues within the context of proposed policy solutionsand distinguish among impacts on different communities, and different groups ofstakeholders, when considering environmental problems and proposed solutions", "relevance": "Environmental problems are complex and require insights from both scientific and social perspectives. For example, it is not enough to tackle climate change solely by knowing the science; it is also very important to communicate well, and to understand the relevant ethics, economics, policy, and business aspects. Although this course does not explicitly address the example of climate change, this course includes and draws awareness to concepts coming from different disciplines, calling these \"Environmental Ideas.\" The course builds competence for students to identify, and name, different approaches for dealing with complex problems of environment and sustainability.", "learning_resources": "Mostly ebooks available through CMU Libraries and pdfs linked on Canvas. The course relies heavily on Canvas web-based resources.", "extra_time_commitment": null}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 3.0, "offering_tags": [{"sem": 1, "type": "INFO", "name": "specific_sem"}], "units": 3.0, "website": null, "long_desc": "Environmental problems are complex and require insights from both scientific and social perspectives. For example, it is not enough to tackle climate change solely by knowing the science it is also very important to communicate well, and to understand the relevant ethics, economics, policy, and business aspects. Although this course does not explicitly address the example of climate change, this course includes and draws awareness to concepts coming from different disciplines, calling these Environmental Ideas. The course builds competence for students to identify, and name, different approaches for dealing with complex problems of environment and sustainability.  Upon successful completion of this course, students should be able to  Apply social and scientific perspectives to environmental problems  Distinguish among methods for evaluating environmental problems  Identify environmental justice issues within the context of proposed policy solutions and distinguish among impacts on different communities, and different groups of stakeholders, when considering environmental problems and proposed solutions", "short_name": "INTRO ENV IDEAS", "co_reqs": [], "instructors": [{"username": "aeowen", "first_name": "Abigail", "last_name": "Owen", "tags": [], "hours_per_week": 0, "id": 448, "semesters_taught": [{"semester": 2, "year": 2020}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": true, "topic": null, "name": "Introduction to Environmental Ideas", "base_name": "Introduction to Environmental Ideas", "skills": [], "success": true, "attributes": []}