{"code": "99-411", "offered_in_campuses": [1, 2], "offerings": [{"semesters": [{"semester": 3, "year": 2018}, {"semester": 3, "year": 2019}, {"semester": 3, "year": 2020}, {"semester": 3, "year": 2021}, {"semester": 3, "year": 2022}], "sub_semesters": [], "campus_id": 2}], "max_units": 19.0, "is_topic": false, "is_repeatable": false, "admin_context": {"counts_for": [], "suggested_by_advisor": null}, "custom_fields": {"key_topics": "Experiential learning, applied learning, connecting theories and practice in the professional context", "prerequisite_knowledge": "The internship should be connected to the student's major and career goals to allow for the development of an understanding as to how theories and academic knowledge are implemented in the professional arena.", "assessment_structure": null, "goals": "Identify connections between the internship experience and academic theories to demonstrate how academic theories apply or are used within professional contexts. Identify skills developed at the internship that are important to professional success within the discipline. Explain major contributions of projects worked on or completed while at the internship site. Analyze how their internship experience contributes to their growth within professional and academic contexts. Discuss the gaps in knowledge and experience to allow them to identify areas of improvement and achieve their professional goals.", "relevance": "This course allows students to explore how their academic education applies to professional contexts to allow them to identify strengths and weaknesses in their education in relation to professional goals.", "learning_resources": "Internship supervisors should be providing guidance on project goals and expectations. This may include additional training as it relates to the professional context.", "extra_time_commitment": "Students are required to complete at least 15 hours at their internship site per unit being awarded and write a short paper about their experience for completion of this course."}, "equiv": [], "student_sets": [{"id": 896, "name": "undergraduate"}], "min_units": 1.0, "offering_tags": [{"sem": 3, "type": "INFO", "name": "specific_sem"}], "units": 1.0, "website": null, "long_desc": "This course allows students to engage in paid experiential learning that integrates knowledge and theories from their academic discipline within a relevant professional context. This should include a meaningful project at the internship site where practical application and skills development occurs relevant to the students major. The internship can be at an internal CMU or external site. Students will need to complete a proposal and supervisor agreement form to be eligible. Students are responsible for finding internships and paying for the units of credit. In addition to the time spent at the internship site, students will be expected to write a short paper explaining the application of knowledge and theories as well as skills developed at the internship site as they relate to professional career goals. The course is not eligible for CPT for international students please contact the Office for International Education for more information. Variable units are decided on a casebycase basis.  THIS COURSE CANNOT BE TAKEN PASSNO PASS.  Please contact Dr. Korryn Mozisek, Director of Integrative Learning, Office of the Vice Provost for Education, to discuss your individual internship requirements at kmozisekandrew.cmu.edu Phone 4122683441 or Cathy Ribarchak at cr2andrew.cmu.edu 4122688677.", "short_name": "SUMMER INTERNSHIP", "co_reqs": [], "instructors": [{"username": "selmal", "first_name": "Selma", "last_name": "Limam Mansar", "tags": [], "hours_per_week": 0, "id": 1512, "semesters_taught": [{"semester": 2, "year": 2016}, {"semester": 3, "year": 2017}, {"semester": 3, "year": 2016}, {"semester": 3, "year": 2018}], "photo_url": null}, {"username": "jfn", "first_name": "Jarrin", "last_name": "Nevel", "tags": [], "hours_per_week": 0, "id": 3982, "semesters_taught": [{"semester": 3, "year": 2019}, {"semester": 3, "year": 2020}, {"semester": 3, "year": 2021}, {"semester": 3, "year": 2022}], "photo_url": null}], "anti_reqs": [], "prereqs": {"text": "", "raw_pre_req": "", "req_obj": null}, "is_req_repeatable": false, "topic": null, "name": "Summer Internship", "base_name": "Summer Internship", "skills": [], "success": true, "attributes": []}