{
  "course_code": "76270",
  "course_title": "Writing for the Professions",
  "units": "9",
  "description": "Workplace communicators use words and images to connect people with information and to structure experiences for audiences to take action. To be effective, they must learn to design communications across genres and media, and with a keen sense of audience, purpose, contexts, and constraints. In this course, you will sharpen your abilities to communicate information effectively, ethically, and responsibly to people with different needs. Our assignments and conversations will take us through a wide range of genres and rhetorical situations (oral and written) that you can expect to encounter in the workplace. A high-level goal for the course is to combine theory, methods, and known best practices for putting our readers at the center of our writing, with a strong emphasis on building a communication design toolkit for reaching non-expert audiences and navigating novel situations. By the end of the course, through writing, feedback, analysis, reflection, and revision, you will leave with a set of polished examples of your ability to communicate nimbly across genres.",
  "prereqs": "(76101) or (76102) or (76106 and 76107) or (76106 and 76108) or (76107 and 76108)",
  "coreqs": "None",
  "sections": [
    {
      "section_type": "Lecture",
      "section_id": "W",
      "timings": {
        "days": [
          "UT"
        ],
        "begin": "02:30PM",
        "end": "03:45PM",
        "teaching_location": "Doha, Qatar",
        "delivery_mode": "In-person Expectation",
        "instructor": [
          "Mitchell, Thomas"
        ]
      }
    },
    {
      "section_type": "Lecture",
      "section_id": "X",
      "timings": {
        "days": [
          "UT"
        ],
        "begin": "10:00AM",
        "end": "11:15AM",
        "teaching_location": "Doha, Qatar",
        "delivery_mode": "In-person Expectation",
        "instructor": [
          "Pessoa, Silvia"
        ]
      }
    }
  ]
}